[
  {
    "TEXT_ID": "fraz_0001",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "رنجش ہی سہی دل ہی دکھانے کے لیے آ",
    "TITLE_EN": "Ranjish Hi Sahi Dil Hi Dukhane Ke Liye Aa",
    "CONTENT": "رنجش ہی سہی دل ہی دکھانے کے لیے آ\nآ پھر سے مجھے چھوڑ کے جانے کے لیے آ\n\nدنیا نے سمجھا ہے کہ تجھ سے نہیں کام ہمارا\nکیا کام ہے تیرا بھی زمانے کے لیے آ\n\nاب تم پہ کیا الزام کہ تم نے نہیں سنا\nہم نے بھی بہت چاہا مگر ہم سے نہ ہو سکا\n\nفرازؔ اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "Come, even if with hurt, just to break my heart\nCome, even if to leave me again after coming\n\nThe world thinks I have no connection with you\nWhat is your business too? Come for the world's sake\n\nNow what blame on you that you didn't listen?\nI too wished very much, but couldn't manage it\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "One of Faraz's most famous ghazals. The opening line 'Ranjish hi sahi' is iconic in Urdu poetry."
  },
  {
    "TEXT_ID": "fraz_0002",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب کے ہم بچھڑے تو شاید کبھی خوابوں میں ملیں",
    "TITLE_EN": "Ab Ke Hum Bichhde To Shayad Kabhi Khwabon Mein Milein",
    "CONTENT": "اب کے ہم بچھڑے تو شاید کبھی خوابوں میں ملیں\nجس طرح سوکھے ہوئے پھول کتابوں میں ملیں\n\nدھوپ میں نکلو گے چھاؤں میں نہایا کرو گے\nیوں بھی ہوتا ہے کہ کچھ لوگ زمانوں میں ملیں\n\nفرازؔ اس شہر میں کس سے ملیں\nہر چہرہ پہ اجنبیت چھائی ہے",
    "TRANSLATION_EN": "Now that we've parted, perhaps we'll meet in dreams\nLike dried flowers found in books\n\nYou'll step out in the sun, you'll bathe in shade\nSometimes people meet across ages too\n\nFaraz, whom should I meet in this city?\nEvery face is covered with strangeness",
    "notes": "A beautiful ghazal about separation and the hope of meeting in dreams. The imagery of dried flowers in books is particularly poignant."
  },
  {
    "TEXT_ID": "fraz_0003",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ کہ گئے کہ تجھ سے محبت نہیں ہے پر",
    "TITLE_EN": "Wo Keh Gaye Ke Tujh Se Mohabbat Nahi Hai Par",
    "CONTENT": "وہ کہ گئے کہ تجھ سے محبت نہیں ہے پر\nکچھ اور بات ہے جو انھیں بے خود کیے ہوئے\n\nتم آئے تو آنکھوں میں بہار آ گئی\nتم گئے تو دل میں خزاں چھا گئی\n\nفرازؔ اب اس کے بعد کون آئے گا\nدل کی دنیا سنسان ہے",
    "TRANSLATION_EN": "She said she has no love for me, but\nSomething else keeps her entranced still\n\nWhen you came, spring came to my eyes\nWhen you left, autumn descended on my heart\n\nFaraz, after this who will come?\nThe world of the heart is desolate",
    "notes": "A ghazal about the mystery of the beloved's feelings and the desolation after separation."
  },
  {
    "TEXT_ID": "fraz_0004",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "محبت میں یہ بھی ممکن ہے کبھی تم یاد آؤ",
    "TITLE_EN": "Mohabbat Mein Ye Bhi Mumkin Hai Kabhi Tum Yaad Aao",
    "CONTENT": "محبت میں یہ بھی ممکن ہے کبھی تم یاد آؤ\nکبھی ہم یاد آئیں کبھی تم یاد آؤ\n\nتم آؤ تو آنکھوں میں بہار آ جائے\nتم جاؤ تو دل میں خزاں چھا جائے\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "In love, it's possible that someday you'll come to mind\nSomeday I'll come to mind, someday you'll come to mind\n\nWhen you come, spring comes to my eyes\nWhen you leave, autumn descends on my heart\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about the cyclical nature of memory in love - sometimes the lover remembers, sometimes the beloved."
  },
  {
    "TEXT_ID": "fraz_0005",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یہ جو اک پل کی مسافت ہے",
    "TITLE_EN": "Ye Jo Ek Pal Ki Masafat Hai",
    "CONTENT": "یہ جو اک پل کی مسافت ہے\nاسے بھی کٹنا ہے تم سے ملنا ہے\n\nدل میں سمٹی ہوئی تنہائی\nآنکھوں میں بکھری ہوئی یادیں\n\nفرازؔ اس شہر میں کس سے کہیں\nدل کی بات کسی سے کہی نہیں جاتی",
    "TRANSLATION_EN": "This journey of a single moment\nIt too must pass, I have to meet you\n\nLoneliness compressed in the heart\nMemories scattered in the eyes\n\nFaraz, in this city, whom should I tell?\nThe heart's words can't be told to anyone",
    "notes": "A ghazal about the anticipation of meeting and the inability to share heart's feelings."
  },
  {
    "TEXT_ID": "fraz_0006",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل کی بات کہیں تک نہ گئی",
    "TITLE_EN": "Dil Ki Baat Kahin Tak Na Gayi",
    "CONTENT": "دل کی بات کہیں تک نہ گئی\nتم آئے تو بات بننے لگی\n\nرات بھر جاگتے رہنا ہے\nکوئی آنے کا نہیں آنے کے ترستے ہی رہو\n\nفرازؔ اب اس انتظار میں\nعمر بھر کٹ گئی",
    "TRANSLATION_EN": "The heart's words didn't go far\nWhen you came, matters started working out\n\nMust keep awake all night\nNo one comes, but keep longing for arrival\n\nFaraz, in this waiting\nMy whole life has passed",
    "notes": "A ghazal about unexpressed feelings and the endless waiting that consumes life."
  },
  {
    "TEXT_ID": "fraz_0007",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تم آئے تو کہا تھا زندگی مل گئی",
    "TITLE_EN": "Tum Aaye To Kaha Tha Zindagi Mil Gayi",
    "CONTENT": "تم آئے تو کہا تھا زندگی مل گئی\nتم گئے تو کہا دل کو تسلی مل گئی\n\nکچھ تو ہے جو چھپایا ہے تم نے\nورنہ اتنا تو کوئی بے وفا نہیں ہوتا\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "When you came, I said life was found\nWhen you left, I said the heart found solace\n\nThere's something you've hidden\nOtherwise no one is so unfaithful\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about finding life in the beloved's presence and the mystery of hidden feelings."
  },
  {
    "TEXT_ID": "fraz_0008",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب کے ہم نے سوچا ہے کہ اب نہیں ملنا",
    "TITLE_EN": "Ab Ke Hum Ne Socha Hai Ke Ab Nahin Milna",
    "CONTENT": "اب کے ہم نے سوچا ہے کہ اب نہیں ملنا\nپھر بھی دل ہے کہ مانتا نہیں\n\nتم بھی کبھی تو یاد آؤ گے\nہم بھی کبھی تو بھول جائیں گے\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "This time I've decided not to meet\nYet the heart refuses to listen\n\nSomeday you too will come to mind\nSomeday I too will forget\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about the conflict between decision and emotion."
  },
  {
    "TEXT_ID": "fraz_0009",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کچھ تو دن میں بھی اندھیرا ہوتا",
    "TITLE_EN": "Kuchh To Din Mein Bhi Andhera Hota",
    "CONTENT": "کچھ تو دن میں بھی اندھیرا ہوتا\nکاش وہ یاد نہ آتا کوئی\n\nرات بھر جاگتے رہنا ہے\nکوئی آنے کا نہیں آنے کے ترستے ہی رہو\n\nفرازؔ اب اس انتظار میں\nعمر بھر کٹ گئی",
    "TRANSLATION_EN": "If only there were darkness even during the day\nIf only no one came to mind\n\nMust keep awake all night\nNo one comes, but keep longing for arrival\n\nFaraz, in this waiting\nMy whole life has passed",
    "notes": "A ghazal wishing for darkness to escape memories."
  },
  {
    "TEXT_ID": "fraz_0010",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس نے تو اک نظر میں دیکھ لیا",
    "TITLE_EN": "Uss Ne To Ek Nazar Mein Dekh Liya",
    "CONTENT": "اس نے تو اک نظر میں دیکھ لیا\nہم نے سمجھا کہ دل لگا لیا\n\nاب وہی بات نہیں رہی اے دوست\nدل وہی ہے تو کیا ہوا\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "She looked just once\nI thought I had won her heart\n\nNow things aren't the same, O friend\nWhat if the heart is the same?\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about misinterpretation of a glance and the paradox of love."
  },
  {
    "TEXT_ID": "fraz_0011",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "سنا ہے لوگ اسے آنکھ بھر کے دیکھتے ہیں",
    "TITLE_EN": "Suna Hai Log Use Aankh Bhar Ke Dekhte Hain",
    "CONTENT": "سنا ہے لوگ اسے آنکھ بھر کے دیکھتے ہیں\nتو اس کے شہر میں کچھ دن ٹھہر کے دیکھتے ہیں\n\nبہار آئی تو اے فرازؔ کچھ نہ کہنا تم\nکہ وہ خود آئے گی ہم منتظر کے دیکھتے ہیں",
    "TRANSLATION_EN": "I've heard people gaze at her with filled eyes\nSo in her city, let's stay a few days and see\n\nWhen spring comes, O Faraz, say nothing\nShe'll come herself, we'll wait and see",
    "notes": "A famous ghazal about the beloved's beauty and the patience of waiting."
  },
  {
    "TEXT_ID": "fraz_0012",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ جو ہم میں تم میں قرار تھا",
    "TITLE_EN": "Wo Jo Hum Mein Tum Mein Qarar Tha",
    "CONTENT": "وہ جو ہم میں تم میں قرار تھا تمہیں یاد ہو کہ نہ یاد ہو\nوہی بات جانے کی بات تھی تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ چاند رات وہ نغمہ ہا وہ بہار کا سماں تھا\nوہ جو ہم پہ گزری سو گزری مگر تمہیں یاد ہو کہ نہ یاد ہو\n\nفرازؔ اس بات پہ کیا بنا کہ وہ بات جانے کی بات تھی",
    "TRANSLATION_EN": "That understanding we shared, whether you remember or not\nThat was the thing to forget, whether you remember or not\n\nThat moonlit night, those songs, that spring-like atmosphere\nWhat happened to us happened, but whether you remember or not\n\nFaraz, what came of that? That was the thing to forget",
    "notes": "A nostalgic ghazal about past memories and their fading nature."
  },
  {
    "TEXT_ID": "fraz_0013",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "زندگی سے یہی شکوہ ہے کہ تو ملتا نہیں",
    "TITLE_EN": "Zindagi Se Yahi Shikwa Hai Ke Tu Milta Nahin",
    "CONTENT": "زندگی سے یہی شکوہ ہے کہ تو ملتا نہیں\nورنہ ہم کس لیے ترستے ہیں کوئی ملتا نہیں\n\nدرد سے میری داستاں کیا ہے\nدرد ہی درد ہے فسانہ کیا\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "My only complaint from life is that you're not found\nOtherwise why do I long? No one is found\n\nWhat is my story of pain?\nThere's only pain, what tale to tell?\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about the complaint from life itself for not granting union with the beloved."
  },
  {
    "TEXT_ID": "fraz_0014",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "درد سے میری داستاں کیا ہے",
    "TITLE_EN": "Dard Se Meri Dastan Kya Hai",
    "CONTENT": "درد سے میری داستاں کیا ہے\nدرد ہی درد ہے فسانہ کیا\n\nوہ جو آئے تو آنکھوں میں بہار آ گئی\nوہ جو گئے تو دل میں خزاں چھا گئی\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "What is my story of pain?\nThere's only pain, what tale to tell?\n\nWhen she came, spring came to my eyes\nWhen she left, autumn descended on my heart\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about the inexpressibility of pain and the impact of the beloved's presence and absence."
  },
  {
    "TEXT_ID": "fraz_0015",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم نے بھی پیار کیا ہے تم نے بھی پیار کیا ہے",
    "TITLE_EN": "Hum Ne Bhi Pyaar Kiya Hai Tum Ne Bhi Pyaar Kiya Hai",
    "CONTENT": "ہم نے بھی پیار کیا ہے تم نے بھی پیار کیا ہے\nکچھ تو اعتبار کیا ہے کچھ تو اعتبار کیا ہے\n\nدل ٹوٹا تو کیا ہوا آنسو بہے تو کیا ہوا\nتم نے بھی پیار کیا ہے ہم نے بھی پیار کیا ہے\n\nفرازؔ اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "I too have loved, you too have loved\nSome trust was placed, some trust was placed\n\nIf the heart broke, so what? If tears flowed, so what?\nYou too have loved, I too have loved\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about mutual love and the resilience to bear its consequences."
  },
  {
    "TEXT_ID": "fraz_0016",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تم یاد آئے تو دل کو قرار آ گیا",
    "TITLE_EN": "Tum Yaad Aaye To Dil Ko Qarar Aa Gaya",
    "CONTENT": "تم یاد آئے تو دل کو قرار آ گیا\nورنہ بہت دنوں سے دل بے قرار تھا\n\nآنکھوں میں خواب بن کے اتر گئی ہے تم\nدل میں اتر گئے تو مکان تو نہ تھا\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "When you came to mind, my heart found peace\nOtherwise for many days it had been restless\n\nYou've descended in my eyes like a dream\nIf you descended in my heart, it had no space\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about the peace that comes with the beloved's memory and the paradox of heart's capacity."
  },
  {
    "TEXT_ID": "fraz_0017",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ جو ملتے تھے کبھی راہوں میں",
    "TITLE_EN": "Wo Jo Milte Thay Kabhi Rahon Mein",
    "CONTENT": "وہ جو ملتے تھے کبھی راہوں میں\nاب وہ راہیں بھی اجڑ گئی ہیں\n\nدل کی دنیا میں اک چاند اترا\nرات بھر جگمگاتا رہا\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "Those who used to meet on paths\nNow those paths too are desolate\n\nIn the heart's world, a moon descended\nIt kept shining all night\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about the desolation of paths once walked together and the illumination of memory."
  },
  {
    "TEXT_ID": "fraz_0018",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "آنکھوں میں بسی ہے تمہاری یاد",
    "TITLE_EN": "Aankhon Mein Basi Hai Tumhari Yaad",
    "CONTENT": "آنکھوں میں بسی ہے تمہاری یاد\nدل میں اتری ہے تمہاری صورت\n\nکبھی تنہائی میں یاد آؤ گے\nکبھی محفل میں ستاؤ گے\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "Your memory resides in my eyes\nYour image has descended in my heart\n\nSometimes in loneliness you'll come to mind\nSometimes in gatherings you'll torment\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about the omnipresence of the beloved's memory in both solitude and company."
  },
  {
    "TEXT_ID": "fraz_0019",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل کی بات کسی سے کہی نہیں جاتی",
    "TITLE_EN": "Dil Ki Baat Kisi Se Kahi Nahin Jati",
    "CONTENT": "دل کی بات کسی سے کہی نہیں جاتی\nہم خاموش ہیں تو خاموشی بھی بھاری ہے\n\nیوں ہی انتظار کا موسم نہیں گزرتا\nکوئی تو آئے کہ دن رات کاٹے جائیں\n\nفرازؔ اس شہر میں کون سنے گا\nدل کی بات کسی سے کہی نہیں جاتی",
    "TRANSLATION_EN": "The heart's words can't be told to anyone\nI'm silent, and the silence too is heavy\n\nThe season of waiting doesn't pass like this\nLet someone come, so days and nights pass\n\nFaraz, in this city, who will listen?\nThe heart's words can't be told to anyone",
    "notes": "A ghazal about the heaviness of silence and the need for a confidant."
  },
  {
    "TEXT_ID": "fraz_0020",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب اس کے بعد بھی دل لگتا ہے",
    "TITLE_EN": "Ab Uss Ke Baad Bhi Dil Lagta Hai",
    "CONTENT": "اب اس کے بعد بھی دل لگتا ہے\nکچھ تو ہے جس کا غم کھاتے ہیں\n\nرات بھر جاگتے رہنا ہے\nکوئی آنے کا نہیں آنے کے ترستے ہی رہو\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "Even after this, the heart is attached\nThere is something whose grief I consume\n\nMust keep awake all night\nNo one comes, but keep longing for arrival\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about the persistence of attachment despite everything, and the heaviness of waiting."
  },
  {
    "TEXT_ID": "fraz_0021",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تم آئے ہو تو رات ڈھل گئی ہے",
    "TITLE_EN": "Tum Aaye Ho To Raat Dhal Gayi Hai",
    "CONTENT": "تم آئے ہو تو رات ڈھل گئی ہے\nچلو اب آنکھیں بند کر لیں\n\nبہت دنوں کی پیاس تھی دل میں\nتم آئے تو پیاس بجھ گئی\n\nفرازؔ خواب تو دیکھا تھا مگر\nوہ آنکھیں کھلیں تو تم نہ تھے",
    "TRANSLATION_EN": "You've come, so the night has ended\nLet's now close our eyes\n\nThere was a long thirst in my heart\nWhen you came, the thirst was quenched\n\nFaraz, I saw a dream, but\nWhen I opened my eyes, you weren't there",
    "notes": "A ghazal about the arrival of the beloved and the fulfillment of longing."
  },
  {
    "TEXT_ID": "fraz_0022",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یوں ہی انتظار کا موسم نہیں گزرتا",
    "TITLE_EN": "Yun Hi Intezar Ka Mausam Nahin Guzarta",
    "CONTENT": "یوں ہی انتظار کا موسم نہیں گزرتا\nکوئی تو آئے کہ دن رات کاٹے جائیں\n\nدل کی بات کسی سے کہیں نہیں جاتی\nہم خاموش ہیں تو خاموشی بھی بھاری ہے\n\nفرازؔ اس شہر میں کوئی تو ہو\nجس سے دل کا حال کہہ سکیں",
    "TRANSLATION_EN": "The season of waiting doesn't pass like this\nLet someone come, so days and nights pass\n\nThe heart's words can't be told to anyone\nI'm silent, and the silence too is heavy\n\nFaraz, in this city, let there be someone\nTo whom I can tell my heart's condition",
    "notes": "A ghazal exploring the heaviness of silence and the need for a confidant."
  },
  {
    "TEXT_ID": "fraz_0023",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم پہ اب بھی ہے اس کی مہربانی",
    "TITLE_EN": "Hum Pe Ab Bhi Hai Uski Mehrbani",
    "CONTENT": "ہم پہ اب بھی ہے اس کی مہربانی\nکہ وہ یاد آتی ہے راتوں کو\n\nدل کو اب کسی بات کا غم نہیں\nدل کو اب تو اس کی عادت ہے\n\nفرازؔ اب کون سنے گا فریاد\nلوگ کہتے ہیں کہ بہت ہو چکا",
    "TRANSLATION_EN": "I still have her kindness\nThat she comes to mind at night\n\nThe heart now grieves for nothing\nThe heart is now accustomed to her\n\nFaraz, who will now hear my cry?\nPeople say it's been enough",
    "notes": "A ghazal about the bittersweet nature of memory when the beloved no longer comes."
  },
  {
    "TEXT_ID": "fraz_0024",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل کو ترستے ہی رہنا ہے ترستے ہی رہو",
    "TITLE_EN": "Dil Ko Taraste Hi Rehna Hai Taraste Hi Raho",
    "CONTENT": "دل کو ترستے ہی رہنا ہے ترستے ہی رہو\nکوئی ملنے کا نہیں ملنے کے ترستے ہی رہو\n\nرات بھر جاگتے رہنا ہے جاگتے ہی رہو\nکوئی آنے کا نہیں آنے کے ترستے ہی رہو\n\nفرازؔ اب اس انتظار میں\nعمر بھر کٹ گئی",
    "TRANSLATION_EN": "The heart must keep longing, keep longing\nNo one comes, but keep longing for meeting\n\nMust keep awake all night, keep awake\nNo one comes, but keep longing for arrival\n\nFaraz, in this waiting\nMy whole life has passed",
    "notes": "A ghazal about perpetual longing and waiting that becomes a way of life."
  },
  {
    "TEXT_ID": "fraz_0025",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یہی زندگی ہے تو کیا زندگی",
    "TITLE_EN": "Yahi Zindagi Hai To Kya Zindagi",
    "CONTENT": "یہی زندگی ہے تو کیا زندگی\nکہ جس میں نہ تم ہو نہ تمہاری یاد\n\nبہاروں نے آ کر پکارا بہت\nچمن میں مگر اک کلی بھی نہ کھلی\n\nفرازؔ اب کے ہم نے یہ سوچا ہے\nکہ اب کے تم آؤ تو بات بنے",
    "TRANSLATION_EN": "If this is life, then what is life?\nIn which neither you nor your memory exists\n\nSprings called out many times\nBut not a single bud bloomed in the garden\n\nFaraz, this time I've thought\nThat if you come now, things might work out",
    "notes": "A philosophical ghazal questioning the meaning of life without love or memory of the beloved."
  },
  {
    "TEXT_ID": "fraz_0026",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کبھی کبھی کوئی خواب آنکھوں میں رہ جاتا ہے",
    "TITLE_EN": "Kabhi Kabhi Koi Khwab Aankhon Mein Reh Jata Hai",
    "CONTENT": "کبھی کبھی کوئی خواب آنکھوں میں رہ جاتا ہے\nکبھی کبھی کوئی بات دل میں اتر جاتی ہے\n\nتم آئے تو آنکھوں میں بہار آ گئی\nتم گئے تو دل میں خزاں چھا گئی\n\nفرازؔ اب اس کے بعد کون آئے گا\nدل کی دنیا سنسان ہے",
    "TRANSLATION_EN": "Sometimes a dream remains in the eyes\nSometimes a word settles in the heart\n\nWhen you came, spring came to my eyes\nWhen you left, autumn descended on my heart\n\nFaraz, after this who will come?\nThe world of the heart is desolate",
    "notes": "A ghazal about dreams that persist and words that leave lasting impressions."
  },
  {
    "TEXT_ID": "fraz_0027",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ آتے تو کہتے کہ دل ہے نہیں",
    "TITLE_EN": "Wo Aate To Kahte Ke Dil Hai Nahin",
    "CONTENT": "وہ آتے تو کہتے کہ دل ہے نہیں\nکوئی اور بھی ہے جس کو غم ملا\n\nتم آئے تو آنکھوں میں بس گئے\nتم گئے تو دل میں اتر گئے\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "If they came, they'd say there's no heart\nSomeone else also received sorrow\n\nWhen you came, you settled in my eyes\nWhen you left, you descended into my heart\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about the mystery of the beloved's indifference and hidden feelings."
  },
  {
    "TEXT_ID": "fraz_0029",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب کے ہم بچھڑے تو شاید",
    "TITLE_EN": "Ab Ke Hum Bichhde To Shayad",
    "CONTENT": "اب کے ہم بچھڑے تو شاید کبھی خوابوں میں ملیں\nجس طرح سوکھے ہوئے پھول کتابوں میں ملیں\n\nدل کی تسکین کو اے فرازؔ اتنا ہی کافی تھا\nکہ وہ یاد آئے کہ وہ یاد آئے کہ وہ یاد آئے",
    "TRANSLATION_EN": "Now that we've parted, perhaps we'll meet in dreams\nLike dried flowers found in books\n\nTo soothe the heart, Faraz, this much was enough\nThat she came to mind, that she came to mind, that she came to mind",
    "notes": "A famous couplet about separation and the hope of meeting in dreams."
  },
  {
    "TEXT_ID": "fraz_0030",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم جو بھی ہیں تمہارے ہیں",
    "TITLE_EN": "Hum Jo Bhi Hain Tumhare Hain",
    "CONTENT": "ہم جو بھی ہیں تمہارے ہیں\nتم جو بھی ہو ہمارے ہو\n\nدل میں اتر گئی ہے تمہاری صورت\nآنکھوں میں بس گئی ہے تمہاری یاد\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "Whatever we are, we are yours\nWhatever you are, you are ours\n\nYour image has descended into my heart\nYour memory has settled in my eyes\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about complete belonging to the beloved and the mystery of their hidden feelings."
  },
  {
    "TEXT_ID": "fraz_0031",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب تو عادت سی ہے مجھ کو",
    "TITLE_EN": "Ab To Aadat Si Hai Mujh Ko",
    "CONTENT": "اب تو عادت سی ہے مجھ کو اس کے غم میں مسکرانے کی\nہر گھڑی یہ نہیں ہوتا کہ دل کو قرار آ جائے\n\nکبھی تنہائی بھی ہوتی ہے تو وہ یاد آئے\nکبھی محفل بھی سجتی ہے تو وہ یاد آئے\n\nفرازؔ کا دل ہے کہ اب بھی\nاسی راہ تکا کرتا ہے",
    "TRANSLATION_EN": "Now it's become a habit to smile in her grief\nIt's not every moment that the heart finds peace\n\nSometimes in loneliness, she comes to mind\nSometimes in gatherings, she comes to mind\n\nFaraz's heart is such that even now\nIt keeps staring at that same path",
    "notes": "A ghazal about the habit of smiling in grief and the constant presence of the beloved's memory."
  },
  {
    "TEXT_ID": "fraz_0032",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یہ جو ایک شمع جلتی ہے",
    "TITLE_EN": "Ye Jo Ek Shamma Jalti Hai",
    "CONTENT": "یہ جو ایک شمع جلتی ہے دل کے جلنے کی آگ سے\nیہ جو رات بھر جگتی ہے تمہارے آنے کی آس سے\n\nکوئی تو آئے کہ صبح ہو جائے\nکوئی تو آئے کہ رات ڈھل جائے\n\nفرازؔ اب اس انتظار میں\nعمر بھر کٹ گئی",
    "TRANSLATION_EN": "This candle burns with the fire of the heart's burning\nIt stays awake all night with the hope of your coming\n\nLet someone come, so morning arrives\nLet someone come, so the night passes\n\nFaraz, in this waiting\nMy whole life has passed",
    "notes": "A ghazal using the candle as a metaphor for the waiting heart, burning with hope."
  },
  {
    "TEXT_ID": "fraz_0033",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کچھ اس کی یاد نے ایسے گھیرا",
    "TITLE_EN": "Kuchh Uski Yaad Ne Aise Ghera",
    "CONTENT": "کچھ اس کی یاد نے ایسے گھیرا\nکہ خیال بھی کسی کا نہ رہا\n\nاب وہ نہیں تو کیا ہے\nیہ دل ہے کہ دھڑکتا ہے\n\nتھا تو سارا زمانہ مگر\nاک اس کے بغیر کچھ نہ تھا\n\nفرازؔ کا دل ہے کہ اب بھی\nاس کی باتوں میں کھویا رہتا ہے",
    "TRANSLATION_EN": "Her memory surrounded me so\nThat no other thought remained\n\nNow that she's not here, what is there?\nThis heart that keeps beating\n\nThe whole world existed, but\nWithout her, there was nothing\n\nFaraz's heart is such that even now\nIt remains lost in her words",
    "notes": "A ghazal about how the beloved's memory consumes all other thoughts and makes the world meaningless without them."
  },
  {
    "TEXT_ID": "fraz_0034",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ ہم نہیں جو پہلے تھے",
    "TITLE_EN": "Wo Hum Nahin Jo Pehle Thay",
    "CONTENT": "وہ ہم نہیں جو پہلے تھے ہزار غم سہے\nمگر یہ دل کہ اب تک ہزار غم سہے\n\nعمر بھر اس کا غم رہا فرازؔ\nکوئی دن اور بھی جیے جا کر\n\nاس کی جھلک دیوانہ کرے\nوہ نظر کہاں سے لاؤں",
    "TRANSLATION_EN": "We are not what we were; we've endured a thousand sorrows\nBut this heart has till now endured a thousand sorrows\n\nHer grief remained with me all my life, Faraz\nMay I live a few more days\n\nHer glimpse drives one mad\nWhere can I find that vision?",
    "notes": "A ghazal about transformation through suffering and the impossibility of finding anyone like the beloved."
  },
  {
    "TEXT_ID": "fraz_0035",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "چاندنی رات میں تنہا",
    "TITLE_EN": "Chandni Raat Mein Tanha",
    "CONTENT": "چاندنی رات میں تنہا کچھ نہ کہنا مجھ سے\nیاد کا بوجھ اٹھانا ہے تو سہنا مجھ سے\n\nدل کی دنیا میں اتر آئی ہے اس کی صورت\nآنکھوں میں بس گئی ہے اس کی یاد\n\nفرازؔ اب اس کے بعد کیا کیجیے\nدل لگا کر بھی دل نہیں لگا",
    "TRANSLATION_EN": "In the moonlit night, alone, don't say anything to me\nIf you have to bear the burden of memory, then endure me\n\nHer image has descended into my heart's world\nHer memory has settled in my eyes\n\nFaraz, after this what should I do?\nEven after loving, the heart is not attached",
    "notes": "A ghazal about the burden of memory in moonlit nights and the torment of love."
  },
  {
    "TEXT_ID": "fraz_0036",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب کسی کے غم میں جلنا کیا",
    "TITLE_EN": "Ab Kisi Ke Gham Mein Jalna Kya",
    "CONTENT": "اب کسی کے غم میں جلنا کیا\nدل کو سمجھا کر یہ کہا کرتے تھے\n\nاس نے تو اک بار پکارا تھا\nہم سمجھے زندگی مل گئی\n\nآج تک یاد ہے وہ بات کہ اس نے\nمسکرا کر کہا تھا کبھی آنا\n\nفرازؔ کا دل ہے کہ اب بھی\nاس کی یاد میں کھویا رہتا ہے",
    "TRANSLATION_EN": "Why now burn in anyone's grief?\nTrying to console the heart, I'd say this\n\nShe called out just once\nI thought I had found life\n\nI still remember those words when she\nSmiling, said: come sometime\n\nFaraz's heart is such that even now\nIt remains lost in her memory",
    "notes": "A ghazal about a single call that promised life and the suspicion that unfaithfulness hides something deeper."
  },
  {
    "TEXT_ID": "fraz_0037",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ جو اک بار مل گیا تھا",
    "TITLE_EN": "Wo Jo Ek Baar Mil Gaya Tha",
    "CONTENT": "وہ جو اک بار مل گیا تھا\nاس کا ملنا بھی کوئی ملنا تھا\n\nابھی تو کچھ دن اور ہیں اے دوست\nکہ جب وہ یاد آئے گا اور ہم نہ ہوں گے\n\nفرازؔ نے سمجھا تھا کہ غم کم ہو گا\nغم نے تو اور گھیر لیا",
    "TRANSLATION_EN": "That meeting that happened once\nThat was some meeting indeed\n\nThere are still some days left, O friend\nWhen she will come to mind and I won't be there\n\nFaraz thought grief would decrease\nGrief only surrounded him more",
    "notes": "A ghazal about a significant meeting that defines what meeting means, and how grief increases when expected to decrease."
  },
  {
    "TEXT_ID": "fraz_0038",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کچھ تو ہے جو اس نے چھپایا",
    "TITLE_EN": "Kuchh To Hai Jo Uss Ne Chhupaya",
    "CONTENT": "کچھ تو ہے جو اس نے چھپایا\nورنہ اتنی بھی بے رخی نہ تھی\n\nوہ جو اک بار مل گیا تھا\nاس کا جانا بھی کوئی جانا تھا\n\nدل کو اب کسی بات سے فرصت نہیں\nاس کی یاد ہے یا اس کا غم\n\nفرازؔ نے کیا کیا دیکھا\nپھر بھی دل نہیں بھرتا",
    "TRANSLATION_EN": "There's something she hid\nOtherwise she wasn't this indifferent\n\nThat meeting that happened once\nThat departure too was some departure\n\nThe heart now has no respite from anything\nEither her memory or her grief\n\nWhat all did Faraz see?\nStill the heart is not satisfied",
    "notes": "A ghazal about hidden things beneath indifference and the heart's eternal dissatisfaction."
  },
  {
    "TEXT_ID": "fraz_0039",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس نے تو اک نظر میں دیکھ کر",
    "TITLE_EN": "Uss Ne To Ek Nazar Mein Dekh Kar",
    "CONTENT": "اس نے تو اک نظر میں دیکھ کر\nسارے غم بھلا دیے\n\nکیا کہیں کہ کس طرح\nاس کی یاد آتی ہے\n\nاب تو عادت سی ہے مجھے\nاس کے غم میں مسکرانے کی\n\nفرازؔ کا دل ہے کہ اب بھی\nاسی راہ تکا کرتا ہے",
    "TRANSLATION_EN": "She, by looking just once\nMade me forget all sorrows\n\nWhat can I say, how\nHer memory comes\n\nNow it's become a habit for me\nTo smile in her grief\n\nFaraz's heart is such that even now\nIt keeps staring at that same path",
    "notes": "A ghazal about the power of a single glance to erase sorrow and the habit of smiling in grief."
  },
  {
    "TEXT_ID": "fraz_0040",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "آج پھر اس کا خیال آیا",
    "TITLE_EN": "Aaj Phir Uss Ka Khayal Aaya",
    "CONTENT": "آج پھر اس کا خیال آیا\nدل نے چاہا کہ رو نہ پائیں\n\nوہ جو بات اس نے کہی تھی\nآج تک وہ بات ہے\n\nابھی تو کچھ اور دن ہیں\nکہ جب اس کی باری آئے گی\n\nفرازؔ کو اب کسی بات کی\nخبر نہیں کچھ بھی",
    "TRANSLATION_EN": "Today her thought came again\nThe heart wished not to weep\n\nThose words she had spoken\nThose words remain till today\n\nThere are still some days left\nWhen her turn will come\n\nFaraz now knows nothing\nOf anything at all",
    "notes": "A ghazal about the persistence of memory and the final state of knowing nothing at all."
  },
  {
    "TEXT_ID": "fraz_0041",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل تو بہل گیا تھا کچھ دیر",
    "TITLE_EN": "Dil To Behal Gaya Tha Kuchh Der",
    "CONTENT": "دل تو بہل گیا تھا کچھ دیر\nپھر وہی یاد پھر وہی غم\n\nاس کی گلی میں جاتے ہیں\nپر اب وہ بات نہیں\n\nکیا کہیں کہ کس طرح\nاس نے یاد رکھا\n\nاب تو آنکھوں میں بس گیا ہے\nوہ کہیں اور ہے ہی نہیں\n\nفرازؔ کا دل ہے کہ اب بھی\nاسی دھن میں لگا رہتا ہے",
    "TRANSLATION_EN": "The heart was distracted for a while\nThen again that memory, again that grief\n\nI go to her lane\nBut now that magic is gone\n\nWhat can I say, how\nShe remembered\n\nNow she has settled in my eyes\nShe is nowhere else at all\n\nFaraz's heart is such that even now\nIt remains absorbed in that same obsession",
    "notes": "A ghazal about the cycle of distraction and return to memory, with the beloved dwelling in the eyes."
  },
  {
    "TEXT_ID": "fraz_0042",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم نے سمجھا تھا کہ وہ بھول گئے",
    "TITLE_EN": "Hum Ne Samjha Tha Ke Woh Bhool Gaye",
    "CONTENT": "ہم نے سمجھا تھا کہ وہ بھول گئے\nوہ تو ہمیں یاد کر رہے تھے\n\nآج پھر وہ آئے یاد\nدل نے چاہا کہ کھو جائیں\n\nکچھ اس کی یاد نے ایسے گھیرا\nکہ خیال بھی نہ بچا\n\nفرازؔ کی زندگی کا تو\nیہی عالم رہا",
    "TRANSLATION_EN": "I thought she had forgotten\nShe was actually remembering me\n\nToday she came to memory again\nThe heart wished to lose itself\n\nHer memory surrounded me so\nThat no thought remained\n\nFaraz's life has always been\nIn this same state",
    "notes": "A ghazal about the irony of assuming the beloved has forgotten when she actually remembers."
  },
  {
    "TEXT_ID": "fraz_0043",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ جو ہم سے مل کر مسکرائے تھے",
    "TITLE_EN": "Wo Jo Hum Se Mil Kar Muskurae Thay",
    "CONTENT": "وہ جو ہم سے مل کر مسکرائے تھے\nآج تک وہ مسکراہٹ یاد ہے\n\nدل کو اب کسی بات سے\nکوئی شکوہ نہیں\n\nکیا بتائیں کہ اس کی یاد میں\nکیا کچھ کھویا\n\nاب تو یہ حال ہے کہ\nخود سے بھی ملنے کا دل نہیں\n\nفرازؔ کا کام ہے دل لگانا\nاب یہی سلسلہ رہا",
    "TRANSLATION_EN": "That smile with which she met me\nI remember that smile till today\n\nThe heart now has no\nComplaint about anything\n\nHow can I tell what all\nI lost in her memory?\n\nNow the state is such\nThat I don't even feel like meeting myself\n\nFaraz's work is to love\nNow this is the only routine left",
    "notes": "A ghazal about an enduring smile that remains in memory, and the state of not wanting to meet even oneself."
  },
  {
    "TEXT_ID": "fraz_0044",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "آج پھر اس کی یاد آئی تو",
    "TITLE_EN": "Aaj Phir Uss Ki Yaad Aai To",
    "CONTENT": "آج پھر اس کی یاد آئی تو\nسارا دن کھویا کھویا رہا\n\nہر گھڑی یہ نہیں ہوتا کہ\nدل کو چین آ جائے\n\nوہ جو اک بار مل گیا تھا\nاس کا ملنا بھی کوئی ملنا تھا\n\nابھی تو ہم نے سوچا تھا\nشاید کچھ اور بھی ہے\n\nفرازؔ سے پوچھو کہ اس نے\nکس کی یاد میں دن کاٹے",
    "TRANSLATION_EN": "Today when her memory came\nI remained lost the whole day\n\nIt's not every moment that\nThe heart finds peace\n\nThat meeting that happened once\nThat was some meeting indeed\n\nI had just thought\nPerhaps there is something more\n\nAsk Faraz in whose memory\nHe spent his days",
    "notes": "A ghazal about a day lost entirely to memory, and the question of whose memory consumed Faraz's days."
  },
  {
    "TEXT_ID": "fraz_0045",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل تو بہل گیا مگر",
    "TITLE_EN": "Dil To Behal Gaya Magar",
    "CONTENT": "دل تو بہل گیا مگر\nیاد نے پھر ستایا\n\nکیا کہیں کہ اس کی یاد\nکس طرح آتی ہے\n\nاب تو عادت سی ہے\nغم میں مسکرانے کی\n\nہر چند زندگی ہے کچھ ایسی\nکہ جینا بھی کوئی جینا نہیں\n\nفرازؔ کا دل ہے کہ اب بھی\nاسی راہ تکا کرتا ہے",
    "TRANSLATION_EN": "The heart was distracted, but\nMemory tormented again\n\nWhat can I say, how\nHer memory comes\n\nNow it's become a habit\nTo smile in grief\n\nAlthough life is such\nThat living is not really living\n\nFaraz's heart is such that even now\nIt keeps staring at that same path",
    "notes": "A ghazal about the persistence of memory and the habit of smiling through grief."
  },
  {
    "TEXT_ID": "fraz_0047",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "رات بھر دیکھتے رہے ان کو",
    "TITLE_EN": "Raat Bhar Dekhte Rahe Un Ko",
    "CONTENT": "رات بھر دیکھتے رہے ان کو\nصبح ہونے کی خبر نہ ہوئی\n\nدل کی دنیا میں اک چاند اترا\nرات بھر جگمگاتا رہا\n\nفرازؔ اب اس کے بعد کیا کیجیے\nدل لگا کر بھی دل نہیں لگا",
    "TRANSLATION_EN": "I kept watching them all night\nI didn't know when morning came\n\nIn the heart's world, a moon descended\nIt kept shining all night\n\nFaraz, after this what should I do?\nEven after loving, the heart is not attached",
    "notes": "A ghazal about watching the beloved all night, oblivious to time passing."
  },
  {
    "TEXT_ID": "fraz_0048",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تم آئے تو آنکھوں میں بہار آ گئی",
    "TITLE_EN": "Tum Aaye To Aankhon Mein Bahaar Aa Gayi",
    "CONTENT": "تم آئے تو آنکھوں میں بہار آ گئی\nتم گئے تو دل میں خزاں چھا گئی\n\nوعدہ کیا تھا کبھی ملنے کا\nوہ بات ابھی تک یاد ہے\n\nفرازؔ اب اس کے بعد کون آئے گا\nدل کی دنیا سنسان ہے",
    "TRANSLATION_EN": "When you came, spring came to my eyes\nWhen you left, autumn descended on my heart\n\nThere was a promise of meeting someday\nThose words still remembered today\n\nFaraz, after this who will come?\nThe world of the heart is desolate",
    "notes": "A ghazal about the impact of the beloved's presence and absence."
  },
  {
    "TEXT_ID": "fraz_0049",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم نے مانا کہ تم سے کچھ نہ ملا",
    "TITLE_EN": "Hum Ne Mana Ke Tum Se Kuchh Na Mila",
    "CONTENT": "ہم نے مانا کہ تم سے کچھ نہ ملا\nپر یہ آرزو بھی کچھ کم نہ تھی\n\nدل کے جلنے کا بھی مزا ہے کوئی\nجب کسی کی یاد میں جلنے لگیں\n\nفرازؔ اس شہر میں کس سے ملیں\nہر چہرہ پہ اجنبیت چھائی ہے",
    "TRANSLATION_EN": "I admit that nothing came from you\nBut this desire itself was not small\n\nThere is some pleasure in the heart's burning\nWhen it starts burning in someone's memory\n\nFaraz, whom should I meet in this city?\nEvery face is covered with strangeness",
    "notes": "A ghazal about the pleasure found in desire itself, even when unfulfilled."
  },
  {
    "TEXT_ID": "fraz_0050",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کتنی ناداں تھی محبت ہماری",
    "TITLE_EN": "Kitni Nadan Thi Mohabbat Hamari",
    "CONTENT": "کتنی ناداں تھی محبت ہماری\nسمجھے تھے ہم کہ چمن کو بہار آئی ہے\n\nجانے کب سے کھڑے ہیں ہم اس راہ\nکوئی تو آئے کہ صبح ہو جائے\n\nفرازؔ اب کون سمجھائے اسے\nدل تو بچپن کا ہے وہ بھی نادان ہے",
    "TRANSLATION_EN": "How naive our love was\nWe thought spring had come to the garden\n\nI don't know since when I've stood on this path\nSomeone come, let morning arrive\n\nFaraz, who will now explain to her?\nMy heart is childlike, and she too is naive",
    "notes": "A ghazal reflecting on the innocence of first love and the endless waiting for the beloved."
  },
  {
    "TEXT_ID": "fraz_0051",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "آنکھ سے دور نہ ہو دل سے اتر جائے گا",
    "TITLE_EN": "Aankh Se Door Na Ho Dil Se Utar Jayega",
    "CONTENT": "آنکھ سے دور نہ ہو دل سے اتر جائے گا\nوقت کا کیا ہے گزرتا ہے گزر جائے گا\n\nاتنا مانوس نہ ہو خلوت غم سے اپنی\nتو کبھی خود کو بھی دیکھے گا تو ڈر جائے گا\n\nتم سر راہ وفا دیکھتے رہ جاؤ گے\nاور وہ بام رفعت سے اتر جائے گا\n\nزندگی تیری عطا ہے تو یہ جاں والے\nتیری بخشش تیری دہلیز پہ دھر جائے گا\n\nڈوبتے ڈوبتے کشتی تو اچھالا دے دوں\nمیں نہیں کوئی تو ساحل پہ اتر جائے گا\n\nصبر لازم ہے مگر دکھ ہے قیامت کا فراز\nظالم اب کے بھی نہ روئے گا تو مر جائے گا",
    "TRANSLATION_EN": "Don't go far from sight, or you'll descend from the heart\nWhat is time? It passes, it will pass\n\nDon't become too familiar with the solitude of grief\nIf you ever see yourself, you'll be frightened\n\nYou'll keep watching on the path of loyalty\nAnd she will descend from the heights\n\nLife is your gift, O this soul\nWill place your offering at your threshold\n\nLet me give a push to the sinking boat\nIf not me, someone else will reach the shore\n\nPatience is necessary, but the sorrow is immense, Faraz\nIf she doesn't cry even this time, she will die",
    "notes": "A profound ghazal about distance, time, and the inevitability of separation."
  },
  {
    "TEXT_ID": "fraz_0052",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس شخص سے بس اتنا سا تعلق ہے فراز",
    "TITLE_EN": "Us Shakhs Se Bas Itna Sa Talluq Hai Faraz",
    "CONTENT": "اس شخص سے بس اتنا سا تعلق ہے فراز\nوہ پریشان ہو تو ہمیں نیند نہیں آتی",
    "TRANSLATION_EN": "My connection with that person is only this much, Faraz\nIf she is troubled, I cannot sleep",
    "notes": "A beautiful couplet about the deep connection where the beloved's distress affects the lover's peace."
  },
  {
    "TEXT_ID": "fraz_0053",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "برباد کرنے کے اور بھی راستے تھے فراز",
    "TITLE_EN": "Barbaad Karne Ke Aur Bhi Raaste The Faraz",
    "CONTENT": "برباد کرنے کے اور بھی راستے تھے فراز\nنہ جانے انہیں محبت کا ہی خیال کیوں آیا",
    "TRANSLATION_EN": "There were other ways to destroy me, Faraz\nI don't know why they thought of love",
    "notes": "A poignant couplet about the irony of choosing love as a means of destruction."
  },
  {
    "TEXT_ID": "fraz_0054",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تو بھی تو آئینے کی طرح بے وفا نکلا فراز",
    "TITLE_EN": "Tu Bhi To Aaine Ki Tarah Bewafa Nikla Faraz",
    "CONTENT": "تو بھی تو آئینے کی طرح بے وفا نکلا فراز\nجو سامنے آیا اسی کا ہو گیا",
    "TRANSLATION_EN": "You too turned out unfaithful like a mirror, Faraz\nWhoever came before you, you became theirs",
    "notes": "A powerful couplet comparing the beloved's unfaithfulness to a mirror that reflects whoever stands before it."
  },
  {
    "TEXT_ID": "fraz_0055",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "بچ نہ سکا خدا بھی محبت کے تقاضوں سے فراز",
    "TITLE_EN": "Bach Na Saka Khuda Bhi Mohabbat Ke Taqazon Se Faraz",
    "CONTENT": "بچ نہ سکا خدا بھی محبت کے تقاضوں سے فراز\nایک محبوب کی خاطر سارا جہاں بنا ڈالا",
    "TRANSLATION_EN": "Even God couldn't escape the demands of love, Faraz\nFor one beloved, He created the entire world",
    "notes": "A profound couplet about the power of love that even God couldn't resist."
  },
  {
    "TEXT_ID": "fraz_0056",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "میں نے آزاد کیا اپنی وفاؤں سے تجھے",
    "TITLE_EN": "Maine Aazad Kiya Apni Wafaon Se Tujhe",
    "CONTENT": "میں نے آزاد کیا اپنی وفاؤں سے تجھے\nبے وفائی کی سزا مجھ کو سنا دی جائے",
    "TRANSLATION_EN": "I freed you from my loyalties\nAnd I am punished for unfaithfulness",
    "notes": "A couplet about the paradox where freeing the beloved leads to one's own punishment."
  },
  {
    "TEXT_ID": "fraz_0057",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "میں نے مانگی تھی اجالے کی فقط اک کرن فراز",
    "TITLE_EN": "Maine Maangi Thi Ujale Ki Fakat Ik Kiran Faraz",
    "CONTENT": "میں نے مانگی تھی اجالے کی فقط اک کرن فراز\nتم سے یہ کس نے کہا آگ لگا دی جائے",
    "TRANSLATION_EN": "I had asked for just a ray of light, Faraz\nWho told you to set it on fire?",
    "notes": "A poignant couplet about asking for too little but receiving destruction instead."
  },
  {
    "TEXT_ID": "fraz_0058",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اتنی سی بات پہ دل کی دھڑکن رک گئی فراز",
    "TITLE_EN": "Itni Si Baat Pe Dil Ki Dhadkan Ruk Gayi Faraz",
    "CONTENT": "اتنی سی بات پہ دل کی دھڑکن رک گئی فراز\nایک پل جو تصور کیا تیرے بنا جینے کا",
    "TRANSLATION_EN": "On such a small matter, my heart's beat stopped, Faraz\nJust one moment I imagined living without you",
    "notes": "A powerful couplet about the impossibility of imagining life without the beloved."
  },
  {
    "TEXT_ID": "fraz_0059",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس طرح غور سے مت دیکھ میرا ہاتھ اے فراز",
    "TITLE_EN": "Is Tarah Gaur Se Mat Dekh Mera Haath Ae Faraz",
    "CONTENT": "اس طرح غور سے مت دیکھ میرا ہاتھ اے فراز\nان لکیروں میں حسرتوں کے سوا کچھ بھی نہیں",
    "TRANSLATION_EN": "Don't look at my hand so intently, O Faraz\nIn these lines, there's nothing but desires",
    "notes": "A reflective couplet about palmistry and the lines of destiny filled only with unfulfilled desires."
  },
  {
    "TEXT_ID": "fraz_0060",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس نے مجھے چھوڑ دیا تو کیا ہوا فراز",
    "TITLE_EN": "Us Ne Mujhe Chhod Diya To Kya Hua Faraz",
    "CONTENT": "اس نے مجھے چھوڑ دیا تو کیا ہوا فراز\nمیں نے بھی تو چھوڑا تھا سارا زمانہ اس کے لیے",
    "TRANSLATION_EN": "So what if she left me, Faraz?\nI too had left the entire world for her",
    "notes": "A couplet about mutual sacrifice and the balance of loss in love."
  },
  {
    "TEXT_ID": "fraz_0061",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "محبت ملے تو نیند بھی اپنی نہ رہی فراز",
    "TITLE_EN": "Mohabbat Mili Toh Neend Bhi Apni Na Rahi Faraz",
    "CONTENT": "محبت ملے تو نیند بھی اپنی نہ رہی فراز\nگمنام زندگی تھی تو کتنا سکون تھا",
    "TRANSLATION_EN": "When love came, even my sleep was lost, Faraz\nWhen life was unknown, how much peace there was",
    "notes": "A reflective ghazal about how love brings disturbance to a peaceful but anonymous life."
  },
  {
    "TEXT_ID": "fraz_0062",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب تیرے ذکر پہ ہم بات بدل دیتے ہیں",
    "TITLE_EN": "Ab Tere Zikr Pe Hum Baat Badal Dete Hain",
    "CONTENT": "اب تیرے ذکر پہ ہم بات بدل دیتے ہیں\nکتنی رغبت تھی تیرے نام سے پہلے پہلے",
    "TRANSLATION_EN": "Now at your mention, I change the subject\nHow much eagerness there was for your name initially",
    "notes": "A ghazal about the gradual fading of passion and the avoidance of painful memories."
  },
  {
    "TEXT_ID": "fraz_0063",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہوئی ہے شام تو آنکھوں میں بس گیا پھر تو",
    "TITLE_EN": "Hui Hai Shaam To Aankhon Mein Bas Gaya Phir Tu",
    "CONTENT": "ہوئی ہے شام تو آنکھوں میں بس گیا پھر تو\nکہاں گیا ہے میرے شہر کے مسافر تو",
    "TRANSLATION_EN": "Evening has fallen, and you've settled in my eyes again\nWhere have you gone, O traveler of my city?",
    "notes": "A beautiful ghazal about how evening brings memories of the beloved who is like a traveler passing through."
  },
  {
    "TEXT_ID": "fraz_0064",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم تو محبت میں بھی توحید کے قائل ہیں فراز",
    "TITLE_EN": "Hum Toh Mohabbat Mein Bhi Tauheed Ke Qail Hain Faraz",
    "CONTENT": "ہم تو محبت میں بھی توحید کے قائل ہیں فراز\nایک ہی شخص کو محبوب بنائے رکھا ہے",
    "TRANSLATION_EN": "In love too, I believe in monotheism, Faraz\nI have kept only one person as beloved",
    "notes": "A profound ghazal about the concept of unity (tauheed) applied to love - loving only one."
  },
  {
    "TEXT_ID": "fraz_0065",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تو اپنی شیشہ گری کا ہنر نہ کر ضائع",
    "TITLE_EN": "Tu Apni Sheesha Gari Ka Hunar Na Kar Zaya",
    "CONTENT": "تو اپنی شیشہ گری کا ہنر نہ کر ضائع\nمیں آئینہ ہوں مجھے توڑنے کی عادت ہے",
    "TRANSLATION_EN": "Don't waste your art of glass-making\nI am a mirror, I have a habit of breaking",
    "notes": "A powerful couplet about the fragility of the lover who is like a mirror, destined to break."
  },
  {
    "TEXT_ID": "fraz_0066",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یہ محبت بھی ہے کیا روگ فراز",
    "TITLE_EN": "Ye Mohabbat Bhi Hai Kya Rog Faraz",
    "CONTENT": "یہ محبت بھی ہے کیا روگ فراز\nجس کو بھولیں وہ سدا یاد آئے",
    "TRANSLATION_EN": "What kind of illness is this love, Faraz?\nWhom we try to forget, always comes to mind",
    "notes": "A famous couplet about the paradoxical nature of love where the one you try to forget keeps coming to mind."
  },
  {
    "TEXT_ID": "fraz_0067",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "غم دنیا بھی غم یار میں شامل کرلو",
    "TITLE_EN": "Gham-e-Duniya Bhi Gham-e-Yaar Mein Shamil Kar Lo",
    "CONTENT": "غم دنیا بھی غم یار میں شامل کرلو\nنشہ بڑھتا ہے شرابیں جو شرابوں میں ملیں",
    "TRANSLATION_EN": "Include the sorrows of the world in the sorrow of the beloved\nThe intoxication increases when wines are mixed with wines",
    "notes": "A philosophical ghazal about combining all sorrows with the beloved's sorrow for greater intensity."
  },
  {
    "TEXT_ID": "fraz_0068",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ایسی تاریکیاں آنکھوں میں بسی ہے کہ فراز",
    "TITLE_EN": "Aisi Tareekiyan Aankhon Mein Basi Hai Ke Faraz",
    "CONTENT": "ایسی تاریکیاں آنکھوں میں بسی ہے کہ فراز\nرات تو رات ہے ہم دن کو جلاتے ہیں چراغ",
    "TRANSLATION_EN": "Such darkness has settled in my eyes, Faraz\nNight is night, but I light lamps even during the day",
    "notes": "A powerful couplet about internal darkness so deep that even day seems like night."
  },
  {
    "TEXT_ID": "fraz_0069",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس کی وہ جانے اسے پاس وفا تھا کہ نہ تھا",
    "TITLE_EN": "Uski Woh Jane Use Paas-e-Wafa Tha Ke Na Tha",
    "CONTENT": "اس کی وہ جانے اسے پاس وفا تھا کہ نہ تھا\nتم فراز اپنی طرف سے تو نبھاتے جاتے",
    "TRANSLATION_EN": "She knows whether she had regard for loyalty or not\nYou, Faraz, at least from your side, kept fulfilling it",
    "notes": "A couplet about fulfilling one's own duty of loyalty regardless of the beloved's response."
  },
  {
    "TEXT_ID": "fraz_0070",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل کو تیری چاہت پہ بھروسہ بھی بہت ہے",
    "TITLE_EN": "Dil Ko Teri Chahat Pe Bharosa Bhi Bahut Hai",
    "CONTENT": "دل کو تیری چاہت پہ بھروسہ بھی بہت ہے\nاور تجھ سے بچھڑ جانے کا ڈر بھی نہیں جاتا",
    "TRANSLATION_EN": "The heart has great faith in your love\nAnd yet the fear of separation doesn't leave",
    "notes": "A ghazal about the paradox of having faith in love while still fearing separation."
  },
  {
    "TEXT_ID": "fraz_0071",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اور فراز چاہیے کتنی محبتیں تجھ کو",
    "TITLE_EN": "Aur Faraz Chahiye Kitni Mohabbaten Tujh Ko",
    "CONTENT": "اور فراز چاہیے کتنی محبتیں تجھ کو\nماں نے تیرے نام پہ بچوں کے نام رکھ دیے",
    "TRANSLATION_EN": "How much more love do you need, Faraz?\nMothers have named their children after you",
    "notes": "A beautiful tribute to Faraz's popularity, showing how his name became a household word."
  },
  {
    "TEXT_ID": "fraz_0072",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "تیرے ہوتے ہوئے آ جاتی تھی ساری دنیا",
    "TITLE_EN": "Tere Hote Huye Aa Jati Thi Sari Duniya",
    "CONTENT": "تیرے ہوتے ہوئے آ جاتی تھی ساری دنیا\nآج تنہا ہوں تو کوئی نہیں آنے والا",
    "TRANSLATION_EN": "When you were here, the whole world would come\nToday I'm alone, no one comes",
    "notes": "A poignant ghazal about how the beloved's presence brought the whole world, and their absence leaves emptiness."
  },
  {
    "TEXT_ID": "fraz_0073",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ڈھونڈتا پھرتا ہوں لوگوں میں شباحت اس کی",
    "TITLE_EN": "Dhoondta Phirta Hoon Logon Mein Shabahat Uski",
    "CONTENT": "ڈھونڈتا پھرتا ہوں لوگوں میں شباحت اس کی\nکہ وہ خوابوں میں بھی لگتی ہے خیالوں جیسی",
    "TRANSLATION_EN": "I keep searching for her resemblance among people\nFor even in dreams, she seems like an imagination",
    "notes": "A ghazal about searching for the beloved's likeness everywhere because even in dreams she seems unreal."
  },
  {
    "TEXT_ID": "fraz_0074",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب اس دنیا میں کوئی اور مجھے دل نہیں دینے والا فراز",
    "TITLE_EN": "Ab Is Duniya Mein Koi Aur Mujhe Dil Nahi Dene Wala Faraz",
    "CONTENT": "اب اس دنیا میں کوئی اور مجھے دل نہیں دینے والا فراز\nلوگ کہتے ہیں میری آنکھوں میں اس کا چہرہ نظر آتا ہے",
    "TRANSLATION_EN": "Now no one else in this world will give me heart, Faraz\nPeople say her face appears in my eyes",
    "notes": "A ghazal about how the beloved's image is permanently etched in the lover's eyes."
  },
  {
    "TEXT_ID": "fraz_0075",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کوئی بتلائے کہ اک عمر کا بچھڑا محبوب",
    "TITLE_EN": "Koi Batlaye Ke Ik Umar Ka Bichhra Mehboob",
    "CONTENT": "کوئی بتلائے کہ اک عمر کا بچھڑا محبوب\nاتفاقاً کہیں مل جائے تو کیا کہتے ہیں",
    "TRANSLATION_EN": "Someone tell me, if after a lifetime of separation\nWe accidentally meet the beloved somewhere, what do we say?",
    "notes": "A beautiful ghazal about the dilemma of what to say when meeting a long-lost beloved."
  },
  {
    "TEXT_ID": "fraz_0076",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "عشق کے نشے میں ڈوبے تو یہ جانا ہم نے فراز",
    "TITLE_EN": "Ishq Ke Nashay Mein Doobe To Ye Jana Hum Ne Faraz",
    "CONTENT": "عشق کے نشے میں ڈوبے تو یہ جانا ہم نے فراز\nکہ درد میں تنہائی نہیں ہوتی، تنہائی میں درد ہوتا ہے",
    "TRANSLATION_EN": "When drowned in the intoxication of love, I realized, Faraz\nThat in pain there is no loneliness, but in loneliness there is pain",
    "notes": "A profound philosophical couplet distinguishing between pain and loneliness."
  },
  {
    "TEXT_ID": "fraz_0077",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہلال عید کو دیکھو تو روک لو آنسو",
    "TITLE_EN": "Hilal-e-Eid Ko Dekho To Rok Lo Aansu",
    "CONTENT": "ہلال عید کو دیکھو تو روک لو آنسو\nجو ہو سکے تو محبت کا احترام کرو",
    "TRANSLATION_EN": "When you see the Eid crescent, hold back your tears\nIf possible, show respect to love",
    "notes": "A ghazal about controlling emotions on Eid and honoring the sanctity of love."
  },
  {
    "TEXT_ID": "fraz_0078",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ٹوٹا تو ہوں مگر ابھی بکھرا نہیں فراز",
    "TITLE_EN": "Tuta Toh Hoon Magar Abhi Bikhra Nahi Faraz",
    "CONTENT": "ٹوٹا تو ہوں مگر ابھی بکھرا نہیں فراز\nوقت ظالم ہے ہر ایک موڑ پہ ٹھکرائے گا",
    "TRANSLATION_EN": "I am broken, but not yet scattered, Faraz\nTime is cruel, it will reject at every turn",
    "notes": "A powerful ghazal about resilience despite being broken, and the cruelty of time."
  },
  {
    "TEXT_ID": "fraz_0079",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "میں آنے والے زمانوں سے ڈر رہا ہوں فراز",
    "TITLE_EN": "Main Aane Walay Zamanon Se Dar Raha Hoon Faraz",
    "CONTENT": "میں آنے والے زمانوں سے ڈر رہا ہوں فراز\nکہ میں نے دیکھی ہیں آنکھیں اداس لوگوں کی",
    "TRANSLATION_EN": "I am afraid of the coming times, Faraz\nFor I have seen the eyes of sad people",
    "notes": "A prophetic ghazal about fearing the future based on the sadness seen in people's eyes."
  },
  {
    "TEXT_ID": "fraz_0080",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "مثال دست زلیخا تپاک چاہتا ہے",
    "TITLE_EN": "Misal-e-Dast-e-Zulekha Tapak Chahta Hai",
    "CONTENT": "مثال دست زلیخا تپاک چاہتا ہے\nیہ دل بھی دامن یوسف ہے چاک چاہتا ہے\n\nدعائیں دو مرے قاتل کو تم کہ شہر کا شہر\nاسی کے ہاتھ سے ہونا ہلاک چاہتا ہے\n\nفسانہ گو بھی کرے کیا کہ ہر کوئی سر بزم\nمعال قصہ دل دردناک چاہتا ہے\n\nادھر ادھر سے کئی آ رہی ہیں آوازیں\nاور اس کا دھیان بہت انہماک چاہتا ہے\n\nذرا سی گرد ہوس دل پہ لازمی ہے فراز\nوہ عشق کیا ہے جو دامن کو پاک چاہتا ہے",
    "TRANSLATION_EN": "Like the burning of Zulekha's hand, this heart too\nWants to tear the shirt of Joseph\n\nPray for my murderer, for the entire city\nWants to be killed by her hand\n\nWhat can the storyteller do? Everyone in the gathering\nWants the painful tale of the heart\n\nVoices are coming from here and there\nBut her attention requires deep concentration\n\nA little dust of desire on the heart is necessary, Faraz\nWhat love is that which wants the hem pure?",
    "notes": "A complete ghazal with rich classical imagery referencing the story of Yusuf and Zulekha.",
    "citation": "Rekhta.org - Kulliyat-e-Ahmad Faraz [citation:9]"
  },
  {
    "TEXT_ID": "fraz_0081",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اس سے پہلے کہ بے وفا ہو جائیں",
    "TITLE_EN": "Is Se Pehle Ke Bewafa Ho Jayen",
    "CONTENT": "اس سے پہلے کہ بے وفا ہو جائیں\nیوں ہی بہتر ہے کہ جدا ہو جائیں\n\nشہر میں بے اعتباری ہے فراز\nلوگ کہتے ہیں کہ وفا ہو جائیں",
    "TRANSLATION_EN": "Before we become unfaithful\nIt's better that we separate\n\nThere is distrust in the city, Faraz\nPeople say we should become loyal",
    "notes": "A beautiful ghazal about choosing separation before unfaithfulness, and the irony of being advised to be loyal in a distrustful city.",
    "citation": "UrduAdab4U Blogspot [citation:10]"
  },
  {
    "TEXT_ID": "fraz_0086",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "وہ جو آتے تھے کبھی ملنے کو",
    "TITLE_EN": "Wo Jo Aate Thay Kabhi Milne Ko",
    "CONTENT": "وہ جو آتے تھے کبھی ملنے کو\nاب وہ ملنے کا بھی نہیں کہتے\n\nدل کی دنیا میں اک چاند اترا\nرات بھر جگمگاتا رہا\n\nفرازؔ اب اس کے بعد کیا ہوگا\nدل کو تو اب کسی کی یاد نہیں",
    "TRANSLATION_EN": "Those who used to come to meet\nNow they don't even mention meeting\n\nIn the heart's world, a moon descended\nIt kept shining all night\n\nFaraz, after this what will happen?\nThe heart now remembers no one",
    "notes": "A ghazal about those who once came but now don't even mention meeting."
  },
  {
    "TEXT_ID": "fraz_0087",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم نے چاہا تو بہت پر نہ ملا",
    "TITLE_EN": "Hum Ne Chaha To Bahut Par Na Mila",
    "CONTENT": "ہم نے چاہا تو بہت پر نہ ملا\nشاید قسمت میں ہی نہ تھا ملنا\n\nاب اسے بھولنے کا غم ہے\nوہ بھی کوئی بھولنا ہے\n\nدل کے جلنے کا بھی مزا ہے کوئی\nجب کسی کی یاد میں جلنے لگیں\n\nفرازؔ اب اس کے بعد کیا کیجیے\nدل لگا کر بھی دل نہیں لگتا",
    "TRANSLATION_EN": "I wished so much but didn't find her\nPerhaps meeting was not in my fate\n\nNow there's grief of forgetting her\nAnd that too is some kind of forgetting\n\nThere is some pleasure in the heart's burning\nWhen it starts burning in someone's memory\n\nFaraz, after this what should I do?\nEven after loving, the heart is not attached",
    "notes": "A ghazal about the grief of forgetting and the paradoxical pleasure found in the heart's burning."
  },
  {
    "TEXT_ID": "fraz_0088",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "یوں نہیں کہ اس کا غم کم ہو گیا",
    "TITLE_EN": "Yun Nahin Ke Uss Ka Gham Kam Ho Gaya",
    "CONTENT": "یوں نہیں کہ اس کا غم کم ہو گیا\nدل کو اب اس کی عادت سی ہو گئی\n\nوہ جو ملتے تھے کبھی راہوں میں\nاب وہ راہیں بھی اجڑ گئی ہیں\n\nکیا ملا ہے اسے فرازؔ کی یاد میں\nوہ تو اب بھی بے خبر ہے اس سے\n\nاب اسے بھولنے کا غم ہے\nوہ بھی کوئی بھولنا ہے",
    "TRANSLATION_EN": "It's not that her grief has diminished\nThe heart has just grown accustomed to it\n\nThose paths where we used to meet\nNow those paths too are desolate\n\nWhat has she gained from Faraz's memory?\nShe is still unaware of it\n\nNow there's grief of forgetting her\nAnd that too is some kind of forgetting",
    "notes": "A ghazal about how grief becomes habitual, and the desolation of paths once walked together."
  },
  {
    "TEXT_ID": "fraz_0089",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "اب تو گزرے دن بھی یاد نہیں",
    "TITLE_EN": "Ab To Guzray Din Bhi Yaad Nahin",
    "CONTENT": "اب تو گزرے دن بھی یاد نہیں\nاب تو آنے والے کل بھی یاد نہیں\n\nتم بھی کبھی تو یاد آؤ گے\nہم بھی کبھی تو بھول جائیں گے\n\nدل کی بات کسی سے کہی نہیں جاتی\nہم خاموش ہیں تو خاموشی بھی بھاری ہے\n\nفرازؔ اب اس کے بعد کیا کہیے\nدل نے چاہا مگر بات نہ بنی",
    "TRANSLATION_EN": "Now even the days that have passed are not remembered\nNow even the tomorrows to come are not remembered\n\nSomeday you too will come to mind\nSomeday I too will forget\n\nThe heart's words can't be told to anyone\nI'm silent, and the silence too is heavy\n\nFaraz, after this what can I say?\nThe heart wished, but matters didn't work out",
    "notes": "A ghazal about the erasure of both past and future from memory, leaving only a heavy silence."
  },
  {
    "TEXT_ID": "fraz_0090",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "کچھ نہیں تو یہ دل ہے",
    "TITLE_EN": "Kuchh Nahin To Ye Dil Hai",
    "CONTENT": "کچھ نہیں تو یہ دل ہے\nاس کو سنبھالے رکھیے\n\nآج تک یاد ہے وہ لمحہ\nجب اس نے آنکھوں سے آنکھیں ملا کر کہا تھا\n\nہم نے سمجھا تھا کہ سب بھول گئے\nآج معلوم ہوا کچھ نہیں بھولے\n\nاب اس کے بعد بھی دل لگتا ہے\nکچھ تو ہے جس کا نام لیتے ہیں\n\nفرازؔ سے پوچھو کہ اس نے کیا پایا\nاس نے تو سب کچھ اس پہ لٹا دیا",
    "TRANSLATION_EN": "If nothing else, there is this heart\nWe should keep it safe\n\nI remember that moment till today\nWhen she met my eyes and said\n\nI thought everyone had forgotten\nToday I learned no one has forgotten\n\nEven after this, the heart is attached\nThere is something whose name we take\n\nAsk Faraz what he gained\nHe sacrificed everything for her",
    "notes": "A ghazal about the preciousness of the heart, the persistence of memory, and total sacrifice for the beloved."
  },
  {
    "TEXT_ID": "fraz_0091",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "دل کو سمجھایا بہت پر وہ",
    "TITLE_EN": "Dil Ko Samjhaya Bahut Par Woh",
    "CONTENT": "دل کو سمجھایا بہت پر وہ\nاپنی ہی دھن میں لگا رہا\n\nوہ جو اک بار ہنس کے ملے تھے\nاب وہ ملنا کہاں\n\nکیا بتائیں کہ اس کی یاد نے\nکس طرح راتوں کو جگایا\n\nاب بھی جب چاند نکلا کرتا ہے\nدل اس کی گلی کو جاتا ہے\n\nفرازؔ کا کام ہے دل لگانا\nاب کسی سے لگائے کہ نہ لگائے",
    "TRANSLATION_EN": "I tried hard to convince the heart, but it\nRemained absorbed in its own obsession\n\nThose who once met with a smile\nWhere is that meeting now?\n\nHow can I tell how her memory\nKept me awake at night?\n\nEven now when the moon rises\nThe heart goes to her lane\n\nFaraz's work is to love\nNow whether to love someone or not",
    "notes": "A ghazal about the heart's obsession and the beautiful imagery of the heart going to the beloved's lane when the moon rises."
  },
  {
    "TEXT_ID": "fraz_0092",
    "AUTHOR_ID": "fraz",
    "TITLE_UR": "ہم نے سمجھا تھا کہ اب چین ملے گا",
    "TITLE_EN": "Hum Ne Samjha Tha Ke Ab Chain Mile Ga",
    "CONTENT": "ہم نے سمجھا تھا کہ اب چین ملے گا\nچین تو اور بھی دور نکل گیا\n\nاس کی یاد میں جو گزری ہے\nوہ کسی سے کیا کہیے\n\nآج پھر وہ آئے تھے خواب میں\nدل نے چاہا کہ جاگ نہ جائیں\n\nاب کے اس نے اتنا ستایا\nکہ دل نے دل سے کیا نہ کیا\n\nفرازؔ کی زندگی تو کٹ ہی گئی\nاب تم بتاؤ کہ اس نے کیا پایا",
    "TRANSLATION_EN": "I thought now I would find peace\nPeace only went further away\n\nWhatever passed in her memory\nHow can I tell anyone?\n\nToday she came again in a dream\nThe heart wished not to wake\n\nThis time she tormented so much\nThat the heart did everything to itself\n\nFaraz's life has passed anyway\nNow you tell me, what did he gain?",
    "notes": "A ghazal about peace receding further when sought, and the torment of dreams where the heart turns against itself."
  }
]