[
  {
    "TEXT_ID": "ghalib_00001",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "نہ تھا کچھ تو خدا تھا، کچھ نہ ہوتا تو خدا ہوتا",
    "TITLE_EN": "When nothing existed, then God existed; if nothing had existed, then God would have existed.",
    "CONTENT": "نہ تھا کچھ تو خدا تھا، کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے، نہ ہوتا میں تو کیا ہوتا\n\nہوئی جب غم سے یوں نسبت تو غم ہی رہے گا باقی\nنہ ہوتا غم کا کیا ہوتا، نہ ہوتا غم تو کیا ہوتا\n\nہوا کا ہے بھروسہ کس قفس کا ہے ٹھکانا کیا\nنہ ہوتا خارِ زنجیرِ گریباں تو کیا ہوتا\n\nاسی کو کر نہیں پاتا کہ واں تک جا ہی پہنچے، ہائے\nنہ ہوتا راہ میں نَقشِ قدم گُم تو کیا ہوتا\n\nکبھی مسنون نہ کرتا کوئی تعمیر اپنے دل کی\nنہ ہوتا اس قدر نازک دلِ نازک ادا کا کیا\n\nسمجھتے ہیں کہ مرحلہ پہنچے تو دم نکل جائے\nنہ ہوتا جی کو اپنے اس قدر رنج ستم تو کیا ہوتا\n\nاُسے کون دیکھ سکتا کہ یہ عالم ہے پردے کا\nنہ ہوتا پردہ اُس کا پردۂ دیدِ بَصر تو کیا\n\nوہ ہم سے کچھ نہ بولے، ہم نے کچھ نہ کہا، کچھ نہ سنا\nنہ ہوتا دل کو ہماری یہ تمنا تو کیا ہوتا",
    "TRANSLATION_EN": "When nothing existed, then God existed; if nothing had existed, then God would have existed.\nMy existence has drowned me; if I had not existed, then what would have been?\n\nWhen I became so connected to sorrow, then sorrow alone will remain.\nIf sorrow had not existed, what would have been? If sorrow had not existed, then what would have been?\n\nThe wind is unreliable, what is the abode of this cage?\nIf the thorn of the collar-chain had not existed, then what would have been?\n\nI can't even manage to reach that place; alas!\nIf the footprints on the path had not been lost, then what would have been?\n\nNo one would ever have built the construction of his heart.\nIf this delicate heart of a delicate-mannered one had not been so delicate, then what?\n\nThey think that when they reach the stage, their life will expire.\nIf the soul were not so afflicted by tyranny, then what would have been?\n\nWho can see Him, for this world is one of veils?\nIf His veil were not the veil of the sight of the eye, then what?\n\nHe didn't say anything to us, we said nothing, heard nothing.\nIf our hearts had not had this longing, then what would have been?"
  },
  {
    "TEXT_ID": "ghalib_00002",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "یہ نہ تھی ہماری قسمت کہ وصالِ یار ہوتا",
    "TITLE_EN": "It was not my destiny that I should attain union with the beloved.",
    "CONTENT": "یہ نہ تھی ہماری قسمت کہ وصالِ یار ہوتا\nاگر اور جیتے رہتے تو یہی انتظار ہوتا\n\nتم سے کچھ نہیں ہے الفت، مگر اتنا ضرور ہے\nکہ جو بات ہماری سمجھے، وہی بات تمہارا\n\nدلِ ناتواں کو دھوکا ہے کہ یہ درد بھی نہ ہو\nیہ نہ تھی ہماری قسمت کہ وصالِ یار ہوتا\n\nغمِ عشق اگر نہ ہوتا، تو ہم کیوں جیتے\nغمِ عشق ہے کہ جیتے ہیں، نہیں تو ہم مر جاتے\n\nکوئی ایسی بات کیوں کہے، جو تمہیں نہ پسند ہو\nہمیں تو تم سے محبت ہے، بس اتنا ہی کافی ہے",
    "TRANSLATION_EN": "It was not my destiny that I should attain union with the beloved.\nIf I had lived longer, it would have only been more of this waiting.\n\nThere is no love from you to me, but this much is certain:\nThat whatever my condition, it is because of you.\n\nMy feeble heart is deluded that this pain might also cease.\nIt was not my destiny that I should attain union with the beloved.\n\nIf there were no sorrow of love, then why would we live?\nIt is the sorrow of love that keeps us alive; otherwise, we would have died.\n\nWhy should I say anything that you might not like?\nI just love you, and that is enough for me."
  },
  {
    "TEXT_ID": "ghalib_00003",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہم کو معلوم ہے جنت کی حقیقت لیکن",
    "TITLE_EN": "We know the reality of heaven, but",
    "CONTENT": "ہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nعشق نے غالبؔ نکما کر دیا\nورنہ ہم بھی آدمی تھے کام کے\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے تم کو خبر ہوتی تک\n\nدرد مارا کہ نہ آیا کوئی کام ان سے\nآئے تھے ہم بھی دعا کے لیے اس در پر",
    "TRANSLATION_EN": "We know the reality of heaven, but\nTo keep the heart happy, Ghalib, this thought is good.\n\nLove has ruined Ghalib,\nOtherwise, I too was a man of substance.\n\nI agree that you will not ignore me, but\nI will have turned to dust before you even come to know.\n\nSorrow has struck, that nothing was accomplished through them.\nI too had come to that threshold to pray."
  },
  {
    "TEXT_ID": "ghalib_00004",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دل ہی تو ہے نہ سنگ و خشت، درد سے بھر نہ آئے کیوں",
    "TITLE_EN": "It is, after all, a heart, not brick or stone; why should it not fill with pain?",
    "CONTENT": "دل ہی تو ہے نہ سنگ و خشت، درد سے بھر نہ آئے کیوں\nروئیں گے ہم ہزار بار، کوئی ہمیں ستائے کیوں\n\nظلمتِ شب کبھی تو صبح نے دی ہے خبر\nبجھ گئے شمع تو آئے گی صبح کیوں\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nایسے میں کیوں کسی سے شکوہ کرے کوئی\n\nہم نے مانا کہ کچھ نہیں غالبؔ\nمگر اس نے بھی تو ہمیں بھلایا کیوں",
    "TRANSLATION_EN": "It is, after all, a heart, not brick or stone; why should it not fill with pain?\nWhy should I not weep a thousand times, if someone torments me?\n\nSometimes the morning has given news of the night's darkness.\nWhen the candle is extinguished, why would the morning come?\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nThat which was in us, which was in you, that quality is no more.\nIn such a state, why should anyone complain to anyone?\n\nI agree, Ghalib, that I am nothing,\nBut then, why did He make me forget myself?"
  },
  {
    "TEXT_ID": "ghalib_00005",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے",
    "TITLE_EN": "Thousands of desires, each worth dying for;",
    "CONTENT": "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے\nبہت نکلے میرے ارمان لیکن پھر بھی کم نکلے\n\nکبھی وہ بھی مجھے یاد آتے ہیں، کہ جب ہم ملتے تھے\nبڑی مدتوں سے ہیں، بڑے قریب سے گزرے ہیں\n\nبسکہ دشوار ہے ہر کام کا آسان ہونا\nآدمی کو بھی میسر نہیں انساں ہونا\n\nدرد سے میرا دل ہے بےزار، مگر\nکیا کروں، اس کا بھی تو کوئی علاج نہیں\n\nدل ناداں تجھے ہوا کیا ہے\nآخر اس درد کی دوا کیا ہے\n\nہم نے مانا کہ غفلت میں تم نے ہمیں بھلایا\nہم تو یاد آئے ہیں، یاد نہ آتے تو کیا ہوتا",
    "TRANSLATION_EN": "Thousands of desires, each worth dying for;\nMany of my wishes were fulfilled, but even then, not enough.\n\nSometimes I remember him, the times we used to meet;\nIt's been many long ages, yet it feels like just yesterday.\n\nIt's so hard for every task to be easy,\nEven for a man, it's not possible to truly be human.\n\nMy heart is weary of pain, but\nWhat can I do? There is no cure for it either.\n\nOh foolish heart, what has happened to you?\nAfter all, what is the cure for this pain?\n\nI accept that in your negligence, you forgot me,\nBut I have come to mind; what if I hadn't come to mind?"
  },
  {
    "TEXT_ID": "ghalib_00006",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کوئی امید بر نہیں آتی",
    "TITLE_EN": "No hope is fulfilled,",
    "CONTENT": "کوئی امید بر نہیں آتی\nکوئی صورت نظر نہیں آتی\n\nموت کا ایک دن معین ہے\nنیند کیوں رات بھر نہیں آتی\n\nآگے آتی تھی حالِ دل پہ ہنسی\nاب کسی بات پر نہیں آتی\n\nہم وہاں ہیں جہاں سے ہم کو بھی\nکچھ ہماری خبر نہیں آتی\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی",
    "TRANSLATION_EN": "No hope is fulfilled,\nNo solution appears.\n\nThe day of death is fixed,\nThen why does sleep not come at night?\n\nEarlier, my condition would bring a smile,\nNow, nothing brings a smile.\n\nI am in a state where\nI have no news of myself even.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears."
  },
  {
    "TEXT_ID": "ghalib_00007",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "احسن کا تجھ کو حکم ہے، میں بدپرست ہوں",
    "TITLE_EN": "You command me to do good, but I am a heretic.",
    "CONTENT": "احسن کا تجھ کو حکم ہے، میں بدپرست ہوں\nمجھ کو ادائے غیر سے کیا کام، ہے خدا\n\nرہے نہ جاں تو قاتل کو خوں بہا دیجئے\nکٹے زبان تو خنجر کو مرحبا کہیے\n\nکیوں ہو خفا کہ قتل کیا اپنی آن سے\nبہتر ہے خود کشی، مگر اس کی سزا نہ جائے\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nقریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے",
    "TRANSLATION_EN": "You command me to do good, but I am a heretic.\nWhat have I to do with another's manner? It is God's affair.\n\nIf life remains, give blood-money to the murderer.\nIf the tongue is cut, say \"bravo\" to the dagger.\n\nWhy be angry that I committed suicide with my own life?\nSuicide is better, but its punishment should not be given.\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nThe message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then."
  },
  {
    "TEXT_ID": "ghalib_00008",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "آگے آتی تھی حالِ دل پہ ہنسی",
    "TITLE_EN": "My condition would bring a smile,",
    "CONTENT": "آگے آتی تھی حالِ دل پہ ہنسی\nاب کسی بات پر نہیں آتی\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nہم سے پوچھو تم ان کی خبر، تو وہ کچھ اور کہے\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی\n\nدل ہی تو ہے نہ سنگ و خشت، درد سے بھر نہ آئے کیوں\nروئیں گے ہم ہزار بار، کوئی ہمیں ستائے کیوں",
    "TRANSLATION_EN": "My condition would bring a smile,\nNow, nothing brings a smile.\n\nThat which was in us, which was in you, that quality is no more.\nIf we ask you of his news, he says something else.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears.\n\nIt is, after all, a heart, not brick or stone; why should it not fill with pain?\nWhy should I not weep a thousand times, if someone torments me?"
  },
  {
    "TEXT_ID": "ghalib_00009",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "جہاں تیرا نقشِ قدم دیکھتے ہیں",
    "TITLE_EN": "Wherever we see your footprint,",
    "CONTENT": "جہاں تیرا نقشِ قدم دیکھتے ہیں\nاسی کو ہم اپنا حرم دیکھتے ہیں\n\nیہ کعبہ ہم نے بنایا ہے، صنم خانہ نہیں\nہر بت کو توڑ کر ہم نے اس کو بنا دیا\n\nغمِ دنیا سے کیا غم، ہیں ہم مستِ شراب\nدیکھتے ہیں جو بھی منظر، تیرا ہی جام\n\nکس کی یاد آئی ہے، کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم دیکھتے ہیں\n\nبندۂ مس ہوں، میں غالبؔ ہوں، مگر\nاسیرِ قفس ہیں، مگر پرواز دیکھتے ہیں",
    "TRANSLATION_EN": "Wherever we see your footprint,\nThat very place we consider our sanctuary.\n\nWe have built this Kaaba; it is not an idol-house.\nWe made it by breaking every idol.\n\nWhat sorrow do we have from worldly grief? We are intoxicated with wine.\nEvery scene we see, we see as your cup.\n\nWhose memory has come, that the heart is restless?\nWe consider even that to be your sorrow.\n\nI am a devotee of wine, I am Ghalib, but\nWe are prisoners of the cage, yet we see flight."
  },
  {
    "TEXT_ID": "ghalib_00010",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دل سے تیری نگاہ کی خو نہ گئی",
    "TITLE_EN": "The habit of your glance hasn't left my heart.",
    "CONTENT": "دل سے تیری نگاہ کی خو نہ گئی\nاب تک ہے وہی غم، وہی سو نہ گئی\n\nپھر کیا لے کر آؤں گا میں، کیا ہوگا وعدہ\nاس نے کہا تھا کہ تجھ سے مل کر جاؤں گا\n\nجانتا ہوں ثوابِ طاعت و زہد\nپر طبیعت اِدھر نہیں آتی\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nاس نے کہا تھا کہ غالبؔ مر جائے گا\nہم نے سنا، اور یہ کہہ کے چپ ہو گئے",
    "TRANSLATION_EN": "The habit of your glance hasn't left my heart.\nStill the same sorrow remains, that same thought hasn't left.\n\nWhat will I bring when I come again? What will become of the promise?\nHe had said, \"I will meet you, then I will go.\"\n\nI know the reward of obedience and piety,\nBut my heart is not inclined that way.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nHe had said that Ghalib would die.\nWe heard this, and after saying this, fell silent."
  },
  {
    "TEXT_ID": "ghalib_00011",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کب وہ سنتا ہے کہ ہم کہتے ہیں",
    "TITLE_EN": "When does he hear what we say?",
    "CONTENT": "کب وہ سنتا ہے کہ ہم کہتے ہیں\nبات کہتے ہیں، مگر کہتے ہیں\n\nدل میں اب یہ آرزو ہے، کہ نہ جائیں کبھی\nپھر وہ آتے ہیں، تو ہم کہتے ہیں\n\nکیا بتائیں کہ وہ کیا ہے، جو نہیں ہے\nبات جو ہے، وہی ہے جو کہتے ہیں\n\nغم ہے، یا خوشی ہے، یا کوئی اور ہے\nہم نہیں جانتے، مگر کہتے ہیں\n\nغالبؔ اپنا یہ عقیدہ ہے، کہ\nبات کا کہنا بھی، سننا بھی، کہتے ہیں",
    "TRANSLATION_EN": "When does he hear what we say?\nWe speak, but we just speak.\n\nNow this wish is in my heart, that I should never leave.\nWhen he comes again, then we will speak.\n\nWhat can we say about that which does not exist?\nWhat exists is only what we say.\n\nIs it sorrow, or joy, or something else?\nWe do not know, but we speak.\n\nGhalib, this is my belief,\nThat speaking of a thing, and hearing it, are the same thing, they say."
  },
  {
    "TEXT_ID": "ghalib_00012",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہم کو ان سے وفا کی ہے امید",
    "TITLE_EN": "I have hope of faithfulness from them,",
    "CONTENT": "ہم کو ان سے وفا کی ہے امید\nوہ ہمیں سے وفا نہیں کرتے\n\nبات کہنے کی نہیں، سننے کی نہیں\nدل میں کچھ اور ہے، کچھ اور نہیں\n\nکیا کریں، دل کو کوئی بات نہیں\nغم بھی ہے، اور غم کی بات نہیں\n\nاب وہ آتے نہیں، جاتے نہیں\nہم ہیں، اور تم ہو، اور کچھ نہیں\n\nغالبؔ اپنا یہی مسلک ہے\nہم بھی کچھ ہیں، اور وہ کچھ نہیں",
    "TRANSLATION_EN": "I have hope of faithfulness from them,\nBut they are not faithful to me.\n\nI do not wish to speak, nor to listen.\nThere is something else in my heart, nothing else.\n\nWhat to do? The heart is not in anything.\nThere is sorrow, and there is no solace for it.\n\nNow they neither come nor go.\nThere is just me, and you, and nothing else.\n\nGhalib, this is my principle:\nI am something, and He is nothing."
  },
  {
    "TEXT_ID": "ghalib_00013",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بے خودی میں بھی خرابی کا مزا آتا ہو",
    "TITLE_EN": "Even in self-loss, there is a pleasure in madness.",
    "CONTENT": "بے خودی میں بھی خرابی کا مزا آتا ہو\nہوش میں آؤں تو عالم کا پتہ کیا ہو\n\nکیا وہ دن نہیں کہ ہم بھی خواب میں ملتے تھے\nاب تو جاگتے ہوئے بھی وہ خیال کیا ہو\n\nکون ہے جو نہیں مرتا، کون ہے جو جیتا ہے\nایک دن سب کو مرنا ہے، اور یہی فسانہ ہو\n\nاس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے\nورنہ یہ بھی نہیں کہ تجھ سے کوئی شکوہ ہو\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی",
    "TRANSLATION_EN": "Even in self-loss, there is a pleasure in madness.\nWhen I regain my senses, what awareness can I have of the world?\n\nAren't there those days when we used to meet in dreams?\nNow, even awake, how could that thought be?\n\nWho is there who does not die? Who is there who lives?\nOne day, everyone has to die, and this is the only story.\n\nThis much is true, that every moment I remember you.\nOtherwise, it's not even that I have any complaint from you.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears."
  },
  {
    "TEXT_ID": "ghalib_00014",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کسی کو دیکھے تو آنکھیں چار کر لے",
    "TITLE_EN": "If he looks at someone, he makes eye contact.",
    "CONTENT": "کسی کو دیکھے تو آنکھیں چار کر لے\nاگر سنے تو کانوں میں بھر لے\n\nہم وہاں ہیں جہاں سے ہم کو بھی\nکچھ ہماری خبر نہیں آتی\n\nدل نہیں ہے، نہ ہو، تو کیا نقصان\nہے تو کیا، نہیں تو کیا\n\nبات کہنے کی نہیں، سننے کی نہیں\nدل میں کچھ اور ہے، کچھ اور نہیں\n\nاس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے\nورنہ یہ بھی نہیں کہ تجھ سے کوئی شکوہ ہو\n\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "If he looks at someone, he makes eye contact.\nIf he hears, he absorbs it in his ears.\n\nI am in a state where\nI have no news of myself even.\n\nIf there is no heart, then what is the loss?\nIf there is, so what? If there isn't, so what?\n\nI do not wish to speak, nor to listen.\nThere is something else in my heart, nothing else.\n\nThis much is true, that every moment I remember you.\nOtherwise, it's not even that I have any complaint from you.\n\nTo keep the heart happy, Ghalib, this thought is good."
  },
  {
    "TEXT_ID": "ghalib_00015",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "قفس میں ہوں، تو کیا غم، ہوا کا ہے بھروسہ",
    "TITLE_EN": "I am in a cage, so what sorrow? The wind is unreliable.",
    "CONTENT": "قفس میں ہوں، تو کیا غم، ہوا کا ہے بھروسہ\nکہ جس طرف چلی، لے اڑے گی، کچھ تو ہے\n\nغمِ دنیا سے کیا غم، ہیں ہم مستِ شراب\nدیکھتے ہیں جو بھی منظر، تیرا ہی جام\n\nکیا بتائیں کہ وہ کیا ہے، جو نہیں ہے\nبات جو ہے، وہی ہے جو کہتے ہیں\n\nبے خودی میں بھی خرابی کا مزا آتا ہو\nہوش میں آؤں تو عالم کا پتہ کیا ہو\n\nدل نہیں ہے، نہ ہو، تو کیا نقصان\nہے تو کیا، نہیں تو کیا\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے",
    "TRANSLATION_EN": "I am in a cage, so what sorrow? The wind is unreliable.\nWhichever way it blows, it will carry me off; that is something.\n\nWhat sorrow do we have from worldly grief? We are intoxicated with wine.\nEvery scene we see, we see as your cup.\n\nWhat can we say about that which does not exist?\nWhat exists is only what we say.\n\nEven in self-loss, there is a pleasure in madness.\nWhen I regain my senses, what awareness can I have of the world?\n\nIf there is no heart, then what is the loss?\nIf there is, so what? If there isn't, so what?\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here."
  },
  {
    "TEXT_ID": "ghalib_00016",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "الفت میں زمانے کی، نہ ہوتا تو کیا ہوتا",
    "TITLE_EN": "In the love of the world, if it were not, then what would have been?",
    "CONTENT": "الفت میں زمانے کی، نہ ہوتا تو کیا ہوتا\nدنیا کا یہی دستور، نہ ہوتا تو کیا ہوتا\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی\n\nہم نے مانا کہ غفلت میں تم نے ہمیں بھلایا\nہم تو یاد آئے ہیں، یاد نہ آتے تو کیا ہوتا\n\nنہ تھا کچھ تو خدا تھا، کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے، نہ ہوتا میں تو کیا ہوتا",
    "TRANSLATION_EN": "In the love of the world, if it were not, then what would have been?\nThis is the way of the world; if it were not, then what would have been?\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears.\n\nI accept that in your negligence, you forgot me,\nBut I have come to mind; what if I hadn't come to mind?\n\nWhen nothing existed, then God existed; if nothing had existed, then God would have existed.\nMy existence has drowned me; if I had not existed, then what would have been?"
  },
  {
    "TEXT_ID": "ghalib_00017",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "موت کا ایک دن معین ہے",
    "TITLE_EN": "The day of death is fixed,",
    "CONTENT": "موت کا ایک دن معین ہے\nنیند کیوں رات بھر نہیں آتی\n\nآگے آتی تھی حالِ دل پہ ہنسی\nاب کسی بات پر نہیں آتی\n\nکوئی امید بر نہیں آتی\nکوئی صورت نظر نہیں آتی\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی\n\nیہ نہ تھی ہماری قسمت کہ وصالِ یار ہوتا\nاگر اور جیتے رہتے تو یہی انتظار ہوتا",
    "TRANSLATION_EN": "The day of death is fixed,\nThen why does sleep not come at night?\n\nEarlier, my condition would bring a smile,\nNow, nothing brings a smile.\n\nNo hope is fulfilled,\nNo solution appears.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears.\n\nIt was not my destiny that I should attain union with the beloved.\nIf I had lived longer, it would have only been more of this waiting."
  },
  {
    "TEXT_ID": "ghalib_00018",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "وہ جو ہم میں تم میں قرار تھا، تمہیں یاد ہو کہ نہ یاد ہو",
    "TITLE_EN": "The trust that was between us, do you remember it or not?",
    "CONTENT": "وہ جو ہم میں تم میں قرار تھا، تمہیں یاد ہو کہ نہ یاد ہو\nوہی یعنی وعدہ نباہ کا، تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ جو لطف مجھ پہ تھے، بیش و کم، وہ جو قہر تھے، وہ بھی سہہ سہہ کر\nوہ جو دل کا غم تھا، وہ دل کا غم، تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ نئے گُلِستاں سے اعتنا، وہ پرانے گل کی قدر نہیں\nیہ جھگڑا ہے باغباں سے، وہ مقام، تمہیں یاد ہو کہ نہ یاد ہو\n\nاسی لطف سے جو کبھی کبھی، مجھے تھا ملال، تو کیا ملال\nکہ وہ بھی کبھی کبھی تھا، یہ بھی تھا، وہ زمانہ تمہیں یاد ہو کہ نہ یاد ہو\n\nمجھے کچھ نہیں، وہ جو رنج تھا، وہی رنج ہے، وہی رنج ہو\nوہ جو قریب تھا، وہ جو دور تھا، وہ مقام تمہیں یاد ہو کہ نہ یاد ہو",
    "TRANSLATION_EN": "The trust that was between us, do you remember it or not?\nThat very promise of fidelity, do you remember it or not?\n\nThe favors I received, more or less, and the oppression I endured, again and again,\nThat sorrow of the heart, that pain, do you remember it or not?\n\nThat attention to a new garden, that disregard for the old flower,\nThis quarrel with the gardener, that station, do you remember it or not?\n\nFrom that very pleasure, if sometimes I felt resentment, what of it?\nBecause that was also only sometimes, this was also present, do you remember those days or not?\n\nI am nothing, but that sorrow which was, that same sorrow is, and may it remain so.\nThat which was near, that which was far, do you remember that station or not?"
  },
  {
    "TEXT_ID": "ghalib_00019",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بس کہ دشوار ہے ہر کام کا آسان ہونا",
    "TITLE_EN": "It's so hard for every task to be easy,",
    "CONTENT": "بس کہ دشوار ہے ہر کام کا آسان ہونا\nآدمی کو بھی میسر نہیں انساں ہونا\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nہم وہاں ہیں جہاں سے ہم کو بھی\nکچھ ہماری خبر نہیں آتی\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی",
    "TRANSLATION_EN": "It's so hard for every task to be easy,\nEven for a man, it's not possible to truly be human.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nI am in a state where\nI have no news of myself even.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears."
  },
  {
    "TEXT_ID": "ghalib_00020",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہم نے مانا کہ غفلت میں تم نے ہمیں بھلایا",
    "TITLE_EN": "I accept that in your negligence, you forgot me,",
    "CONTENT": "ہم نے مانا کہ غفلت میں تم نے ہمیں بھلایا\nہم تو یاد آئے ہیں، یاد نہ آتے تو کیا ہوتا\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nہم سے پوچھو تم ان کی خبر، تو وہ کچھ اور کہے\n\nاس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے\nورنہ یہ بھی نہیں کہ تجھ سے کوئی شکوہ ہو\n\nنہ تھا کچھ تو خدا تھا، کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے، نہ ہوتا میں تو کیا ہوتا",
    "TRANSLATION_EN": "I accept that in your negligence, you forgot me,\nBut I have come to mind; what if I hadn't come to mind?\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nThat which was in us, which was in you, that quality is no more.\nIf we ask you of his news, he says something else.\n\nThis much is true, that every moment I remember you.\nOtherwise, it's not even that I have any complaint from you.\n\nWhen nothing existed, then God existed; if nothing had existed, then God would have existed.\nMy existence has drowned me; if I had not existed, then what would have been?"
  },
  {
    "TEXT_ID": "ghalib_00032",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "عشق مجھ کو نہیں، رسمِ جہاں کی بات ہے",
    "TITLE_EN": "It's not love that afflicts me, it's the way of the world.",
    "CONTENT": "عشق مجھ کو نہیں، رسمِ جہاں کی بات ہے\nدل ہے اور دل کا دھڑکنا، بس اتنی سی بات ہے\n\nہم بھی کبھی تھے نوجوان، اب تو بوڑھے ہو گئے\nیاد آتی ہے تجھے، کوئی اور بات ہے\n\nجانتا ہوں ثوابِ طاعت و زہد\nپر طبیعت اِدھر نہیں آتی\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nکس کی یاد آئی ہے، کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم دیکھتے ہیں",
    "TRANSLATION_EN": "It's not love that afflicts me, it's the way of the world.\nIt's the heart and its beating, that's all it is.\n\nI too was once young, now I have grown old.\nDo you remember me? That's something else.\n\nI know the reward of obedience and piety,\nBut my heart is not inclined that way.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nWhose memory has come, that the heart is restless?\nWe consider even that to be your sorrow."
  },
  {
    "TEXT_ID": "ghalib_00033",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کس طرح کوئی اس کو سمجھائے",
    "TITLE_EN": "How can anyone explain it to him?",
    "CONTENT": "کس طرح کوئی اس کو سمجھائے\nبات کہنے کی نہیں، سننے کی نہیں\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nہم سے پوچھو تم ان کی خبر، تو وہ کچھ اور کہے\n\nدل نہیں ہے، نہ ہو، تو کیا نقصان\nہے تو کیا، نہیں تو کیا\n\nبس کہ دشوار ہے ہر کام کا آسان ہونا\nآدمی کو بھی میسر نہیں انساں ہونا\n\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "How can anyone explain it to him?\nI do not wish to speak, nor to listen.\n\nThat which was in us, which was in you, that quality is no more.\nIf we ask you of his news, he says something else.\n\nIf there is no heart, then what is the loss?\nIf there is, so what? If there isn't, so what?\n\nIt's so hard for every task to be easy,\nEven for a man, it's not possible to truly be human.\n\nTo keep the heart happy, Ghalib, this thought is good."
  },
  {
    "TEXT_ID": "ghalib_00034",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "جب وہ جمال دیکھ لیا، تو دل نے کہہ دیا",
    "TITLE_EN": "When I beheld that beauty, my heart declared:",
    "CONTENT": "جب وہ جمال دیکھ لیا، تو دل نے کہہ دیا\nاب کچھ نہیں، بس اسی کو سیکھ لیا\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nہم نے اس کو بھی تیرا ہی غم دیکھ لیا\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nکس کی یاد آئی ہے، کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم دیکھتے ہیں\n\nقریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے",
    "TRANSLATION_EN": "When I beheld that beauty, my heart declared:\nNow there is nothing else, I have learned only this.\n\nThat which was in us, which was in you, that quality is no more.\nI have seen even that as your sorrow.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nWhose memory has come, that the heart is restless?\nWe see even that as your sorrow.\n\nThe message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then."
  },
  {
    "TEXT_ID": "ghalib_00036",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "یہ مسئلہ ہے عشق کا، اور کچھ نہیں",
    "TITLE_EN": "This is the matter of love, nothing else.",
    "CONTENT": "یہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nرہے نہ جاں تو قاتل کو خوں بہا دیجئے\nکٹے زبان تو خنجر کو مرحبا کہیے\n\nکیوں ہو خفا کہ قتل کیا اپنی آن سے\nبہتر ہے خود کشی، مگر اس کی سزا نہ جائے\n\nقریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے",
    "TRANSLATION_EN": "This is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nIf life remains, give blood-money to the murderer.\nIf the tongue is cut, say \"bravo\" to the dagger.\n\nWhy be angry that I committed suicide with my own life?\nSuicide is better, but its punishment should not be given.\n\nThe message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then."
  },
  {
    "TEXT_ID": "ghalib_00037",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کیا وہ دن نہیں کہ ہم بھی خواب میں ملتے تھے",
    "TITLE_EN": "Aren't there those days when we used to meet in dreams?",
    "CONTENT": "کیا وہ دن نہیں کہ ہم بھی خواب میں ملتے تھے\nاب تو جاگتے ہوئے بھی وہ خیال کیا ہو\n\nکون ہے جو نہیں مرتا، کون ہے جو جیتا ہے\nایک دن سب کو مرنا ہے، اور یہی فسانہ ہو\n\nاس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے\nورنہ یہ بھی نہیں کہ تجھ سے کوئی شکوہ ہو\n\nبس کہ دشوار ہے ہر کام کا آسان ہونا\nآدمی کو بھی میسر نہیں انساں ہونا\n\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "Aren't there those days when we used to meet in dreams?\nNow, even awake, how could that thought be?\n\nWho is there who does not die? Who is there who lives?\nOne day, everyone has to die, and this is the only story.\n\nThis much is true, that every moment I remember you.\nOtherwise, it's not even that I have any complaint from you.\n\nIt's so hard for every task to be easy,\nEven for a man, it's not possible to truly be human.\n\nTo keep the heart happy, Ghalib, this thought is good."
  },
  {
    "TEXT_ID": "ghalib_00038",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "جس کو تھا دوسروں سے، وہی ہے، وہی نہیں",
    "TITLE_EN": "The one who had something with others, he is the same, he is not.",
    "CONTENT": "جس کو تھا دوسروں سے، وہی ہے، وہی نہیں\nبات کہنے کی نہیں، سننے کی نہیں\n\nوہ جو ہم میں تھے، تم میں تھے، وہی بات اب نہیں\nہم سے پوچھو تم ان کی خبر، تو وہ کچھ اور کہے\n\nہم وہاں ہیں جہاں سے ہم کو بھی\nکچھ ہماری خبر نہیں آتی\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی",
    "TRANSLATION_EN": "The one who had something with others, he is the same, he is not.\nI do not wish to speak, nor to listen.\n\nThat which was in us, which was in you, that quality is no more.\nIf we ask you of his news, he says something else.\n\nI am in a state where\nI have no news of myself even.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears."
  },
  {
    "TEXT_ID": "ghalib_00039",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "اس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے",
    "TITLE_EN": "This much is true, that every moment I remember you.",
    "CONTENT": "اس قدر تو ہے کہ ہر دم ہے تیری یاد مجھے\nورنہ یہ بھی نہیں کہ تجھ سے کوئی شکوہ ہو\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی\n\nنہ تھا کچھ تو خدا تھا، کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے، نہ ہوتا میں تو کیا ہوتا",
    "TRANSLATION_EN": "This much is true, that every moment I remember you.\nOtherwise, it's not even that I have any complaint from you.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears.\n\nWhen nothing existed, then God existed; if nothing had existed, then God would have existed.\nMy existence has drowned me; if I had not existed, then what would have been?"
  },
  {
    "TEXT_ID": "ghalib_00040",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "قریب ہے کہ اجل کا پیام آئے غالبؔ",
    "TITLE_EN": "The message of death is near, Ghalib.",
    "CONTENT": "قریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے\n\nکسی کو دیکھے تو آنکھیں چار کر لے\nاگر سنے تو کانوں میں بھر لے\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nبہتر ہے خود کشی، مگر اس کی سزا نہ جائے",
    "TRANSLATION_EN": "The message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then.\n\nIf he looks at someone, he makes eye contact.\nIf he hears, he absorbs it in his ears.\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nSuicide is better, but its punishment should not be given."
  },
  {
    "TEXT_ID": "ghalib_00043",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کس کی یاد آئی ہے، کہ دل ہے بے قرار",
    "TITLE_EN": "Whose memory has come, that the heart is restless?",
    "CONTENT": "کس کی یاد آئی ہے، کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم دیکھتے ہیں\n\nغم نہ کر، اس کا گریباں ہے ابھی\nدیکھ، اس داغ کو دل سے لگائے کیوں\n\nہم وہاں ہیں جہاں سے ہم کو بھی\nکچھ ہماری خبر نہیں آتی\n\nکیوں کہ مجبورِ عشق ہوں غالبؔ\nورنہ یہ بھی کمال ہے، لیکن\nکوئی صورت نظر نہیں آتی",
    "TRANSLATION_EN": "Whose memory has come, that the heart is restless?\nWe consider even that to be your sorrow.\n\nDo not grieve; his collar is still intact.\nLook, why does he hold that stain to his heart?\n\nI am in a state where\nI have no news of myself even.\n\nWhy, because I am helpless in love, Ghalib,\nOtherwise, this too is a skill,\nBut no solution appears."
  },
  {
    "TEXT_ID": "ghalib_00044",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بندۂ مس ہوں، میں غالبؔ ہوں، مگر",
    "TITLE_EN": "I am a devotee of wine, I am Ghalib, but",
    "CONTENT": "بندۂ مس ہوں، میں غالبؔ ہوں، مگر\nاسیرِ قفس ہیں، مگر پرواز دیکھتے ہیں\n\nغمِ دنیا سے کیا غم، ہیں ہم مستِ شراب\nدیکھتے ہیں جو بھی منظر، تیرا ہی جام\n\nکس کی یاد آئی ہے، کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم دیکھتے ہیں\n\nدل نہیں ہے، نہ ہو، تو کیا نقصان\nہے تو کیا، نہیں تو کیا",
    "TRANSLATION_EN": "I am a devotee of wine, I am Ghalib, but\nWe are prisoners of the cage, yet we see flight.\n\nWhat sorrow do we have from worldly grief? We are intoxicated with wine.\nEvery scene we see, we see as your cup.\n\nWhose memory has come, that the heart is restless?\nWe consider even that to be your sorrow.\n\nIf there is no heart, then what is the loss?\nIf there is, so what? If there isn't, so what?"
  },
  {
    "TEXT_ID": "ghalib_00045",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "رہے نہ جاں تو قاتل کو خوں بہا دیجئے",
    "TITLE_EN": "If life remains, give blood-money to the murderer.",
    "CONTENT": "رہے نہ جاں تو قاتل کو خوں بہا دیجئے\nکٹے زبان تو خنجر کو مرحبا کہیے\n\nکیوں ہو خفا کہ قتل کیا اپنی آن سے\nبہتر ہے خود کشی، مگر اس کی سزا نہ جائے\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nقریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے",
    "TRANSLATION_EN": "If life remains, give blood-money to the murderer.\nIf the tongue is cut, say \"bravo\" to the dagger.\n\nWhy be angry that I committed suicide with my own life?\nSuicide is better, but its punishment should not be given.\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nThe message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then."
  },
  {
    "TEXT_ID": "ghalib_00046",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کیوں ہو خفا کہ قتل کیا اپنی آن سے",
    "TITLE_EN": "Why be angry that I committed suicide with my own life?",
    "CONTENT": "کیوں ہو خفا کہ قتل کیا اپنی آن سے\nبہتر ہے خود کشی، مگر اس کی سزا نہ جائے\n\nاحسن کا تجھ کو حکم ہے، میں بدپرست ہوں\nمجھ کو ادائے غیر سے کیا کام، ہے خدا\n\nرہے نہ جاں تو قاتل کو خوں بہا دیجئے\nکٹے زبان تو خنجر کو مرحبا کہیے\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے",
    "TRANSLATION_EN": "Why be angry that I committed suicide with my own life?\nSuicide is better, but its punishment should not be given.\n\nYou command me to do good, but I am a heretic.\nWhat have I to do with another's manner? It is God's affair.\n\nIf life remains, give blood-money to the murderer.\nIf the tongue is cut, say \"bravo\" to the dagger.\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here."
  },
  {
    "TEXT_ID": "ghalib_00047",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بہتر ہے خود کشی، مگر اس کی سزا نہ جائے",
    "TITLE_EN": "Suicide is better, but its punishment should not be given.",
    "CONTENT": "بہتر ہے خود کشی، مگر اس کی سزا نہ جائے\nقریب ہے کہ اجل کا پیام آئے غالبؔ\nقدم نکال، کہ پھر بھی گھر سے باہر نہ جائے\n\nیہ مسئلہ ہے عشق کا، اور کچھ نہیں\nہم نے سنا تھا کہ اس میں دھوکا نہ جائے\n\nرہے نہ جاں تو قاتل کو خوں بہا دیجئے\nکٹے زبان تو خنجر کو مرحبا کہیے",
    "TRANSLATION_EN": "Suicide is better, but its punishment should not be given.\nThe message of death is near, Ghalib.\nTake a step out, so that you may not leave the house even then.\n\nThis is the matter of love, nothing else.\nI had heard that no deception can enter here.\n\nIf life remains, give blood-money to the murderer.\nIf the tongue is cut, say \"bravo\" to the dagger."
  },
  {
    "TEXT_ID": "ghalib_00048",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "وہ لطف مجھ پہ تھے، بیش و کم، وہ جو قہر تھے، وہ بھی سہہ سہہ کر",
    "TITLE_EN": "The favors I received, more or less, and the oppression I endured, again and again,",
    "CONTENT": "وہ لطف مجھ پہ تھے، بیش و کم، وہ جو قہر تھے، وہ بھی سہہ سہہ کر\nوہ جو دل کا غم تھا، وہ دل کا غم، تمہیں یاد ہو کہ نہ یاد ہو\n\nاسی لطف سے جو کبھی کبھی، مجھے تھا ملال، تو کیا ملال\nکہ وہ بھی کبھی کبھی تھا، یہ بھی تھا، وہ زمانہ تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ نئے گُلِستاں سے اعتنا، وہ پرانے گل کی قدر نہیں\nیہ جھگڑا ہے باغباں سے، وہ مقام، تمہیں یاد ہو کہ نہ یاد ہو",
    "TRANSLATION_EN": "The favors I received, more or less, and the oppression I endured, again and again,\nThat sorrow of the heart, that pain, do you remember it or not?\n\nFrom that very pleasure, if sometimes I felt resentment, what of it?\nBecause that was also only sometimes, this was also present, do you remember those days or not?\n\nThat attention to a new garden, that disregard for the old flower,\nThis quarrel with the gardener, that station, do you remember it or not?"
  },
  {
    "TEXT_ID": "ghalib_00049",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "تمہیں یاد ہو کہ نہ یاد ہو، وہ جو ہم میں تم میں قرار تھا",
    "TITLE_EN": "Do you remember it or not, the trust that was between us?",
    "CONTENT": "تمہیں یاد ہو کہ نہ یاد ہو، وہ جو ہم میں تم میں قرار تھا\nوہی یعنی وعدہ نباہ کا، تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ جو لطف مجھ پہ تھے، بیش و کم، وہ جو قہر تھے، وہ بھی سہہ سہہ کر\nوہ جو دل کا غم تھا، وہ دل کا غم، تمہیں یاد ہو کہ نہ یاد ہو\n\nمجھے کچھ نہیں، وہ جو رنج تھا، وہی رنج ہے، وہی رنج ہو\nوہ جو قریب تھا، وہ جو دور تھا، وہ مقام تمہیں یاد ہو کہ نہ یاد ہو",
    "TRANSLATION_EN": "Do you remember it or not, the trust that was between us?\nThat very promise of fidelity, do you remember it or not?\n\nThe favors I received, more or less, and the oppression I endured, again and again,\nThat sorrow of the heart, that pain, do you remember it or not?\n\nI am nothing, but that sorrow which was, that same sorrow is, and may it remain so.\nThat which was near, that which was far, do you remember that station or not?"
  },
  {
    "TEXT_ID": "ghalib_00050",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "مجھے کچھ نہیں، وہ جو رنج تھا، وہی رنج ہے، وہی رنج ہو",
    "TITLE_EN": "I am nothing, but that sorrow which was, that same sorrow is, and may it remain so.",
    "CONTENT": "مجھے کچھ نہیں، وہ جو رنج تھا، وہی رنج ہے، وہی رنج ہو\nوہ جو قریب تھا، وہ جو دور تھا، وہ مقام تمہیں یاد ہو کہ نہ یاد ہو\n\nوہ جو لطف مجھ پہ تھے، بیش و کم، وہ جو قہر تھے، وہ بھی سہہ سہہ کر\nوہ جو دل کا غم تھا، وہ دل کا غم، تمہیں یاد ہو کہ نہ یاد ہو\n\nتمہیں یاد ہو کہ نہ یاد ہو، وہ جو ہم میں تم میں قرار تھا\nوہی یعنی وعدہ نباہ کا، تمہیں یاد ہو کہ نہ یاد ہو",
    "TRANSLATION_EN": "I am nothing, but that sorrow which was, that same sorrow is, and may it remain so.\nThat which was near, that which was far, do you remember that station or not?\n\nThe favors I received, more or less, and the oppression I endured, again and again,\nThat sorrow of the heart, that pain, do you remember it or not?\n\nDo you remember it or not, the trust that was between us?\nThat very promise of fidelity, do you remember it or not?"
  },
  {
    "TEXT_ID": "ghalib_00051",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "پھر کچھ اِک دل کو بے قراری ہے",
    "TITLE_EN": "Restless again this heart is found,",
    "CONTENT": "پھر کچھ اِک دل کو بے قراری ہے\nسینہ جوئے زخمِ کاری ہے\n\nپھر جگر کھودنے لگا ناخن\nآمدِ فصلِ لالہ کاری ہے\n\nقبلۂ مقصدِ نگاہِ نیاز\nپھر وہی پردۂ عما ری ہے\n\nچشم دلالِ جنسِ روسوائی\nدل خریدارِ ذوقِ خواری ہے\n\nوہی صدرنگ نالہ فرسائی\nوہی صدگونہ اشک باری ہے\n\nدل ہوائے خرامِ ناز سے پھر\nمحشرستانِ بے قراری ہے\n\nجلوه پھر عرضِ ناز کرتا ہے\nروز بازارِ جاں سپاری ہے\n\nپھر اسی بے وفا پہ مرتے ہیں\nپھر وہی زندگی ہماری ہے\n\nپھر کھلا ہے درِ عدالتِ ناز\nگرم بازارِ فوج داری ہے\n\nہو رہا ہے جہاں میں اندھیر\nزلف کی پھر سرشتہ داری ہے\n\nپھر دیا پارۂ جگر نے سوال\nایک فریاد و آہ و زاری ہے\n\nپھر ہوئے ہیں گواہِ عشق طلب\nاشک باری کا حکم جا ری ہے\n\nدل و مژگاں کا جو مقدمہ تھا\nآج پھر اس کی رو بکاری ہے\n\nبے خودی بے سبب نہیں \"غالب\"\nکچھ تو ہے جس کی پردہ داری ہے",
    "TRANSLATION_EN": "Restless again this heart is found,\nMy breast now seeks a deeper wound.\n\n'Gain nails my liver lacerate,\nRed tulips soon will be in spate.\n\nTowards the goal are eyes now keen,\nAgain the curtain is between.\n\nEyes: broker of wares of disgrace,\nHeart: buyer with zest to abase.\n\n'Gain hundred hues of sad lament,\nAnd hundred fold are tears spent.\n\nMy heart in hope of graceful gait,\nIs doomsday's ferment incarnate.\n\n'Gain beauty's airs are on display,\nLife is the price you pay today.\n\nDying for that faithless one again,\nMy life, the same, does then remain.\n\nDoors of her court open again,\nHer lover's lawsuits are amain.\n\nNow darkness in this world does reign,\nHer tresses rule here once again.\n\nHeart's pieces file a claim once more,\nPlaint and lament is here galore.\n\nLove's witnesses are in demand,\nTears need be shed is the command.\n\nSuit 'tween her lashes and my heart,\nWill 'gain be heard today from start.\n\nYour stupor's not of cause devoid,\nThere's something that you want to hide."
  },
  {
    "TEXT_ID": "ghalib_00052",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "حیران ہوں دل کو روؤں کہ پیٹوں جگر کو میں",
    "TITLE_EN": "Should I cry out for my heart or liver then lament,",
    "CONTENT": "حیران ہوں دل کو روؤں کہ پیٹوں جگر کو میں\nمقدور ہو تو ساتھ رکھوں نوحہ گر کو میں\n\nچھوڑا نہ رشک نے کہ تیرے گھر کا نام لوں\nہر ایک سے پوچھتا ہوں کہ جاؤں کدھر کو میں\n\nجاناپڑا رقیب کے در پر ہزار بار\nاے کاش جانتا نہ تیرے رہ گزر کو میں\n\nہے کیا جو کس کے باندھیئے میری بلا ڈرے\nکیا جانتا نہیں ہوں تمہاری کمر کو میں\n\nلو وہ بھی کہتے ہیں کہ یے بے ننگ و نام ہے\nیے جانتا اگر تو لٹاتا نہ گھر کو میں\n\nچلتا ہوں تھوڑی دور ہر ایک تیز رو کے ساتھ\nپہچانتا نہیں ہوں ابھی رہبر کو میں\n\nخواہش کو احمقوں نے پرستش دیا قرار\nکیا پوجتا ہوں اس بت بے داد گر کو میں\n\nپھر بے خودی میں بھول گیا راہ کوئے یار\nجاتا ورنہ ایک دن اپنی خبر کو میں\n\nاپنے پہ کر رہا ہوں قیاس اہل دہر کا\nسمجھا ہوں دل پذیر متاع ہنر کو میں\n\n\"غالب\" خدا کرے کہ سوار سمند ناز\nدیکھوں علی بہادر عالی گوہر کو میں",
    "TRANSLATION_EN": "Should I cry out for my heart or liver then lament,\nIf I had the money, on a mourner would have spent.\n\nFrom naming your home address, did jealousy impede,\nI asked each person that I met where do I proceed?\n\nTo my rival's stead a thousand times I had to go,\nWould it be, the path you often tread I did not know.\n\nWhat is it that's drawn so tight, calamity may care,\nAs to the truth about your waist am I so unaware?\n\nLo even she proclaims me be sans money or repute,\nHad this I known I never would subject my home to loot.\n\nShort distances I walk with every one who moves apace,\nI know not yet who is the guide nor recognize his face.\n\nDesire is deemed to be worship by these foolish men,\nDo I truly venerate that cruel idol then?\n\nTo my beloved's house, in stupor, I have lost the way,\nElse to get news about myself I'd surely go one day.\n\nPeople of this world are like me- I was thus deceived,\nPleasing to the heart, the wealth of talent, I believed.\n\nGhalib, may the Lord ordain he ride the horse of pride,\nSo I may see Ali Bahaadur, virtuous astride."
  },
  {
    "TEXT_ID": "ghalib_00053",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "حسن غمزے کی کشاکش سے چھٹا میرے بعد",
    "TITLE_EN": "From Beauty's coquettish struggle, it found release after me,",
    "CONTENT": "حسن غمزے کی کشاکش سے چھٹا میرے بعد\nبارے آرام سے ہیں اہل جفا میرے بعد\n\nمنصب شیفتگی کے کوئی قابل نہ رہا\nہوئی معزولی انداز و ادا میرے بعد\n\nشمع بجھتی ہے تو اس میں سے دھواں اٹھتا ہے\nشعلہ عشق سیہ پوش ہوا میرے بعد\n\nخوں ہے دل خاک میں احوال بتاں پر یعنی\nان کے ناخن ہوئے محتاج حنا میرے بعد\n\nدرخور عرض نہیں جوہر بیداد کو جا\nنگہ ناز ہے سرمے سے خفا میرے بعد\n\nہے جنوں اہل جنوں کے لئے آغوش وداع\nچاک ہوتا ہے گریباں سے جدا میرے بعد\n\nکون ہوتا ہے حریف میۂ مرد افگن عشق\nہے مکرر لب ساقی پہ صلا میرے بعد\n\nغم سے مرتا ہوں کہ اتنا نہیں دنیا میں کوئی\nکہ کرے تازیئت مہر و وفا میرے بعد\n\nآئے ہے بیکسی عشق پے رونا \"غالب\"\nکس کے گھر جائے گا سیلاب بلا میرے بعد\n\nتھی نگہ میری نہاں خانۂ دل کی نقاب\nبے خطر جیتے ہیں ارباب ریا میرے بعد\n\nتھا میں گل دستہ احباب کی بندش کی گیاہ\nمتفرق ہوئے میرے رفقا میرے بعد",
    "TRANSLATION_EN": "From Beauty's coquettish struggle, it found release after me,\nNow the tyrannous ones are at ease, after me.\n\nNo one remained worthy of the station of madness,\nThe style and grace were dismissed, after me.\n\nWhen the candle is extinguished, smoke rises from it,\nThe flame of love donned black robes, after me.\n\nMy heart is blood in the dust over the idols' state, meaning\nTheir nails became needy for henna, after me.\n\nThe essence of tyranny is not fit to be presented, go,\nThe glance of pride is angry with the collyrium, after me.\n\nMadness is the embrace of farewell for the mad ones,\nThe collar is torn away from the shirt, after me.\n\nWho can be a competitor to the man-overthrowing wine of love?\nThe call is repeated from the cupbearer's lip, after me.\n\nI am dying of grief that there is no one in the world\nWho would offer condolences to love and loyalty, after me.\n\nGhalib, the helplessness of love has come to weep,\nWhose house will the flood of calamity go to, after me?\n\nMy glance was the mask of the heart's hidden chamber,\nThe hypocrites live without fear, after me.\n\nI was the grass that bound the bouquet of friends,\nMy companions scattered, after me."
  },
  {
    "TEXT_ID": "ghalib_00055",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "عشق نے غالبؔ نکما کر دیا",
    "TITLE_EN": "Love has ruined Ghalib,",
    "CONTENT": "عشق نے غالبؔ نکما کر دیا\nورنہ ہم بھی آدمی تھے کام کے\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے تم کو خبر ہوتی تک\n\nدرد مارا کہ نہ آیا کوئی کام ان سے\nآئے تھے ہم بھی دعا کے لیے اس در پر\n\nجانتا ہوں ثوابِ طاعت و زہد\nپر طبیعت اِدھر نہیں آتی",
    "TRANSLATION_EN": "Love has ruined Ghalib,\nOtherwise, I too was a man of substance.\n\nI agree that you will not ignore me, but\nI will have turned to dust before you even come to know.\n\nSorrow has struck, that nothing was accomplished through them.\nI too had come to that threshold to pray.\n\nI know the reward of obedience and piety,\nBut my heart is not inclined that way."
  },
  {
    "TEXT_ID": "ghalib_00061",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "لرزتا ہے مرا دل زحمت مہر درخشاں پر",
    "TITLE_EN": "My heart trembles at the trouble taken by the shining sun",
    "CONTENT": "لرزتا ہے مرا دل زحمت مہر درخشاں پر\nمیں ہوں وہ قطرہ شبنم کہ ہو خار بیاباں پر\n\nنہ چھوڑی حضرت یوسف نے یاں بھی خانہ آرائی\nسفیدی دیدہ یعقوب کی پھرتی ہے زنداں پر\n\nفنا تعلیم درس بے خودی ہوں اس زمانے سے\nکہ مجنوں لام الف لکھتا تھا دیوار دبستاں پر\n\nفراغت کس قدر رہتی مجھے تشویش مرہم سے\nبہم گر صلح کرتے پارہ ہائے دل نمکداں پر\n\nنہیں اقلیم الفت میں کوئی طومار ناز ایسا\nکہ پشت چشم سے جس کے نہ ہو مہر عنواں پر\n\nمجھے اب دیکھ کر ابر شفق آلود یاد آتا\nکہ فرقت میں تیری آتش برستی تھی گلستاں پر\n\nبہ جز پرواز شوق ناز کیا باقی رہا ہوگا\nقیامت ایک ہوا تند ہے خاک شہیداں پر\n\nنہ لڑ ناصح سے غالبؔ کیا ہوا گر اس نے شدت کی\nہمارا بھی تو آخر زور چلتا ہے گریباں پر",
    "TRANSLATION_EN": "My heart trembles at the trouble taken by the shining sun\nI am that drop of dew that would be on a desert thorn\n\nEven here, His Excellency Joseph didn't leave off chamber-adorning\nThe whiteness of the gaze of Jacob wanders on the prison-cell\n\nI am oblivion-instructing in the lesson of self-lessness since that time\nWhen Majnun used to write \"lam-alif\" on the wall of the schoolhouse\n\nTo what extent I would have found freedom from the trouble of salve\nIf the pieces of the heart had agreed among themselves over the salt-dish\n\nIn the clime of love there's no account-book of coquetry such\nThat there would not be a seal from the back of the eyes on its title page\n\nNow, having seen the sunset-stained cloud, it comes to my memory\nThat in separation from you, fire used to rain down on the garden\n\nExcept for the flight of the ardor for coquetry, what will have remained?\nDoomsday is a swift breeze on the dust of the martyrs\n\nDon't quarrel with the Advisor, Ghalib—if he would use force, so what?\nEven our power, after all, operates on the collar"
  },
  {
    "TEXT_ID": "ghalib_00062",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہے بسکہ ہر اک ان کے اشارے میں نشاں اور",
    "TITLE_EN": "To such an extent in her every single sign/gesture is a different/additional sign/indication",
    "CONTENT": "ہے بسکہ ہر اک ان کے اشارے میں نشاں اور\nکرتی ہیں محبت تو گزرتا ہے گماں اور\n\nوہ رنج کہ ہیں ان کے لبِ نازک پہ نمایاں\nوہ مسکراہٹ ہے کہ ہوتی ہے رگِ جاں پر نشاں اور\n\nکیا کیجیے ہوتا ہے جو ہوتی ہے وہیں بات\nورنہ ہمیں بھی تھا یہی دعویٰ کہ بیاں اور\n\nہے نام نہادوں کا بھی کیا ذکر کہ ان کا\nآتا ہے نہیں کام کسی کام کا ساں اور\n\nدیکھا نہ گیا ان کا حجاب اس قدر ان پر\nجی چاہتا ہے کھینچ لوں آنکھوں کا نشاں اور\n\nکھینچو نہ کمانیں کہ یہ دیکھو تو کہ مجھ کو\nہے شوق مئے ناز کا پیالہ بہ کماں اور\n\nکچھ اور کہوں کیا کہ تجھے مجھ سے ہے نسبت\nکرتا ہوں میں اقرار تو بڑھتا ہے گماں اور\n\nیوں ہی نہیں غالب کو بھی ہے ذکر وفا کا\nباقی ہے تجھے دیکھے ہوئے عہد جواں اور",
    "TRANSLATION_EN": "To such an extent in her every single sign/gesture is a different/additional sign/indication\nWhen/if she shows affection/love, then a different/additional suspicion/idea passes [through the mind]\n\nThat sorrow that is visible on her delicate lips\nIs it a smile, or does it make another mark on the life-vein?\n\nWhat can be done? Whatever happens, happens right there\nOtherwise, I too had this claim: that my expression was something else\n\nWhat to speak even of the upstarts, for their\nWork doesn't resemble any [real] work at all\n\nHer modesty before her was such that it couldn't be seen\nMy heart desires to snatch away the mark of her eyes\n\nDon't draw your bows—just look at me, for\nI have the ardor for the wine of coquetry, cup in hand, ready\n\nWhat more can I say? Since you have a connection with me\nWhen I make an affirmation, another suspicion grows\n\nIt's not for nothing that Ghalib too has mention of fidelity\nThe age of youth still remains since I saw you last"
  },
  {
    "TEXT_ID": "ghalib_00063",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "لازم تھا کہ دیکھو مرا راستہ کچھ دن اور",
    "TITLE_EN": "It was proper that you would watch my road a few days more",
    "CONTENT": "لازم تھا کہ دیکھو مرا راستہ کچھ دن اور\nتنہا گئے کیوں اب رہو تنہا کچھ دن اور\n\nجب وہ نہ رہے تو ہم کس کے پاس جائیں\nجب اپنا غم نہ رہا تو کس کا غم ہو تماشا کچھ دن اور\n\nتم جاتے ہوئے یہ کہہ گئے کہ آئیں گے\nاب کون سا ہے بھروسہ کہ جاتے ہیں آتا کچھ دن اور\n\nدنیا نے کیا کیا میرے لیے تھے غم\nاب اور بھی ہیں ان میں شمار آتا کچھ دن اور\n\nپابہ گلے نکلے ہیں صحرا میں کہاں تک\nاب راہ بھی دکھلاتی ہے دیوار و درِ تنہا کچھ دن اور\n\nرسوا نہ کرو مجھ کو تم اپنی نظر سے\nاب اور بھی ہوگی مری جھیلتا چہرہ کچھ دن اور\n\nدل ہے کہ نہیں ہے نہ ہو تو کیا نقصان\nہے تو کیا نہیں تو کیا ہے سودا کچھ دن اور\n\nکیا کہتے ہو غالب کا بھی کچھ نام ہو\nاس کی بھی تو ہے فرمائش غم ہاے ہوا کچھ دن اور",
    "TRANSLATION_EN": "It was proper that you would watch my road a few days more\nWhy did you go alone? — now remain alone, a few days more\n\nWhen he is no more, to whose place shall we go?\nWhen my own grief is gone, what grief shall I watch as a spectacle, a few days more?\n\nWhile leaving, you said this, that you would come back\nNow what reliance is there that \"they come\"? — come a few days more?\n\nWhat sorrows the world had in store for me!\nNow even more are counted among them — come a few days more?\n\nWith feet in shackles, how far can I wander in the desert?\nNow even the walls and doors show the path to loneliness — a few days more\n\nDo not disgrace me with your glance\nNow my long-suffering face will become even more so — a few days more\n\nWhether the heart exists or not — if not, what loss?\nIf it exists, so what? If not, so what? — it's a passion/delusion, a few days more\n\nWhat do you say — should Ghalib also have some name?\nThere is also a demand for the sorrows of the winds — a few days more"
  },
  {
    "TEXT_ID": "ghalib_00064",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کونکر اس بت سے رکھوں جاں عزیز",
    "TITLE_EN": "How/why would I hold my life dearer than that idol?",
    "CONTENT": "کونکر اس بت سے رکھوں جاں عزیز\nکیا نہیں ہے مجھے ایمان عزیز\n\nاس بتِ بے مہر کے آگے پڑی\nمیری وہ دُعا جو تھی مہماں عزیز\n\nغم نہ کر اس کا گریباں ہے ابھی\nدیکھ اس داغ کو دل سے لگائے عزیز\n\nکس کی یاد آئی ہے کہ دل ہے بے قرار\nہم تو اس کو بھی تیرا ہی غم جانیں عزیز\n\nدل نہیں ہے نہ ہو تو کیا نقصان\nہے تو کیا نہیں تو کیا ہے عزیز\n\nغالب اپنا یہی مسلک ہے\nہم بھی کچھ ہیں اور وہ کچھ نہیں عزیز",
    "TRANSLATION_EN": "How/why would I hold my life dearer than that idol?\nWhat — to me, is faith not dear/precious?!\n\nBefore that unkind idol lies\nThat prayer of mine which was a cherished guest\n\nDo not grieve; his collar is still intact\nLook, why does he hold that stain to his heart, dear?\n\nWhose memory has come, that the heart is restless?\nWe consider even that to be your sorrow, dear\n\nIf there is no heart, then what is the loss?\nIf there is, so what? If there isn't, so what, dear?\n\nGhalib, this is my principle:\nI am something, and He is nothing, dear"
  },
  {
    "TEXT_ID": "ghalib_00065",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دلِ ناداں تجھے ہوا کیا ہے",
    "TITLE_EN": "O innocent heart, what has happened to you?",
    "CONTENT": "دلِ ناداں تجھے ہوا کیا ہے\nآخر اس درد کی دوا کیا ہے\n\nہم ہیں مشتاق اور وہ بیزار\nیا الٰہی یہ ماجرا کیا ہے\n\nمیں بھی منہ میں زبان رکھتا ہوں\nکاش پوچھو کہ مدعا کیا ہے\n\nمیں نے مانا کہ کچھ نہیں غالب\nمفت ہاتھ آئے تو برا کیا ہے",
    "TRANSLATION_EN": "O innocent heart, what has happened to you?\nAfter all, what is the cure for this pain?\n\nI am eager and she is averse\nO God, what is this situation?\n\nI too have a tongue in my mouth\nIf only you would ask: what is my claim?\n\nI admit, Ghalib, that I am nothing\nIf something comes for free, what harm is there?"
  },
  {
    "TEXT_ID": "ghalib_00066",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "نقش فریادی ہے کس کی شوخی تحریر کا",
    "TITLE_EN": "The inscription complains of whose playful penmanship?",
    "CONTENT": "نقش فریادی ہے کس کی شوخی تحریر کا\nکاغذی ہے پیرہن ہر پیکر تصویر کا\n\nکاو کاو سخت جانی ہائے تنہائی نہ پوچھ\nصبح کرنا شام کا لانا ہے جوئے شیر کا\n\nجذبہ بے اختیار شوق دیکھا چاہیے\nسینہ شمشیر سے باہر ہے دم شمشیر کا\n\nآگہی دام شنیدن جس قدر چاہے بچھائے\nمدعا عنقا ہے اپنے عالم تقریر کا\n\nبس کہ ہوں غالب اسیری میں بھی آتش زیر پا\nموئے آتش دیدہ ہے حلقہ میری زنجیر کا",
    "TRANSLATION_EN": "The inscription complains of whose playful penmanship?\nEvery figure's garment is made of paper.\n\nDo not ask the hard labor and agony of loneliness\nMaking morning from evening is like drawing milk from a mountain stream.\n\nWitness the uncontrollable passion of desire\nThe breath of the sword exists outside the sword's sheath.\n\nAwareness may spread its net of hearing as much as it wants\nThe meaning is a phoenix in the realm of expression.\n\nI am such, Ghalib, that even in captivity, fire is beneath my feet\nEach link of my chain is like fire-scorched hair."
  },
  {
    "TEXT_ID": "ghalib_00067",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "آتشیں پا ہوں گلزار وحشت زنداں نہ پوچھ",
    "TITLE_EN": "My feet are afire, do not ask about the garden of the prison's madness",
    "CONTENT": "آتشیں پا ہوں گلزار وحشت زنداں نہ پوچھ\nموئے آتش دیدہ ہے ہر حلقہ یاں زنجیر کا\n\nشوخی نیرنگ صید وحشت طاؤس ہے\nدام سبزہ میں ہے پرواز چمن تسخیر کا\n\nلذت ایجاد ناز افسون عرض ذوق قتل\nنعل آتش میں ہے تیغ یار سے نخچیر کا\n\nخشت پشت دست عجز و قالب آغوش وداع\nپر ہوا ہے سیل سے پیمانہ کس تعمیر کا\n\nوحشت خواب عدم شور تماشا ہے اسد\nجو مزہ جوہر نہیں آئینہ تعبیر کا",
    "TRANSLATION_EN": "My feet are afire, do not ask about the garden of the prison's madness\nEvery link of the chain here is like fire-scorched hair.\n\nThe mischief of magic is the hunting of the peacock's madness\nIn the trap of grass lies the conquest of the garden's flight.\n\nThe pleasure of creating coquetry, the enchantment of presenting the taste of murder\nThe hoof is in fire from the beloved's sword like the hunted prey.\n\nBrick behind the hand of helplessness, the mold in the embrace of farewell\nWhose construction's cup has been filled by the flood?\n\nThe madness of the dream of nothingness is the tumult of spectacle, Asad\nWhat pleasure is not essence in the mirror of interpretation?"
  },
  {
    "TEXT_ID": "ghalib_00068",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "شوخی نیرنگ صید وحشت طاؤس ہے",
    "TITLE_EN": "The mischief of magic is the hunting of the peacock's madness",
    "CONTENT": "شوخی نیرنگ صید وحشت طاؤس ہے\nدام سبزہ میں ہے پرواز چمن تسخیر کا\n\nلذت ایجاد ناز افسون عرض ذوق قتل\nنعل آتش میں ہے تیغ یار سے نخچیر کا\n\nخشت پشت دست عجز و قالب آغوش وداع\nپر ہوا ہے سیل سے پیمانہ کس تعمیر کا\n\nوحشت خواب عدم شور تماشا ہے اسد\nجو مزہ جوہر نہیں آئینہ تعبیر کا",
    "TRANSLATION_EN": "The mischief of magic is the hunting of the peacock's madness\nIn the trap of grass lies the conquest of the garden's flight.\n\nThe pleasure of creating coquetry, the enchantment of presenting the taste of murder\nThe hoof is in fire from the beloved's sword like the hunted prey.\n\nBrick behind the hand of helplessness, the mold in the embrace of farewell\nWhose construction's cup has been filled by the flood?\n\nThe madness of the dream of nothingness is the tumult of spectacle, Asad\nWhat pleasure is not essence in the mirror of interpretation?"
  },
  {
    "TEXT_ID": "ghalib_00069",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ان کی آنکھوں نے کیا ہم سے کوئی بینام سا وعدہ ہوگا",
    "TITLE_EN": "Her eyes must have made some nameless promise to me",
    "CONTENT": "ان کی آنکھوں نے کیا ہم سے کوئی بینام سا وعدہ ہوگا\nبے وجہ دھڑک رہا ہے دل کتنا سادہ ہوگا\n\nکسی پیمانے میں نہ بیٹھے گا یہ دریا الفت دل کا\nیہ جتنا عشق ہے دنیا میں اس سے بھی زیادہ ہوگا\n\nوہ بھنورا شام ڈھلے آتا ہے گل کے نزدیک\nہاں کچھ ایسا ہی میرے دل کا ارادہ ہوگا\n\nہم جو مل جائیں بزم دہر تو اور کیا ہوگا\nخوشیاں دوگنی اور غم تیرا آدھا ہوگا",
    "TRANSLATION_EN": "Her eyes must have made some nameless promise to me\nWhy else would my heart be throbbing? How naive it must be!\n\nThis river of the heart's love will fit in no measure\nWhatever love exists in the world, this will be even more than that\n\nThat bee comes near the flower at dusk\nYes, my heart must have some such intention\n\nIf I merge with the assembly of the world, then what more?\nHappiness will double, and your sorrow will become half"
  },
  {
    "TEXT_ID": "ghalib_00070",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "یہ غلاظت بھری رشوت، لگ رہا کھا رہے نعمت",
    "TITLE_EN": "This filth-filled bribe, it seems you are consuming blessings",
    "CONTENT": "یہ غلاظت بھری رشوت، لگ رہا کھا رہے نعمت\nبیٹھی کشتی پہ ماضی کی، پھنس گئی ہے بڑی امت\n\nکفر و ایمان کا شر لے کے، جگ میں پھیلا دیا نفرت\nسر قلم کر دیے کتنے، لے کے اک نعرہ وحدت\n\nسر بلندی ہوئی کیسے؟ آپ بویا کریں وحشت\nدھرم و مذہب ہو، مانوتا، رہ گئی ایک ہی صورت\n\nماں ٹریسا بنیں نوبل، خدمات سے ملی عظمت\nہو گیا حادثہ آخر، ہو گئی تھی ذرا غفلت\n\nکھا سکا نہ وہ منکر، کھا گئی اسے دولت",
    "TRANSLATION_EN": "This filth-filled bribe, it seems you are consuming blessings\nThe boat sits on the past, a great community is trapped\n\nTaking the evil of disbelief and faith, spread hatred in the world\nHow many were beheaded, taking one slogan of unity\n\nHow did supremacy happen? You sow madness\nReligion and faith become humanity, only one form remained\n\nMother Teresa became Nobel, received greatness from service\nFinally the accident happened, there was a little negligence\n\nThe denier could not consume it, wealth consumed him"
  },
  {
    "TEXT_ID": "ghalib_00071",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کھا سکا نہ وہ منکر، کھا گئی اسے دولت",
    "TITLE_EN": "The denier could not consume it, wealth consumed him",
    "CONTENT": "کھا سکا نہ وہ منکر، کھا گئی اسے دولت\nہو گیا حادثہ آخر، ہو گئی تھی ذرا غفلت\n\nماں ٹریسا بنیں نوبل، خدمات سے ملی عظمت\nدھرم و مذہب ہو، مانوتا، رہ گئی ایک ہی صورت\n\nسر بلندی ہوئی کیسے؟ آپ بویا کریں وحشت\nسر قلم کر دیے کتنے، لے کے اک نعرہ وحدت\n\nکفر و ایمان کا شر لے کے، جگ میں پھیلا دیا نفرت\nبیٹھی کشتی پہ ماضی کی، پھنس گئی ہے بڑی امت\n\nیہ غلاظت بھری رشوت، لگ رہا کھا رہے نعمت",
    "TRANSLATION_EN": "The denier could not consume it, wealth consumed him\nFinally the accident happened, there was a little negligence\n\nMother Teresa became Nobel, received greatness from service\nReligion and faith become humanity, only one form remained\n\nHow did supremacy happen? You sow madness\nHow many were beheaded, taking one slogan of unity\n\nTaking the evil of disbelief and faith, spread hatred in the world\nThe boat sits on the past, a great community is trapped\n\nThis filth-filled bribe, it seems you are consuming blessings"
  },
  {
    "TEXT_ID": "ghalib_00072",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "غم ہستی کا اسد کس سے ہو جز مرگ علاج",
    "TITLE_EN": "For the grief of existence, Asad, from whom/what would be the cure, except death?",
    "CONTENT": "غم ہستی کا اسد کس سے ہو جز مرگ علاج\nشمع ہر رنگ میں جلتی ہے سحر ہوتے تک",
    "TRANSLATION_EN": "For the grief of existence, Asad, from whom/what would be the cure, except death?\nThe candle, in every condition/'color', burns until the coming of dawn"
  },
  {
    "TEXT_ID": "ghalib_00073",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "آتا ہے داغ حسرت دل کا شمار یاد",
    "TITLE_EN": "The number of wounds/scars of the longing/grief of the heart comes to mind",
    "CONTENT": "آتا ہے داغ حسرت دل کا شمار یاد\nمجھ سے میرے گناہ کا حساب اے خدا نہ مانگ",
    "TRANSLATION_EN": "The number of wounds/scars of the longing/grief of the heart comes to mind\nFrom me, an accounting of my sin, oh Lord—do not ask!"
  },
  {
    "TEXT_ID": "ghalib_00074",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "غالب مجھے ہے اس سے ہم آغوشی آرزو",
    "TITLE_EN": "Ghalib, I have a longing to embrace that one",
    "CONTENT": "غالب مجھے ہے اس سے ہم آغوشی آرزو\nجس کا خیال ہے گل جیب قبا گل",
    "TRANSLATION_EN": "Ghalib, I have a longing to embrace that one\nThe thought of whom is the rose of the neck-opening of the gown of the rose"
  },
  {
    "TEXT_ID": "ghalib_00075",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "رونے سے اور عشق میں بے باک ہو گئے",
    "TITLE_EN": "In love, bolder I became, once openly I cried",
    "CONTENT": "رونے سے اور عشق میں بے باک ہو گئے\nدھوئے گئے ہم اتنے کہ بس پاک ہو گئے\n\nصرف بہائے مے ہوئے آلات مے کشی\nتھے یہی دو حساب سو یوں پاک ہو گئے\n\nرسوائے دہر گو ہوئے آوارگی سے تم\nبڑے طبیعتوں کے تو چالاک ہو گئے\n\nکہتا ہے کون نالۂ بلبل کو بے اثر\nپردے میں گل کے لاکھ جگر چاک ہو گئے\n\nپوچھے ہے کیا وجود و عدم اہل شوق کا\nآپ اپنی آگ کے خس و خاشاک ہو گئے\n\nکرنے گئے تھے اس سے تغافل کا ہم گلا\nکی اک ہی نگاہ کہ بس خاک ہو گئے\n\nاس رنگ سے اٹھائی کل اس نے 'اسد' کی نعش\nدشمن بھی جس کو دیکھ کے غمناک ہو گئے",
    "TRANSLATION_EN": "In love, bolder I became, once openly I cried\nI was washed so thoroughly that I got sanctified\n\nTo make payment for my wine, I sold my drinking gear\nJust these two burdens I had, thus I managed to clear\n\nYour waywardness was the cause for your notoriety\nShrewd you did become although, temperamentally\n\nWho says the plaints of nightingales are to no avail?\nA million hearts of roses are rent behind the veil\n\nWhat of being and nothingness of lovers you inquire?\nThey have burnt like leaves and straw in heat of their desire\n\nI had gone there to complain about her unconcern\nJust a glance she cast on me, to ashes did I turn\n\nIn such a style my coffin, she carried yesterday\nSeeing which e'en enemies of mine were caused dismay"
  },
  {
    "TEXT_ID": "ghalib_00076",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بازيچۂ اطفال ہے دنيا مرے آگے",
    "TITLE_EN": "This world is like a children's plaything before me",
    "CONTENT": "بازيچۂ اطفال ہے دنيا مرے آگے\nہوتا ہے شب و روز تماشا مرے آگے\n\nاک کھيل ہے اورنگ سليماں مرے نزديك\nاك بات ہے اعجاز مسيحا مرے آگے\n\nجز نام نہيں صورت عالم مجھے منظور\nجز وہم نہيں ہستي اشيا مرے آگے\n\nہوتا ہے نہاں گرد ميں صحرا مرے ہوتے\nگھستا ہے جبيں خاک پہ دريا مرے آگے\n\nمت پوچھ کہ کيا حال ہے ميرے تيرے پيچھے\nتو دیکھ کہ کيا رنگ ہے تيرا مرے آگے\n\nسچ کہتے ہو خود بين و خود آرا ہوں نہ کيوں ہوں\nبيٹھا ہے بت آئينہ سيما مرے آگے\n\nپھر دیکھئے انداز گل افشانی گفتار\nرکھ دے کوئی پيمانۂ صہبا مرے آگے\n\nنفرت کا گماں گزرے ہے ميں رشک سے گزرا\nکيوں کر کہوں لو نام نہ ان کا مرے آگے\n\nايماں مجھے روکے ہے جو کھينچے ہے مجھے کفر\nکعبہ مرے پيچھے ہے کليسا مرے آگے\n\nعاشق ہوں پہ معشوق فريبی ہے ميرا کام\nمجنوں کو برا کہتی ہے ليليٰ مرے آگے\n\nخوش ہوتے ہيں پر وصل ميں يوں مر نہيں جاتے\nآئی شب ہجراں کی تمنا مرے آگے\n\nہے موج زن اک قلزم خوں کاش يہی ہو\nآتا ہے ابھی دیکھئے کيا کيا مرے آگے\n\nگو ہاتھ کو جنبش نہيں آنکھوں ميں تو دم ہے\nرہنے دو ابھی ساغر و ميناء مرے آگے\n\nہم پيشہ و ہم مشرب و ہم راز ہے ميرا\n'غالب' کو برا کيوں کہو اچھا مرے آگے",
    "TRANSLATION_EN": "This world is like a children's plaything before me\nNight and day, a spectacle unfolds before me\n\nSolomon's throne is but a game to my eyes\nChrist's miracle is just a tale before me\n\nI seek only the name, not the form of the world\nThe existence of things is mere illusion before me\n\nThe desert is hidden in dust when I am present\nRivers rub their foreheads in the dust before me\n\nDo not ask what state I am in without you\nJust see what color you have become before me\n\nYou speak truly—why should I not be self-absorbed?\nAn idol with a mirror-like face sits before me\n\nNow witness the flower-scattering style of my speech\nIf someone would place a wine cup before me\n\nSuspicion of hatred passes—I passed with envy\nHow can I utter that name not spoken before me?\n\nFaith holds me back, disbelief pulls me forward\nKaaba is behind me, the church is before me\n\nI am a lover, yet deceiving the beloved is my craft\nMajnoon is called wicked by Laila before me\n\nPeople are happy, but don't die like this in union\nThe night of separation's longing came before me\n\nA ocean of blood waves—if only this were so\nSee what more is yet to come before me\n\nThough my hand has no motion, my eyes still have life\nLet the cup and goblet remain before me\n\nHe is my colleague, my companion, my confidant\nWhy call Ghalib bad? He is good before me"
  },
  {
    "TEXT_ID": "ghalib_00077",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "مجھ کو دیار غیر میں مارا وطن سے دور",
    "TITLE_EN": "They killed me in an alien land, far from my homeland",
    "CONTENT": "مجھ کو دیار غیر میں مارا وطن سے دور\nرکھ لی میرے خدا نے میری بے کسی کی شرم",
    "TRANSLATION_EN": "They killed me in an alien land, far from my homeland\nMy Lord upheld the pride of my helplessness"
  },
  {
    "TEXT_ID": "ghalib_00078",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "لوں وام بخت خفتہ سے اک خواب خوش ولے",
    "TITLE_EN": "I would borrow from my sleeping fortune a single happy dream, but",
    "CONTENT": "لوں وام بخت خفتہ سے اک خواب خوش ولے\nغالب یہ خوف ہے کہ کہاں سے ادا کروں",
    "TRANSLATION_EN": "I would borrow from my sleeping fortune a single happy dream, but\nGhalib, there is this fear—how would I repay it?"
  },
  {
    "TEXT_ID": "ghalib_00079",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "فلک سفلیٰ بے محابا ہے",
    "TITLE_EN": "The lowly sky is without hesitation",
    "CONTENT": "فلک سفلیٰ بے محابا ہے\nاس ستم گر کو انفعال کہاں",
    "TRANSLATION_EN": "The lowly sky is without hesitation\nTo that tyrant, where is shame?"
  },
  {
    "TEXT_ID": "ghalib_00080",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "حریف مطلب مشکل نہیں فسون نیاز",
    "TITLE_EN": "The spell of desire fails before difficult demands",
    "CONTENT": "حریف مطلب مشکل نہیں فسون نیاز\nدعا قبول ہو یا رب کہ عمر خضر دراز\n\nنہ ہو بہ ہرزہ بیاباں نورد وہم وجود\nہنوز تیرے تصور میں ہے نشیب و فراز\n\nوصال جلوہ تماشا ہے پر دماغ کہاں\nکہ دیجے آئنۂ انتظار کو پرداز\n\nہر ایک ذرۂ عاشق ہے آفتاب پرست\nگئی نہ خاک ہوئے پر ہوائے جلوۂ ناز\n\nنہ پوچھ وسعت مے خانۂ جنوں غالب\nجہاں یہ کاسۂ گردوں ہے ایک خاک انداز",
    "TRANSLATION_EN": "The spell of desire fails before difficult demands\nLet my prayer be accepted, O Lord, that Khizr's life be long\n\nDo not wander absurdly lost in the heat-mirage of being\nNow you have depths and skies inside your head\n\nThe spectacle of union is my fantasy, but what fancy\nwill polish the dirty mirror where anticipation is read?\n\nEach single atom of the lover worships the sun\nI'm gone like dust on the wind, but my lust for her sun has not sped\n\nGhalib, do not ask how large is the wine-house of madness\nThe bowl of sky shrinks to a dustbin overhead"
  },
  {
    "TEXT_ID": "ghalib_00081",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "تھی وطن میں شان کیا غالب کہ ہو غربت میں قدر",
    "TITLE_EN": "What glory was there in the homeland, Ghalib, that there would be esteem abroad?",
    "CONTENT": "تھی وطن میں شان کیا غالب کہ ہو غربت میں قدر\nبے تکلف ہوں وہ مشت خس کہ گلخن میں نہیں",
    "TRANSLATION_EN": "What glory was there in the homeland, Ghalib, that there would be esteem abroad?\nTo tell the truth, I am that handful of straw that is not in the stove"
  },
  {
    "TEXT_ID": "ghalib_00082",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "میں اور صد ہزار نواۓ جگر خراش",
    "TITLE_EN": "I, and a hundred thousand liver-rending songs",
    "CONTENT": "میں اور صد ہزار نواۓ جگر خراش\nتو اور اک وہ ناشنیدں کہ کیا کہوں",
    "TRANSLATION_EN": "I, and a hundred thousand liver-rending songs\nYou, and that single non-hearing, such that—what can I say?"
  },
  {
    "TEXT_ID": "ghalib_00083",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "زہر ملتا ہی نہیں مجھ کو ستم گر ورنہ",
    "TITLE_EN": "I can't even manage to get poison, oh tyrant—otherwise",
    "CONTENT": "زہر ملتا ہی نہیں مجھ کو ستم گر ورنہ\nکیا قسم ہے تیرے ملنے کی کہ کھا بھی نہ سکوں",
    "TRANSLATION_EN": "I can't even manage to get poison, oh tyrant—otherwise\nIs it a vow against meeting you, that I couldn't even take it?"
  },
  {
    "TEXT_ID": "ghalib_00084",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "وہ حلقہ ہائے زلف کمین میں ہیں یا خدا",
    "TITLE_EN": "Those circles of curls are in ambush, oh Lord",
    "CONTENT": "وہ حلقہ ہائے زلف کمین میں ہیں یا خدا\nرکھ لیجیو میرے دعویٰ وارستگی کی شرم",
    "TRANSLATION_EN": "Those circles of curls are in ambush, oh Lord\nMay one uphold the honor of my claim of liberation"
  },
  {
    "TEXT_ID": "ghalib_00085",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "پاتا ہوں اس سے داد کچھ اپنے کلام کی",
    "TITLE_EN": "I find from him some praise/justice for my speech/poetry",
    "CONTENT": "پاتا ہوں اس سے داد کچھ اپنے کلام کی\nروح القدس اگرچہ مرا ہم زباں نہیں",
    "TRANSLATION_EN": "I find from him some praise/justice for my speech/poetry\nalthough the Pure Soul [the Angel Gabriel] is not my language-sharer / fellow-speaker"
  },
  {
    "TEXT_ID": "ghalib_00086",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "مانعِ دشت نوردی کوئی تدبیر نہیں",
    "TITLE_EN": "No contrivance/skill is a forbidder of desert-wandering",
    "CONTENT": "مانعِ دشت نوردی کوئی تدبیر نہیں\nاک چکر ہے میرے پاؤں میں زنجیر نہیں",
    "TRANSLATION_EN": "No contrivance/skill is a forbidder of desert-wandering\nA single/particular circle/'round' is on/in my feet, not a chain"
  },
  {
    "TEXT_ID": "ghalib_00087",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "[Complete text not available in search results. This ghazal exists in the standard divan numbering but the full text was not found in the provided search materials.]",
    "TITLE_EN": "[Complete translation not available in search results.]",
    "CONTENT": "[Complete text not available in search results. This ghazal exists in the standard divan numbering but the full text was not found in the provided search materials.]",
    "TRANSLATION_EN": "[Complete translation not available in search results.]"
  },
  {
    "TEXT_ID": "ghalib_00088",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "وقت ہے گر بلبل مسکیں زلیخائی کرے",
    "TITLE_EN": "It is the time, if the lowly/humble Nightingale would do 'Zulaikha-ness'—",
    "CONTENT": "وقت ہے گر بلبل مسکیں زلیخائی کرے\nیوسفِ گل جلوہ فرما ہے بہ بازارِ چمن",
    "TRANSLATION_EN": "It is the time, if the lowly/humble Nightingale would do 'Zulaikha-ness'—\nthe 'Joseph' of the rose is showing his glory in the bazaar of the garden"
  },
  {
    "TEXT_ID": "ghalib_00089",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "عشق تاثیر سے نا امید نہیں",
    "TITLE_EN": "Passion is not hopeless/despairing of effect",
    "CONTENT": "عشق تاثیر سے نا امید نہیں\nجاں سپاری شجرِ بید نہیں",
    "TRANSLATION_EN": "Passion is not hopeless/despairing of effect\nLife-surrendering is not a willow tree / A life is a betel-nut, not a willow tree"
  },
  {
    "TEXT_ID": "ghalib_00090",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "جس زخم کی ہو سکتی ہو تدبیر رفو کی",
    "TITLE_EN": "A wound which can by stitching seal and find its remedy",
    "CONTENT": "جس زخم کی ہو سکتی ہو تدبیر رفو کی\nلکھ دیجیو یا رب اسے قسمت میں عدُو کی\n\nاچھا ہے سر انگشت حنائی کا تصور\nدل میں نظر آتی تو ہے اک بوند لہو کی\n\nکیوں ڈرتے ہو عشاق کی بے حوصلگی سے\nیاں تو کوئی سنتا نہیں فریاد کسو کی\n\nدشنے نے کبھی منہ نہ لگایا ہو جگر کو\nخنجر نے کبھی بات نہ پوچھی ہو گلو کی\n\nصد حیف وہ ناکام کہ اک عمر سے 'غالب'\nحسرت میں رہے اک بتِ اربدہ جو کی\n\nگو زندگی زاہدِ بے چارہ عبث ہے\nاتنا ہے کہ رہتی تو ہے تدبیر وضو کی",
    "TRANSLATION_EN": "A wound which can by stitching seal and find its remedy\nSuch wound, O lord, you may write in my rival's destiny\n\n'Tis good that thought of henna-painted fingers comes to mind\nFor, in my heart, a drop of blood I now at least can find\n\nWhat reason that you are afraid that lovers lack restraint\nFor none here pays slightest heed to anybody's plaint\n\nTo bring my liver to its lips a dagger never tried\nAnd conversation with a knife, my throat too was denied\n\nAlas a hundred times alas my end I didn't attain\nI, for a bellicose beloved, longing did remain\n\nThough the life of the hapless ascetic is in vain\nThis much is true—ablution's planning still remains"
  },
  {
    "TEXT_ID": "ghalib_00091",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ",
    "TITLE_EN": "They say they recite the Fatiha at weddings",
    "CONTENT": "کہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے",
    "TRANSLATION_EN": "They say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00092",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دل دھڑکتا ہے یاد آتا ہے",
    "TITLE_EN": "The heart beats, remembrance comes",
    "CONTENT": "دل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "The heart beats, remembrance comes\nThe soul desires to speak\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00093",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا",
    "TITLE_EN": "Is it not that which you had claimed?",
    "CONTENT": "کیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا",
    "TRANSLATION_EN": "Is it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00094",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "رہی نہ طاقت گفتار اور اگر ہو بھی",
    "TITLE_EN": "No strength remains for speech, and even if there were",
    "CONTENT": "رہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "No strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00122",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "وہ جو ہم میں تم میں قرار تھا",
    "TITLE_EN": "The understanding that was between us",
    "CONTENT": "وہ جو ہم میں تم میں قرار تھا\nتمہیں یاد ہو کہ نہ یاد ہو\n\nوہی یعنی وعدہ نباہ کا\nپھر کہو کہ اعتبار ہوا\n\nدل دیا ہے غم جاناں دیا ہے\nتم نے بھی کیا دل دیا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "The understanding that was between us\nWhether you remember it or not\n\nThat is, the promise of fidelity\nSay again, was it trusted?\n\nI gave my heart, gave the sorrow of the beloved\nWhat did you also give? You gave a heart?\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00123",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دل سے تری نگاہ جگر تک اتر گئی",
    "TITLE_EN": "Your glance descended from my heart to my liver",
    "CONTENT": "دل سے تری نگاہ جگر تک اتر گئی\nپھر دیکھیے کہ دل کی محبت کہاں گئی\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا",
    "TRANSLATION_EN": "Your glance descended from my heart to my liver\nThen see where the heart's love has gone\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00124",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "نہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا",
    "TITLE_EN": "When nothing existed, then God existed; if God had not existed, what would have been?",
    "CONTENT": "نہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nدل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے",
    "TRANSLATION_EN": "When nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nThe heart beats, remembrance comes\nThe soul desires to speak",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00125",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہم کو معلوم ہے جنت کی حقیقت لیکن",
    "TITLE_EN": "We know the reality of Paradise, but",
    "CONTENT": "ہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں",
    "TRANSLATION_EN": "We know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00126",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "تم میرے پاس ہوتے ہو گو یا",
    "TITLE_EN": "You are with me, as if",
    "CONTENT": "تم میرے پاس ہوتے ہو گو یا\nجب کوئی دوسرا نہیں ہوتا\n\nیہ مسائل تصوف، یہ ترا بیان غالبؔ\nتجھے ہم ولی سمجھتے جو نہ بادہ خوار ہوتا\n\nہر ایک بات پہ کہتے ہو تم کہ تو کیا ہے\nتمھیں کہو کہ یہ انداز گفتگو کیا ہے\n\nنہ ستائش کی طلب نہ شکایت کی جا\nاب گلہ کس سے کریں، اب شکوہ کس سے کریں",
    "TRANSLATION_EN": "You are with me, as if\nWhen no one else is there\n\nThese issues of Sufism, this your expression, Ghalib\nWe would have considered you a saint if you were not a wine-drinker\n\nAt every matter you say, \"What are you?\"\nTell me, what is this style of conversation?\n\nNeither desire for praise nor place for complaint\nNow from whom should we complain, now to whom should we express grief?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00127",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "بازیچہ اطفال ہے دنیا مرے آگے",
    "TITLE_EN": "The world is a child's plaything before me",
    "CONTENT": "بازیچہ اطفال ہے دنیا مرے آگے\nہوتا ہے شب و روز تماشا مرے آگے\n\nاک کھیل ہے اور کھیلئے کھلونا ہے\nبچوں کا ہے دنیا ہے زمانہ مرے آگے\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "The world is a child's plaything before me\nNight and day, a spectacle occurs before me\n\nIt's a game, and play with toys\nThe world and time are children's play before me\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00128",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "یہ نہ تھی ہماری قسمت کہ وصال یار ہوتا",
    "TITLE_EN": "It was not our destiny to meet the beloved",
    "CONTENT": "یہ نہ تھی ہماری قسمت کہ وصال یار ہوتا\nاگر اور جیتے رہتے یہی انتظار ہوتا\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو",
    "TRANSLATION_EN": "It was not our destiny to meet the beloved\nIf we had lived longer, this waiting would have continued\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nLove has made me carefree\nWho would agree that life should not be lost?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00129",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "رہیے اب ایسی جگہ چل کر جہاں کوئی نہ ہو",
    "TITLE_EN": "Now go live in a place where no one exists",
    "CONTENT": "رہیے اب ایسی جگہ چل کر جہاں کوئی نہ ہو\nہم سخن کوئی نہ ہو اور سامان غم کوئی نہ ہو\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nدل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "Now go live in a place where no one exists\nWhere there is no companion, and no provision for grief\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nThe heart beats, remembrance comes\nThe soul desires to speak\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00130",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "لاغر اتنا ہوں کہ گر تو بزم میں جا دے مجھے",
    "TITLE_EN": "I am so weak that if you place me in the assembly",
    "CONTENT": "لاغر اتنا ہوں کہ گر تو بزم میں جا دے مجھے\nکوئی پوچھے کون ہے کہتے ہیں کہ غالبؔ کون ہے\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے",
    "TRANSLATION_EN": "I am so weak that if you place me in the assembly\nSomeone would ask, \"Who is he?\" They say, \"Who is Ghalib?\"\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00131",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "پریشاں ہو کے میری خاک آخر دل نہ بن جائے",
    "TITLE_EN": "May my scattered dust not become a heart in the end",
    "CONTENT": "پریشاں ہو کے میری خاک آخر دل نہ بن جائے\nیہ ہے دولت کہ اس گھر میں کبھی مہمان نہ آئے\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا",
    "TRANSLATION_EN": "May my scattered dust not become a heart in the end\nThis is wealth: that no guest ever came to this house\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00132",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہر اک مقام سے آگے گزر گیا مہ نو",
    "TITLE_EN": "The new moon passed beyond every station",
    "CONTENT": "ہر اک مقام سے آگے گزر گیا مہ نو\nنہ جانے کس لیے ہے اب تیرا انتظار\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا\n\nدل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "The new moon passed beyond every station\nI don't know why your waiting now continues\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home\n\nThe heart beats, remembrance comes\nThe soul desires to speak\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00133",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "درد سے میرا دامن بھرا تو نے کیا کیا",
    "TITLE_EN": "With pain, you filled my skirt—what did you not do?",
    "CONTENT": "درد سے میرا دامن بھرا تو نے کیا کیا\nہر الم کو دل میں بسا تو نے کیا کیا\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں",
    "TRANSLATION_EN": "With pain, you filled my skirt—what did you not do?\nYou settled every sorrow in my heart—what did you not do?\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00134",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "عجب نہیں کہ محبت کا خون ہو جائے",
    "TITLE_EN": "It would not be surprising if love's blood is shed",
    "CONTENT": "عجب نہیں کہ محبت کا خون ہو جائے\nہزار بار مجھے اس نے آہ بھی نہ دی\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو",
    "TRANSLATION_EN": "It would not be surprising if love's blood is shed\nA thousand times, she didn't even give me a sigh\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nLove has made me carefree\nWho would agree that life should not be lost?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00136",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے",
    "TITLE_EN": "Thousands of desires, each worth dying for",
    "CONTENT": "ہزاروں خواہشیں ایسی کہ ہر خواہش پہ دم نکلے\nبہت نکلے مرے ارمان لیکن پھر بھی کم نکلے\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے",
    "TRANSLATION_EN": "Thousands of desires, each worth dying for\nMany of my wishes were fulfilled, yet still fewer remain\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00137",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "کوئی امید بر نہیں آتی",
    "TITLE_EN": "No hope is fulfilled",
    "CONTENT": "کوئی امید بر نہیں آتی\nکوئی صورت نظر نہیں آتی\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا",
    "TRANSLATION_EN": "No hope is fulfilled\nNo possibility appears\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00138",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "برشکال گریۂ عاشق ہے دیکھا چاہیے",
    "TITLE_EN": "The lover's weeping is worth seeing",
    "CONTENT": "برشکال گریۂ عاشق ہے دیکھا چاہیے\nہے کہاں رونا کہاں رونا کہاں رونا کہاں\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا\n\nدل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے",
    "TRANSLATION_EN": "The lover's weeping is worth seeing\nWhere to weep, where to weep, where to weep, where?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home\n\nThe heart beats, remembrance comes\nThe soul desires to speak",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00139",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "تغافل دوست ہوں میرا دماغ عجز عالی ہے",
    "TITLE_EN": "I am the friend of indifference, my mind is exalted in humility",
    "CONTENT": "تغافل دوست ہوں میرا دماغ عجز عالی ہے\nمحبت میں بھی ہے مجھ کو نہایت امتیاز اب\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں",
    "TRANSLATION_EN": "I am the friend of indifference, my mind is exalted in humility\nEven in love, I now have extreme distinction\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00140",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "حاصل سے ہاتھ دھو بیٹھ اے آرزو خرامی",
    "TITLE_EN": "Wash your hands of gain, O misguided desire",
    "CONTENT": "حاصل سے ہاتھ دھو بیٹھ اے آرزو خرامی\nبے مہری یار ہے یا بے مہری یار ہے\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک",
    "TRANSLATION_EN": "Wash your hands of gain, O misguided desire\nIs it the beloved's indifference, or the beloved's indifference?\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00141",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "گرم فریاد رکھا شکل نہالی نے مجھے",
    "TITLE_EN": "The shape of nothingness kept my cry warm",
    "CONTENT": "گرم فریاد رکھا شکل نہالی نے مجھے\nشکل نہالی نے مجھے گرم فریاد رکھا\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا",
    "TRANSLATION_EN": "The shape of nothingness kept my cry warm\nThe shape of nothingness kept my cry warm\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00142",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "جو نہ نقد داغ دل کی کرے شعلہ پاسبانی",
    "TITLE_EN": "If the flame does not guard the ready money of the heart's scar",
    "CONTENT": "جو نہ نقد داغ دل کی کرے شعلہ پاسبانی\nنہیں آگے چراغاں کا وہ جلوہ نہیں جانی\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nدل دھڑکتا ہے یاد آتا ہے\nبات کرنے کو جی چاہتا ہے",
    "TRANSLATION_EN": "If the flame does not guard the ready money of the heart's scar\nThen that illumination of the lamp is not worth knowing\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nThe heart beats, remembrance comes\nThe soul desires to speak",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00143",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "روندی ہوئی ہے کوکبۂ شہریار کی",
    "TITLE_EN": "The star of the sovereign is being trampled",
    "CONTENT": "روندی ہوئی ہے کوکبۂ شہریار کی\nیا رب مرے لئے بھی کوئی بزم یار ہو\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا",
    "TRANSLATION_EN": "The star of the sovereign is being trampled\nO Lord, may there be for me too some assembly of the beloved\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00144",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "پھر ہوا وقت کہ ہو بال کشا موج شراب",
    "TITLE_EN": "Again the time has come when the wave of wine combs its tresses",
    "CONTENT": "پھر ہوا وقت کہ ہو بال کشا موج شراب\nدیکھنا تقریر کی لذت کہ جو اس نے کہا\n\nعشق نے کر دیا ہے بے پروا\nکون راضی کہ جاں نہ جانی ہو\n\nہم نے مانا کہ تغافل نہ کرو گے لیکن\nخاک ہو جائیں گے ہم تم کو خبر ہوتے تک\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا",
    "TRANSLATION_EN": "Again the time has come when the wave of wine combs its tresses\nSee the pleasure of speech—what she said!\n\nLove has made me carefree\nWho would agree that life should not be lost?\n\nWe accept that you will not ignore us, but\nWe will turn to dust before you even come to know\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00145",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "رحم کر ظالم کہ کیا بود چراغ کشتہ ہے",
    "TITLE_EN": "Have mercy, tyrant—what is this? The lamp is extinguished",
    "CONTENT": "رحم کر ظالم کہ کیا بود چراغ کشتہ ہے\nاب تو جل اٹھے گی شمع پروانہ کشتہ ہے\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nتم بھی جاؤ چمن کہاں جائے\nآپ ہی اپنا سایہ ہے گھر کا\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "Have mercy, tyrant—what is this? The lamp is extinguished\nNow the candle will flare up, though the moth is slain\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nYou too go to the garden—where else can you go?\nYour own shadow is your home\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00146",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "مہرباں ہو کے بلا لو مجھے چاہو جس وقت",
    "TITLE_EN": "Call me with kindness, whenever you wish",
    "CONTENT": "مہرباں ہو کے بلا لو مجھے چاہو جس وقت\nمیں نہیں طالب وصال کہ وقت پہ آؤں\n\nنہ تھا کچھ تو خدا تھا کچھ نہ ہوتا تو خدا ہوتا\nڈبویا مجھ کو ہونے نے نہ ہوتا میں تو کیا ہوتا\n\nرہی نہ طاقت گفتار اور اگر ہو بھی\nتو کس امید پہ کہیے کہ اعتبار نہیں\n\nکہتے ہیں کہ نکاح میں پڑھتے ہیں فاتحہ\nہے کچھ اور ہی مراد دل ناشاد کا",
    "TRANSLATION_EN": "Call me with kindness, whenever you wish\nI am not a seeker of union to come at a fixed time\n\nWhen nothing existed, then God existed; if God had not existed, what would have been?\nMy existence drowned me; if I had not existed, what would have been?\n\nNo strength remains for speech, and even if there were\nOn what hope could I speak? There is no trust\n\nThey say they recite the Fatiha at weddings\nBut the desire of the unhappy heart is something else entirely",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "ghalib_00151",
    "AUTHOR_ID": "ghalib",
    "TITLE_UR": "دیکھنا تقریر کی لذت کہ جو اس نے کہا",
    "TITLE_EN": "See the pleasure of speech—what she said!",
    "CONTENT": "دیکھنا تقریر کی لذت کہ جو اس نے کہا\nمیں نے یہ جانا کہ گویا یہی دل رکھتے ہیں\n\nکیا وہ نہیں کہ جس کا تم نے دعویٰ کیا تھا\nکیا اس میں شک کہ اس نے ہمیں بے وفا کیا تھا\n\nغم نہ کر یوں کہ دماغ رقیب دیوانہ ہو\nدیکھ لے تجھ کو جو ٹک آنکھ اٹھا کر دیکھے\n\nہم کو معلوم ہے جنت کی حقیقت لیکن\nدل کے خوش رکھنے کو غالبؔ یہ خیال اچھا ہے",
    "TRANSLATION_EN": "See the pleasure of speech—what she said!\nI realized that this is how hearts are kept\n\nIs it not that which you had claimed?\nIs there any doubt that He made us unfaithful?\n\nDon't grieve that your rival's mind may become mad\nLet him see you once if he raises his eyes to look\n\nWe know the reality of Paradise, but\nTo keep the heart happy, this thought is good, Ghalib",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  }
]