[
  {
    "TEXT_ID": "iqbal_00001",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ترے عشق کی انتہا چاہتا ہوں",
    "TITLE_EN": "I seek the limit of Your love",
    "CONTENT": "ترے عشق کی انتہا چاہتا ہوں\nمری سادگی دیکھ کیا چاہتا ہوں\n\nستم ہو کہ ہو وعدۂ بے حجابی\nکوئی بات صبر آزما چاہتا ہوں\n\nیہ جنت مبارک رہے زاہدوں کو\nکہ میں آپ کا سامنا چاہتا ہوں\n\nذرا سا تو دل ہوں مگر شوخ اتنا\nوہی لن ترانی سنا چاہتا ہوں\n\nکوئی دم کا مہماں ہوں اے اہل محفل\nچراغ سحر ہوں بجھا چاہتا ہوں\n\nبھری بزم میں راز کی بات کہہ دی\nبڑا بے ادب ہوں سزا چاہتا ہوں",
    "TRANSLATION_EN": "I seek the limit of Your love\nSee my simplicity, what I seek\n\nWhether tyranny or the promise of unveiled meeting\nI seek something that tests patience\n\nMay this paradise remain for the ascetics\nFor I seek to face You alone\n\nI am but a small heart, yet so audacious\nI seek to hear that very \"You shall not see Me\"\n\nI am a guest of but a moment, O people of the assembly\nI am the dawn's lamp, I seek to be extinguished\n\nI revealed the secret in the crowded gathering\nI am very impertinent, I seek punishment",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00002",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "مجنوں نے شہر چھوڑا تو صحرا بھی چھوڑ دے",
    "TITLE_EN": "When Majnun left the city, he should leave the desert too",
    "CONTENT": "مجنوں نے شہر چھوڑا تو صحرا بھی چھوڑ دے\nنظارے کی ہوس ہو تو لیلیٰ بھی چھوڑ دے\n\nواعظ کمال ترک سے ملتی ہے یاں مراد\nدنیا جو چھوڑ دی ہے تو عقبیٰ بھی چھوڑ دے\n\nتقلید کی روش سے تو بہتر ہے خودکشی\nرستہ بھی ڈھونڈ خضر کا سودا بھی چھوڑ دے\n\nمانند خامہ تیری زباں پر ہے حرف غیر\nبیگانہ شے پہ نازش بے جا بھی چھوڑ دے\n\nلطف کلام کیا جو نہ ہو دل میں درد عشق\nبسمل نہیں ہے تو تو تڑپنا بھی چھوڑ دے\n\nشبنم کی طرح پھولوں پہ رو اور چمن سے چل\nاس باغ میں قیام کا سودا بھی چھوڑ دے\n\nہے عاشقی میں رسم الگ سب سے بیٹھنا\nبت خانہ بھی حرم بھی کلیسا بھی چھوڑ دے\n\nسوداگری نہیں یہ عبادت خدا کی ہے\nاے بے خبر جزا کی تمنا بھی چھوڑ دے\n\nاچھا ہے دل کے ساتھ رہے پاسبان عقل\nلیکن کبھی کبھی اسے تنہا بھی چھوڑ دے\n\nجینا وہ کیا جو ہو نفس غیر پر مدار\nشہرت کی زندگی کا بھروسا بھی چھوڑ دے\n\nشوخی سی ہے سوال مکرر میں اے کلیم\nشرط رضا یہ ہے کہ تقاضا بھی چھوڑ دے\n\nواعظ ثبوت لائے جو مے کے جواز میں\nاقبالؔ کو یہ ضد ہے کہ پینا بھی چھوڑ دے",
    "TRANSLATION_EN": "When Majnun left the city, he should leave the desert too\nIf you desire the spectacle, leave Laila too\n\nO preacher, the goal is attained through complete renunciation\nIf you have left the world, leave the afterlife too\n\nBetter than imitation is suicide\nFind the path, but leave the desire for Khizr too\n\nLike the pen, your tongue bears another's words\nLeave this misplaced pride in foreign things too\n\nWhat pleasure in words without the pain of love in the heart?\nIf you are not a sacrificial bird, leave the yearning too\n\nLike dew, weep on flowers and then leave the garden\nGive up the desire to stay in this garden too\n\nIn love, the custom is to sit apart from all\nLeave the temple, the sanctuary, the church too\n\nThis is not commerce, it is worship of God\nO unaware one, leave the desire for reward too\n\nIt is good that reason guards the heart\nBut sometimes leave it alone too\n\nWhat life is it that depends on another's breath?\nLeave the reliance on fame's life too\n\nThere is a certain audacity in repeated questioning, O Kalim\nThe condition of acceptance is that you leave the demand too\n\nIf the preacher brings proof for the justification of wine\nIqbal is determined to leave even drinking too",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00003",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "گيسوئے تابدار کو اور بھی تابدار کر",
    "TITLE_EN": "Make the radiant tresses even more radiant",
    "CONTENT": "گيسوئے تابدار کو اور بھی تابدار کر\nشعلہ فشاں ہے تیرا حسن، ذرا خمار کر\n\nزندگی تیرے جمال سے ہو جمال آشنا\nتیری نگاہِ التفات کوئی تو شرمسار کر\n\nاٹھا عمیق شب سے اے مہرِ آسماں نشیں\nاپنی تجلیوں سے اس انجم شعار کر\n\nتُو نے دیا ہے عشق تو عشق کا ثبوت دے\nپنہاں ہے تیرا جلوہ، جلوہ آشکار کر\n\nتجھ کو خبر نہیں ہے مرے دل کی بے کلی\nمیری نواے بے اثر کوئی تو اپنی خار کر",
    "TRANSLATION_EN": "Make the radiant tresses even more radiant\nYour beauty is flame-scattering, make it a little intoxicated\n\nMay life become acquainted with beauty through Your beauty\nLet Your glance of favor make someone feel ashamed\n\nRise from the depths of night, O sun of the sky's throne\nWith Your radiances, make this star-adorned one radiant\n\nYou have given love, now give proof of love\nYour manifestation is hidden, make the manifestation manifest\n\nYou do not know the restlessness of my heart\nMy ineffective song—make it Your own thorn (worth)",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00004",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کبھی اے حقیقتِ منتظر نظر آ لباسِ مجاز میں",
    "TITLE_EN": "O awaited reality, appear someday in the garb of metaphor",
    "CONTENT": "کبھی اے حقیقتِ منتظر نظر آ لباسِ مجاز میں\nکہ ہزاروں سجدے تڑپ رہے ہیں مری جبینِ نیاز میں\n\nطمع خام ہے یہ کہ طلب کریں ثمرِ نظر کا خریدار\nخرد نے مجھ کو نہ دیا کبھی کوئی مشتري راز و نیاز میں\n\nمرے دل کو ہے تری آرزو مرے نالے میں ہے تری جستجو\nمری سادگی پہ رہے فدا ترا بے نیازی و ناز میں\n\nمہیائے شوخیٔ راز ہے فغاں مرے دلِ بے نواسے\nکہ نہ تھا کوئی ترے چمن میں مرا ہمسخن پرواز میں\n\nنہ سمجھ کے لطف مقامِ دل سے خوشی و غم کی تگ و تاز\nکہ ازل سے دل کو ہے خوگری ادائے صوفی و تاز میں",
    "TRANSLATION_EN": "O awaited reality, appear someday in the garb of metaphor\nFor thousands of prostrations tremble on my forehead of supplication\n\nIt is a vain hope to seek a buyer for the fruit of vision\nReason never gave me any customer in the realm of secrets and needs\n\nMy heart desires You, my lament seeks You\nMay Your indifference and grace be sacrificed on my simplicity\n\nThe cry of my helpless heart is ready for the audacity of secrets\nFor there was none in Your garden to converse with me in flight\n\nDo not consider the pleasure of the heart's station from the pursuit of joy and grief\nFor from eternity, the heart is accustomed to the styles of the Sufi and the fresh",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00005",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "اپنی جولاں گاہ سے باہر نکل",
    "TITLE_EN": "Come out of your arena of movement",
    "CONTENT": "اپنی جولاں گاہ سے باہر نکل\nیا زمیں پیدا کر، یا آسماں پیدا کر\n\nتو بھی کیا مجبور ہے اے بادباں\nاس قدر بے تاب ہے تیرا رواں\n\nڈھونڈ اس دورِ جہاں میں اے کلیم\nکوئی بے خانماں کا آسماں\n\nکس قدر بے تاب ہے تیرا رواں\nکس قدر بے تاب ہے تیرا رواں\n\nاپنی جولاں گاہ سے باہر نکل\nیا زمیں پیدا کر، یا آسماں پیدا کر",
    "TRANSLATION_EN": "Come out of your arena of movement\nEither create an earth, or create a sky\n\nHow helpless you are too, O wind\nSo restless is your flow\n\nSearch in this world's era, O Kalim\nFor some sky of the homeless\n\nHow restless is your flow\nHow restless is your flow\n\nCome out of your arena of movement\nEither create an earth, or create a sky",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00006",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "لعلِ صحرا کو نہ سمجھو کہ فقط رنگ ہے",
    "TITLE_EN": "Do not think the desert ruby is merely color",
    "CONTENT": "لعلِ صحرا کو نہ سمجھو کہ فقط رنگ ہے\nیہ وہ گوہر ہے کہ جس کا نفسِ سنگ ہے\n\nدرد ہے جوہرِ انسانی، نہ کم از گہر\nاے غفلتِ خرد، تیری جہاں سی رنگ ہے\n\nشکوۂ ظلمتِ شب سے نہ گریزاں ہوائیں\nآگہی تیرا مقدر ہے، نہ اندیشہ و بیم\n\nمردِ مومن کو ہے اندیشۂ فردا سے نجات\nحیدری فقر ہے، نعرۂ تکبیر تری",
    "TRANSLATION_EN": "Do not think the desert ruby is merely color\nIt is that gem whose very essence is stone\n\nPain is the essence of humanity, not less than a jewel\nO negligence of intellect, your world is mere color\n\nThe winds do not flee from complaining of the night's darkness\nAwareness is your destiny, not anxiety and fear\n\nThe man of faith is free from anxiety about tomorrow\nHe has the poverty of Haider, your cry of Allahu Akbar",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00007",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عقل و دل کو نہ سمجھو کہ فقط نام ہے",
    "TITLE_EN": "Do not think intellect and heart are merely names",
    "CONTENT": "عقل و دل کو نہ سمجھو کہ فقط نام ہے\nعشق ہے اصل حیات، عقل ہے اس کا نقاب\n\nدل سے جو بات نکلتی ہے اثر رکھتی ہے\nپر نہیں، طاقت پرواز مگر رکھتی ہے\n\nعشق ہے وہ بحر بیکراں جس کا کوئی کنار نہیں\nعقل ہے وہ ناخدا کہ جسے اس بحر کا خبر نہیں\n\nجہاں میں اہلِ یقین کو نصیب ہوتی ہے\nوہ کامیابی جو اصحابِ فکر کو نہیں ملتی\n\nاقبالؔ کا پیغام ہے، سن لو اے جہاں والو\nکہ زندگی ہے عمل سے، نہ آرزو سے، نہ خیال سے",
    "TRANSLATION_EN": "Do not think intellect and heart are merely names\nLove is the essence of life, intellect is its veil\n\nWhatever emerges from the heart has effect\nThough it lacks the power of flight, yet it possesses something\n\nLove is that limitless ocean with no shore\nIntellect is that captain unaware of this ocean\n\nIn the world, the people of certainty attain\nThat success which the people of thought do not get\n\nThis is Iqbal's message, listen O people of the world\nThat life is through action, not through desire, not through thought",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00008",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "مسلماں کو مسلماں کر دیا طوفانِ مغرب نے",
    "TITLE_EN": "The storm of the West made the Muslim into a Muslim",
    "CONTENT": "مسلماں کو مسلماں کر دیا طوفانِ مغرب نے\nتلاطم ہائے دریا ہی سے ہے گوہر کی سیرابی\n\nعطا مومن کو پھر درگاہِ حق سے ہونے والا ہے\nشکوہِ ترکمانی، ذہنِ ہندی، نطقِ اعرابی\n\nوہ چشمِ پاک بیں کیوں زینتِ برگستواں دیکھے\nنظر آتی ہے جس کو مردِ غازی کی جگر تابی\n\nیہی مقصودِ فطرت ہے، یہی رمزِ مسلمانی\nاخوت کی جہاں گیری، محبت کی فراوانی",
    "TRANSLATION_EN": "The storm of the West made the Muslim into a Muslim\nIt is from the turbulence of the sea that the pearl gains lustre\n\nThe believer will again receive from the court of Truth\nThe complaint of the Turkoman, the mind of the Hindu, the speech of the Arab\n\nWhy should that pure-sighted eye look at the decoration of the shoulder-cloth\nWhich beholds the courage of the warrior's heart?\n\nThis is the purpose of nature, this is the secret of being Muslim\nWorld-dominion of brotherhood, abundance of love",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00009",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "دل سے جو بات نکلتی ہے اثر رکھتی ہے",
    "TITLE_EN": "Whatever emerges from the heart has effect",
    "CONTENT": "دل سے جو بات نکلتی ہے اثر رکھتی ہے\nپر نہیں، طاقت پرواز مگر رکھتی ہے\n\nقید مقام سے آزاد ہو سکتا ہے جنوں\nاور یہ وحشتِ سودا کدۂ سر رکھتی ہے\n\nعشق ہے ایک حقیقت مگر اس کے لیے\nدل کی بیخودی اور نظر کا سفر رکھتی ہے\n\nمومن کی ضمیر و بصیرت ہے یہی بات\nکہ وہ مردِ خدا راہِ نظر رکھتی ہے\n\nتو نے کیا جانا سودائے سرِ زلفِ حبیب\nکوئی اس شوق کو سودائے دگر رکھتی ہے",
    "TRANSLATION_EN": "Whatever emerges from the heart has effect\nThough it lacks the power of flight, yet it possesses something\n\nPassion can become free from confinement of place\nAnd this wildness of desire keeps the head spinning\n\nLove is a reality, but for it\nThe heart's self-annihilation and the journey of vision are needed\n\nThis is the conscience and insight of the believer\nThat the man of God possesses the path of vision\n\nWhat do you know of the passion for the beloved's tresses?\nThis longing possesses a different kind of passion",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00010",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کبھی اے نوجواں مسلم تدبّر بھی کیا اس نے",
    "TITLE_EN": "O young Muslim, did he ever contemplate",
    "CONTENT": "کبھی اے نوجواں مسلم تدبّر بھی کیا اس نے\nوہی کہ جس نے دنیا کو مسلماں بنایا تھا\n\nترا ایمان تیرے دل کی دیوارِ حرم ہے\nاسے گر بے حرم کر دیں تو کافر ہو گیا کیا تھا\n\nسمجھتا ہے کہ مسلمان ہے فقط اللہ کا بندہ\nنہیں اس کو خبر کیا شانِ مسلم نے دکھایا تھا\n\nوہی ہر دور میں ہیں پیدا، وہی ہر صدی میں ہیں\nنئے انداز میں جس نے خدا کا جلوہ دکھایا تھا\n\nوہی سلطان ہے دنیا میں جسے فن کی ضرورت ہے\nوہی محتاج ہے جو صرف دنیا کو بنایا تھا",
    "TRANSLATION_EN": "O young Muslim, did he ever contemplate\nHe who made the world Muslim?\n\nYour faith is the wall of the sanctuary of your heart\nIf they desecrate it, what becomes of you then?\n\nHe thinks the Muslim is merely God's servant\nHe does not know what glory the Muslim has shown\n\nThey appear in every age, they exist in every century\nHe who showed God's manifestation in new ways\n\nHe is the sovereign in the world who needs art\nHe is the needy one who created only the world",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00011",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "محبت ایک حقیقت ہے اس میں شک نہیں",
    "TITLE_EN": "Love is a reality, there is no doubt in it",
    "CONTENT": "محبت ایک حقیقت ہے اس میں شک نہیں\nمگر وہ عشق نہیں جو فقط کہانی ہو\n\nوہ عشق ہے کہ جس میں خودی کا فنا ہونا\nازل سے ہے مقدر، نہ وقت کی نشانی ہو\n\nزمیں کی پابندیاں ہیں، زمانے کی قیدیں\nوہ عشق ہو کہ جسے قید کا پتہ کیا ہو\n\nوہ مردِ مومن وہ آزاد مرد ہوتا ہے\nجسے خدا کے سوا کسی کا بھی خوف نہ ہو\n\nبہت ہے علم مگر اس میں زندگی نہیں\nوہ علم ہے کہ جس میں عمل کی روانی ہو",
    "TRANSLATION_EN": "Love is a reality, there is no doubt in it\nBut that is not love which is merely a tale\n\nThat is love in which the self is annihilated\nIt is destined from eternity, not a sign of time\n\nThere are earth's bondages, time's prisons\nThat love should know no confinement\n\nHe is the man of faith, that free man\nWho fears none except God\n\nKnowledge is plentiful but has no life\nThat is knowledge in which action flows",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00012",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عمل سے زندگی بنتی ہے جنت بھی جہنم بھی",
    "TITLE_EN": "From action, life is made—both heaven and hell",
    "CONTENT": "عمل سے زندگی بنتی ہے جنت بھی جہنم بھی\nیہ خاکی اپنی فطرت میں نہ نوری ہے نہ ناری ہے\n\nمسلماں کو مسلماں کر دیا طوفانِ مغرب نے\nتلاطم ہائے دریا ہی سے ہے گوہر کی سیرابی\n\nعطا مومن کو پھر درگاہِ حق سے ہونے والا ہے\nشکوہِ ترکمانی، ذہنِ ہندی، نطقِ اعرابی\n\nوہ چشمِ پاک بیں کیوں زینتِ برگستواں دیکھے\nنظر آتی ہے جس کو مردِ غازی کی جگر تابی",
    "TRANSLATION_EN": "From action, life is made—both heaven and hell\nThis earthly being is in its nature neither light nor fire\n\nThe storm of the West made the Muslim into a Muslim\nIt is from the turbulence of the sea that the pearl gains lustre\n\nThe believer will again receive from the court of Truth\nThe complaint of the Turkoman, the mind of the Hindu, the speech of the Arab\n\nWhy should that pure-sighted eye look at the decoration of the shoulder-cloth\nWhich beholds the courage of the warrior's heart?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00013",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بُتانِ رنگ و خوں کو توڑ کر ملت میں گم ہو جا",
    "TITLE_EN": "Break the idols of color and blood, become lost in the nation",
    "CONTENT": "بُتانِ رنگ و خوں کو توڑ کر ملت میں گم ہو جا\nنہ تُورانی رہے باقی، نہ ایرانی نہ افغانی\n\nمیانِ شاخساراں صحبتِ مرغِ چمن کب تک\nترے بازو میں ہے پروازِ شاہینِ قہستانی\n\nگمان آبادِ ہستی میں یقیں مردِ مسلماں کا\nبیاباں کی شبِ تاریک میں قندیلِ رہبانی\n\nمٹایا قیصر و کسریٰ کے استبداد کو جس نے\nوہ کیا تھا، زورِ حیدر، فقرِ بوذر، صدقِ سلمانی\n\nہوئے احرارِ ملت جادہ پیما کس تجمل سے\nتماشائی شگافِ در سے ہیں صدیوں کے زندانی",
    "TRANSLATION_EN": "Break the idols of color and blood, become lost in the nation\nLet no Turanian remain, no Iranian, no Afghan\n\nHow long this companionship with garden birds among the branches?\nIn your arm is the flight of the mountain falcon\n\nIn the imagined habitation of existence, the Muslim's certainty\nIs the monastic lamp in the dark night of the desert\n\nHe who destroyed the tyranny of Caesar and Chosroes\nThat was the power of Haider, the poverty of Bu Zar, the truth of Salman\n\nWith what pomp did the free men of the nation tread the path?\nThe prisoners of centuries watch through the crack in the door",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00014",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ثباتِ زندگی ایمانِ محکم سے ہے دنیا میں",
    "TITLE_EN": "The stability of life in the world is through firm faith",
    "CONTENT": "ثباتِ زندگی ایمانِ محکم سے ہے دنیا میں\nکہ المانی سے بھی پائندہ تر نکلا ہے تُورانی\n\nجب اس انگارۂ خاکی میں ہوتا ہے یقیں پیدا\nتو کر لیتا ہے یہ بال و پرِ روح الامیں پیدا\n\nغلامی میں نہ کام آتی ہیں شمشیریں نہ تدبیریں\nجو ہو ذوقِ یقیں پیدا تو کٹ جاتی ہیں زنجیریں\n\nکوئی اندازہ کر سکتا ہے اس کے زور بازو کا\nنگاہِ مردِ مومن سے بدل جاتی ہیں تقدیریں\n\nولایت، پادشاہی، علمِ اشیا کی جہاں گیری\nیہ سب کیا ہیں، فقط اک نکتۂ ایماں کی تفسیریں",
    "TRANSLATION_EN": "The stability of life in the world is through firm faith\nFor the Turanian has proven more lasting than the German\n\nWhen certainty arises in this ember of clay\nIt then creates the wings of the Spirit of the Faithful\n\nIn slavery, swords avail not, nor strategies\nWhen the desire for certainty arises, chains are cut\n\nWho can estimate the power of his arm?\nDestinies change with the glance of the man of faith\n\nSainthood, kingship, world-dominion through knowledge of things\nWhat are all these? Merely interpretations of a point of faith",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00015",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "براہیمی نظر پیدا مگر مشکل سے ہوتی ہے",
    "TITLE_EN": "The vision of Abraham is born, but with difficulty",
    "CONTENT": "براہیمی نظر پیدا مگر مشکل سے ہوتی ہے\nہوس چھپ چھپ کے سینوں میں بنا لیتی ہے تصویریں\n\nتمیزِ بندہ و آقا فسادِ آدمیت ہے\nحذر اے چیرہ دستاں! سخت ہیں فطرت کی تعزیریں\n\nحقیقت ایک ہے ہر شے کی، خاکی ہو کہ نوری ہو\nلہو خورشید کا ٹپکے اگر ذرے کا دل چیریں\n\nیقیں محکم، عمل پیہم، محبت فاتحِ عالم\nجہادِ زندگانی میں ہیں یہ مردوں کی شمشیریں",
    "TRANSLATION_EN": "The vision of Abraham is born, but with difficulty\nDesire, hiding in hearts, creates images\n\nThe distinction of servant and master is the corruption of humanity\nBeware O plunderers! Nature's punishments are severe\n\nReality is one for every thing, whether earthly or luminous\nThe sun's blood would drip if you split the heart of an atom\n\nFirm certainty, continuous action, love conquering the world\nIn the struggle of life, these are the swords of men",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00016",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "دلیلِ صبحِ روشن ہے ستاروں کی تنک تابی",
    "TITLE_EN": "The proof of the bright dawn is the faint light of stars",
    "CONTENT": "دلیلِ صبحِ روشن ہے ستاروں کی تنک تابی\nافق سے آفتاب اُبھرا، گیا دورِ گراں خوابی\n\nعروقِ مردۂ مشرق میں خوںِ زندگی دوڑا\nسمجھ سکتے نہیں اس راز کو سینا و فارابی\n\nاثر کچھ خواب کا غنچوں میں باقی ہے تو اے بلبل\nنوا را تلخ تر می زن چو ذوقِ نغمہ کم یابی\n\nتڑپ صحنِ چمن میں، آشیاں میں، شاخساروں میں\nجدا پارے سے ہو سکتی نہیں تقدیرِ سیمابی\n\nوہ چشمِ پاک بیں کیوں زینتِ برگستواں دیکھے\nنظر آتی ہے جس کو مردِ غازی کی جگر تابی",
    "TRANSLATION_EN": "The proof of the bright dawn is the faint light of stars\nThe sun has risen from the horizon, the age of heavy sleep is gone\n\nThe blood of life runs in the dead veins of the East\nSina and Farabi cannot understand this secret\n\nIf some effect of dream remains in buds, O bulbul\nSing your song more bitter when you find less joy in melody\n\nTremble in the garden courtyard, in the nest, among the branches\nThe destiny of quicksilver cannot be separated from mercury\n\nWhy should that pure-sighted eye look at the decoration of the shoulder-cloth\nWhich beholds the courage of the warrior's heart?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00017",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بڑا بے درد ہے یہ دورِ نو، یاں عشق کا چرچا",
    "TITLE_EN": "This new age is very heartless, here the talk of love",
    "CONTENT": "بڑا بے درد ہے یہ دورِ نو، یاں عشق کا چرچا\nنہ بلبل کو خبر ہے نہ کلی کو نغمہ ہے نہ صدا ہے\n\nجہاں میں عشق کی جلوہ گری ہوتی نہیں اب\nکہ ہر دل میں بجھی شمعِ محبت، کہیں بھی نہ ہوا ہے\n\nوہ بھی دن تھے کہ مسجد میں تڑپتے تھے نمازی\nاب تو مسجد میں فقط خاک اڑاتی ہے ہوا ہے\n\nنہیں اس دور میں پیدا کوئی مردِ مسلماں\nکہ اس کی نگہ سے بدل جائے زمانے کی فضا ہے\n\nمگر امید ہے پھر اٹھے گا کوئی صاحبِ دل\nکہ جس کی صدا سے بہار آئے گی، خزاں جائے گی",
    "TRANSLATION_EN": "This new age is very heartless, here the talk of love\nNeither the bulbul knows, nor the bud has song or sound\n\nIn the world, the manifestation of love no longer occurs\nFor in every heart the lamp of love is extinguished, nowhere is it lit\n\nThose were days when worshippers trembled in the mosque\nNow in the mosque, only dust is scattered by the wind\n\nIn this age, no man of faith is born\nWhose glance could change the atmosphere of the age\n\nBut hope remains that someone with heart will arise\nFrom whose call spring will come, autumn will go",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00018",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "حُسنِ عجم سے کہہ دے کہ اپنی بہار چھوڑے",
    "TITLE_EN": "Tell the beauty of Persia to abandon its spring",
    "CONTENT": "حُسنِ عجم سے کہہ دے کہ اپنی بہار چھوڑے\nہم کو ہمارے لالہ و گل سے خمار چھوڑے\n\nآج اک مسافر امید لئے پھرتا ہے\nدھوپ میں جلتے صحرا کا سفر چھوڑے\n\nایک مسلمان مردہ دل ہے، اسے کیا خبر\nکہ عشق کی گزرگاہوں کا گزر چھوڑے\n\nاب وہ نغمہ کہاں، وہ ترنم کہاں\nہر دل میں ہے سسکی، ہر آنکھ میں ہے نمی\n\nتو شاہیں ہے پرواز ہے کام تیرا\nترے سامنے آسماں اور بھی ہیں",
    "TRANSLATION_EN": "Tell the beauty of Persia to abandon its spring\nLeave us with the intoxication of our tulip and rose\n\nToday a traveler wanders with hope\nLeave the journey through the sun-scorched desert\n\nA Muslim is dead-hearted, what does he know\nOf passing through the passages of love?\n\nWhere is that song now, where is that melody?\nIn every heart is a sob, in every eye is moisture\n\nYou are a falcon, flight is your destiny\nBefore you lie more skies",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00019",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عشق ہے وہ بحر بیکراں جس کا کوئی کنار نہیں",
    "TITLE_EN": "Love is that limitless ocean with no shore",
    "CONTENT": "عشق ہے وہ بحر بیکراں جس کا کوئی کنار نہیں\nعقل ہے وہ ناخدا کہ جسے اس بحر کا خبر نہیں\n\nاپنے دل کی بات کسی سے کہہ نہ سکا\nہم کو اپنی خبر کسی سے کہہ نہ سکا\n\nدل میں ہے آرزو کہ جس طرح بھی ہو\nہم بھی کسی کے کام آئیں کسی کی آنکھوں میں سمائیں\n\nنہیں ہے ناامید اقبالؔ اپنی کشتِ ویراں سے\nذرا نم ہو تو یہ مٹی بہت زرخیز ہے",
    "TRANSLATION_EN": "Love is that limitless ocean with no shore\nIntellect is that captain unaware of this ocean\n\nI could not tell anyone my heart's matter\nI could not tell anyone my own condition\n\nThere is desire in the heart that somehow\nWe too may be of use to someone, merge into someone's eyes\n\nIqbal is not hopeless of his desolate cultivation\nIf it gets a little moisture, this soil is very fertile",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00042",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کھودیں نگاہِ شوق نے درِ حرم کی دیوار",
    "TITLE_EN": "The gaze of longing excavated the wall of the sanctuary",
    "CONTENT": "کھودیں نگاہِ شوق نے درِ حرم کی دیوار\nنکل کے آئے صنم خانے سے سینہ و زنار\n\nمسلماں کی نگہ ہوتی ہے جو صاحبِ دل کی\nبدل دیتی ہے تقدیریں، بدل دیتی ہے مقدر\n\nوہ وقت ہے کہ نہ شیخ و برہمن کی پہچان\nوہ دور ہے کہ نہ مسجد، نہ بتکدے کا خیال\n\nکبھی سمٹ کر اک دل میں اترتا ہے وہ نور\nکبھی افق پہ چمکتا ہے کرن بن کر\n\nاقبالؔ کا پیغام ہے، سن لو اے جہاں والو\nکہ زندگی ہے عمل سے، نہ آرزو سے، نہ خیال سے",
    "TRANSLATION_EN": "The gaze of longing excavated the wall of the sanctuary\nThe breast and sacred thread emerged from the temple\n\nThe Muslim's gaze, when it belongs to the possessor of heart\nChanges destinies, changes fate\n\nThat is the time when neither sheikh nor brahmin is recognized\nThat is the age when neither mosque nor temple is conceived\n\nSometimes that light descends, condensed into one heart\nSometimes it shines on the horizon as a ray\n\nThis is Iqbal's message, listen O people of the world\nThat life is through action, not through desire, not through thought",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00043",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "یہ پیام دے گیا ہے مجھے آج صبحِ نو",
    "TITLE_EN": "The new dawn has given me this message today",
    "CONTENT": "یہ پیام دے گیا ہے مجھے آج صبحِ نو\nکہ نہ ہو گریز پائیں کبھی مردِ خود نگر\n\nوہی زندگی ہے جس میں ہو خودی کی پرورش\nوہی موت ہے کہ جس میں ہو خودی کا سفر\n\nسمجھتا ہے زمانہ کہ محبت ہے آرزو\nنہیں جانتا کہ محبت ہے جاں کا خطر\n\nوہی عشق ہے کہ جس میں ہو جاں کی بازی\nوہی عشق ہے کہ جس میں نہ ہو جاں کا ڈر\n\nاقبالؔ کی خودی ہے اسرارِ کائنات\nجسے مل گئی خودی، اسے ملا سارا جہاں",
    "TRANSLATION_EN": "The new dawn has given me this message today\nThat the self-observant man should never flee\n\nThat is life in which the self is nurtured\nThat is death in which the self journeys\n\nThe world thinks love is desire\nIt does not know that love is life's danger\n\nThat is love in which life is staked\nThat is love in which there is no fear for life\n\nIqbal's selfhood is the secret of the universe\nWhoever attains selfhood, attains the whole world",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00044",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "غریب شہر ہوں میں، سن تو لے میری فریاد",
    "TITLE_EN": "I am a stranger in the city, do listen to my cry",
    "CONTENT": "غریب شہر ہوں میں، سن تو لے میری فریاد\nکہ تیرے سینے میں بھی ہیں قیامتیں آباد\n\nمری نوائے غم آلود ہے متاع عزیز\nجہاں میں عام نہیں دولت دل ناشاد\n\nگلہ ہے مجھ کو زمانے کی کور ذوقی سے\nسمجھتا ہے مری محنت کو محنت فرہاد\n\nصدائے تیشہ کہ بر سنگ می خورد دگر است\nخبر بگیر کہ آواز تیشہ و جگر است\n\nیہی ہے زندگی مردِ مسلماں کی شان\nکہ اس کی ہستی ہے اللہ کی امانت",
    "TRANSLATION_EN": "I am a stranger in the city, do listen to my cry\nThat in your breast too, wonders reside\n\nMy sorrow-laden song is a precious possession\nIn the world, the wealth of a sad heart is not common\n\nI complain of the age's blind taste\nIt thinks my labor is the labor of Farhad\n\nThe sound of the axe striking stone is different\nKnow that the sound of the axe and the heart is the same\n\nThis is the life, the glory of the Muslim man\nThat his existence is a trust from Allah",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00045",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "خود آگاہی نے سکھلا دی ہے جس کو تن فراموشی",
    "TITLE_EN": "Self-awareness has taught self-forgetfulness to whom",
    "CONTENT": "خود آگاہی نے سکھلا دی ہے جس کو تن فراموشی\nحرام آئی ہے اس مرد مجاہد پر زرہ پوشی\n\nجسے آتا ہو فنِ بے نیازی، وہ قلندر ہے\nاسی کے نام سے آباد ہے یہ دنیائے دل فروشی\n\nوہی مردِ مسلماں ہے کہ جو اللہ کا بندہ\nنہیں جس کو کسی غیر کی حاجت، نہ کسی کی خوشی\n\nسمجھتا ہے زمانہ کہ اقبالؔ ہے شاعر\nنہیں جانتا کہ اقبالؔ ہے مردِ قلندر",
    "TRANSLATION_EN": "Self-awareness has taught self-forgetfulness to whom\nArmor-wearing is forbidden for that warrior\n\nHe who knows the art of independence, he is a dervish\nBy his name lives this world of heart-selling\n\nHe is the Muslim man who is God's servant\nWho needs none other, desires none other's pleasure\n\nThe age thinks Iqbal is a poet\nIt does not know that Iqbal is a dervish",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00046",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "حاجت نہیں اے خطہ گل شرح و بیاں کی",
    "TITLE_EN": "O region of flowers, there is no need for explanation and description",
    "CONTENT": "حاجت نہیں اے خطہ گل شرح و بیاں کی\nتصویر ہمارے دل پر خوں کی ہے لالہ\n\nتقدیر ہے اک نام مکافات عمل کا\nدیتے ہیں یہ پیغام خدایان ہمالہ\n\nسرمہ کی ہواؤں میں ہے عریاں بدن اس کا\nدیتا ہے ہنر جس کا امیروں کو دو شالہ\n\nامید نہ رکھ دولت دنیا سے وفا کی\nرم اس کی طبیعت میں ہے مانند غزالہ\n\nاقبالؔ کی فریاد ہے، سن لے اے زمانہ\nکہ مسلم کی پہچان ہے اللہ کا ماننا",
    "TRANSLATION_EN": "O region of flowers, there is no need for explanation and description\nThe image on our heart is a tulip of blood\n\nDestiny is but a name for the recompense of action\nThis message the gods of the Himalayas give\n\nIn the winds of Surma, his body is naked\nHe whose skill gives two shawls to the rich\n\nDo not hope for fidelity from the wealth of the world\nIts nature runs like the gazelle\n\nThis is Iqbal's cry, listen O age\nThat the Muslim's identity is acknowledging Allah",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00047",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ضمیر مغرب ہے تاجرانہ، ضمیر مشرق ہے راہبانہ",
    "TITLE_EN": "The conscience of the West is mercantile, the conscience of the East is monastic",
    "CONTENT": "ضمیر مغرب ہے تاجرانہ، ضمیر مشرق ہے راہبانہ\nوہاں دگرگوں ہے لحظہ لحظہ، یہاں بدلتا نہیں زمانہ\n\nکنار دریا خضر نے مجھ سے کہا بہ انداز محرمانہ\nسکندری ہو، قلندری ہو، یہ سب طریقے ہیں ساحرانہ\n\nحریف اپنا سمجھ رہے ہیں مجھے خدایان خانقاہی\nنہیں یہ ڈر ہے کہ میرے نالوں سے شق نہ ہو سنگ آستانہ\n\nغلام قوموں کے علم و عرفاں کی ہے یہی رمز آشکارا\nزمیں اگر چاہے آسماں کو تو توڑ ڈالے یہ بندشِ خانہ",
    "TRANSLATION_EN": "The conscience of the West is mercantile, the conscience of the East is monastic\nThere, moment by moment it changes; here, time does not change\n\nOn the riverbank, Khizar said to me in confidential tone\n\"Be Alexandrian, be dervish-like—these are all magical ways\"\n\nThe lords of the monastery think me their rival\nI have no fear that my lament might split the stone of their threshold\n\nThis is the manifest secret of the knowledge and wisdom of enslaved nations\nIf earth desires the sky, it can break this house's confinement",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00048",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "آن عزم بلند آور آن سوز جگر آور",
    "TITLE_EN": "Bring that high resolve, bring that passion of the liver",
    "CONTENT": "آن عزم بلند آور آن سوز جگر آور\nشمشیر پدر خواهی بازوی پدر آور\n\nعزم بلند لا، وہ سوز جگر لا\nباپ کی تلوار چاہیے تو باپ کا بازو لا\n\nخودی کی موت ہے دنیا کی زندگانی\nخودی کی زندگی ہے جاودانی\n\nوہ قوم کہ جس کی خودی ہو پامال\nاس کی زندگی ہے موت کا اک خیال\n\nاقبالؔ کی صدا ہے، سن لے اے کارواں\nکہ منزل ہے ابھی دور، ابھی راستے باقی ہیں",
    "TRANSLATION_EN": "Bring that high resolve, bring that passion of the liver\nIf you seek the father's sword, bring the father's arm\n\nBring high resolve, bring that passion of the liver\nIf you want the father's sword, bring the father's arm\n\nThe death of selfhood is the life of the world\nThe life of selfhood is eternal\n\nThat nation whose selfhood is trampled\nIts life is but an idea of death\n\nThis is Iqbal's call, listen O caravan\nThat the destination is still far, the paths remain",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00049",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "حضرت انسان کو پیدا کیا ہے اس نے",
    "TITLE_EN": "He has created the essence of humanity",
    "CONTENT": "حضرت انسان کو پیدا کیا ہے اس نے\nسارے عالم کی خبر اس کو دی ہے اس نے\n\nوہی قادر ہے، وہی عالم ہے، وہی دانا ہے\nوہی مالک ہے، وہی رازق ہے، وہی توانا ہے\n\nجس کی شان سے آباد ہے یہ دنیائے رنگ و بو\nجس کے جلوے سے منور ہے یہ عالمِ رنگ و بو\n\nاقبالؔ کی خودی ہے وہ گوہر نایاب\nجس کے ملنے سے ملتا ہے سارا عالمِ آب و گِل",
    "TRANSLATION_EN": "He has created the essence of humanity\nHe has given him knowledge of the whole world\n\nHe is the Powerful, He is the Knowing, He is the Wise\nHe is the Master, He is the Provider, He is the Mighty\n\nBy whose glory this world of color and fragrance is inhabited\nBy whose radiance this world of color and fragrance is illuminated\n\nIqbal's selfhood is that rare jewel\nBy attaining which, the whole world of earth and clay is attained",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00050",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وہ مرغِ رواں ہے کہ جس کا ہے آشیانہ",
    "TITLE_EN": "He is the moving bird whose nest is",
    "CONTENT": "وہ مرغِ رواں ہے کہ جس کا ہے آشیانہ\nنہ مشرق سے تعلق نہ مغرب سے پہچان\n\nوہ مردِ خدا ہے کہ جس کی نظر میں\nنہ کعبہ ہے نہ بت خانہ، نہ مسجد نہ کلیسا\n\nاسی کی صدا سے بہار آتی ہے\nاسی کی صدا سے خزاں جاتی ہے\n\nوہ قوم کہ جس کی خودی ہو زندہ\nاس کی دنیا ہے آباد، اس کا جہاں ہے روشن\n\nاقبالؔ کی خودی ہے وہ رازِ نہاں\nجسے پا کر بندہ بن جاتا ہے سلطاں",
    "TRANSLATION_EN": "He is the moving bird whose nest is\nNeither connected to East nor known in West\n\nHe is the man of God in whose sight\nThere is no Kaaba, no temple, no mosque, no church\n\nBy his call comes spring\nBy his call goes autumn\n\nThat nation whose selfhood is alive\nIts world is inhabited, its universe is bright\n\nIqbal's selfhood is that hidden secret\nAttaining which, the servant becomes a sovereign",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00051",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "محبت کے سوا کوئی رشتہ نہیں",
    "TITLE_EN": "There is no bond except love",
    "CONTENT": "محبت کے سوا کوئی رشتہ نہیں\nکہ اس کے بغیر کوئی رشتہ نہیں\n\nوہی عشق ہے جو خدا تک پہنچائے\nوہی عشق ہے جو سکون دل لائے\n\nخودی کی پہچان ہے عشقِ محمد\nاسی سے ملے گا مقامِ محمد\n\nاقبالؔ کی صدا ہے، سن لے اے جہاں\nکہ عشقِ محمد ہے سارا جہاں",
    "TRANSLATION_EN": "There is no bond except love\nFor without it, there is no bond\n\nThat is love which leads to God\nThat is love which brings peace to the heart\n\nThe recognition of selfhood is the love of Muhammad\nThrough it alone will be attained the station of Muhammad\n\nThis is Iqbal's call, listen O world\nThat the love of Muhammad is the entire world",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00052",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "دل میں ہے آرزو کہ جس طرح بھی ہو",
    "TITLE_EN": "There is desire in the heart that somehow",
    "CONTENT": "دل میں ہے آرزو کہ جس طرح بھی ہو\nہم بھی کسی کے کام آئیں کسی کی آنکھوں میں سمائیں\n\nزندگی بے مقصد نہیں ہونی چاہیے\nکوئی مقصد ہو تو زندگی آتی ہے\n\nاقبالؔ نے سکھلایا ہے ہمیں\nکہ خودی کی بقا ہے عشقِ محمد",
    "TRANSLATION_EN": "There is desire in the heart that somehow\nWe too may be of use to someone, merge into someone's eyes\n\nLife should not be without purpose\nWhen there is purpose, life comes\n\nIqbal has taught us\nThat the survival of selfhood is the love of Muhammad",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00053",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہے عشق کا رشتہ ازل سے قائم",
    "TITLE_EN": "The bond of love is established from eternity",
    "CONTENT": "ہے عشق کا رشتہ ازل سے قائم\nنہ ٹوٹے گا کبھی یہ رشتہ قائم\n\nخودی کی بقا ہے عشقِ محمد\nاسی سے ملے گا مقامِ محمد\n\nاقبالؔ کا پیغام ہے، سن لو اے مسلماں\nکہ عشقِ محمد ہے سارا جہاں",
    "TRANSLATION_EN": "The bond of love is established from eternity\nThis bond will never break, it is eternal\n\nThe survival of selfhood is the love of Muhammad\nThrough it alone will be attained the station of Muhammad\n\nThis is Iqbal's message, listen O Muslims\nThat the love of Muhammad is the entire world",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00054",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "نہیں ہے ناامید اقبالؔ اپنی کشتِ ویراں سے",
    "TITLE_EN": "Iqbal is not hopeless of his desolate cultivation",
    "CONTENT": "نہیں ہے ناامید اقبالؔ اپنی کشتِ ویراں سے\nذرا نم ہو تو یہ مٹی بہت زرخیز ہے\n\nوہیں ہے زندگی کی بازیابی\nجہاں ہو عشقِ محمد کی طلب\n\nمسلماں کی پہچان ہے عشقِ محمد\nاسی سے ملے گا مقامِ محمد",
    "TRANSLATION_EN": "Iqbal is not hopeless of his desolate cultivation\nIf it gets a little moisture, this soil is very fertile\n\nThere alone is the attainment of life\nWhere there is the quest for the love of Muhammad\n\nThe identity of the Muslim is the love of Muhammad\nThrough it alone will be attained the station of Muhammad",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00056",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وہی سلطان ہے دنیا میں جسے فن کی ضرورت ہے",
    "TITLE_EN": "He is the sovereign in the world who needs art",
    "CONTENT": "وہی سلطان ہے دنیا میں جسے فن کی ضرورت ہے\nوہی محتاج ہے جو صرف دنیا کو بنایا تھا\n\nمسلماں کی نگہ ہوتی ہے جو صاحبِ دل کی\nبدل دیتی ہے تقدیریں، بدل دیتی ہے مقدر\n\nوہ وقت ہے کہ نہ شیخ و برہمن کی پہچان\nوہ دور ہے کہ نہ مسجد، نہ بتکدے کا خیال\n\nکبھی سمٹ کر اک دل میں اترتا ہے وہ نور\nکبھی افق پہ چمکتا ہے کرن بن کر",
    "TRANSLATION_EN": "He is the sovereign in the world who needs art\nHe is the needy one who created only the world\n\nThe Muslim's gaze, when it belongs to the possessor of heart\nChanges destinies, changes fate\n\nThat is the time when neither sheikh nor brahmin is recognized\nThat is the age when neither mosque nor temple is conceived\n\nSometimes that light descends, condensed into one heart\nSometimes it shines on the horizon as a ray",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00058",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بہت ہے علم مگر اس میں زندگی نہیں",
    "TITLE_EN": "Knowledge is plentiful but has no life",
    "CONTENT": "بہت ہے علم مگر اس میں زندگی نہیں\nوہ علم ہے کہ جس میں عمل کی روانی ہو\n\nاقبالؔ کی صدا ہے، سنو اے کارواں والو\nکہ منزل ہے ابھی دور، ابھی راستے باقی ہیں\n\nوہی زندگی ہے جس میں ہو خودی کی پرورش\nوہی موت ہے کہ جس میں ہو خودی کا سفر\n\nسمجھتا ہے زمانہ کہ محبت ہے آرزو\nنہیں جانتا کہ محبت ہے جاں کا خطر\n\nوہی عشق ہے کہ جس میں ہو جاں کی بازی\nوہی عشق ہے کہ جس میں نہ ہو جاں کا ڈر",
    "TRANSLATION_EN": "Knowledge is plentiful but has no life\nThat is knowledge in which action flows\n\nThis is Iqbal's call, listen O caravan folk\nThat the destination is still far, the paths remain\n\nThat is life in which the self is nurtured\nThat is death in which the self journeys\n\nThe world thinks love is desire\nIt does not know that love is life's danger\n\nThat is love in which life is staked\nThat is love in which there is no fear for life",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00059",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وہی عشق ہے کہ جس میں ہو جاں کی بازی",
    "TITLE_EN": "That is love in which life is staked",
    "CONTENT": "وہی عشق ہے کہ جس میں ہو جاں کی بازی\nوہی عشق ہے کہ جس میں نہ ہو جاں کا ڈر\n\nاقبالؔ کی خودی ہے اسرارِ کائنات\nجسے مل گئی خودی، اسے ملا سارا جہاں\n\nغریب شہر ہوں میں، سن تو لے میری فریاد\nکہ تیرے سینے میں بھی ہیں قیامتیں آباد\n\nمری نوائے غم آلود ہے متاع عزیز\nجہاں میں عام نہیں دولت دل ناشاد",
    "TRANSLATION_EN": "That is love in which life is staked\nThat is love in which there is no fear for life\n\nIqbal's selfhood is the secret of the universe\nWhoever attains selfhood, attains the whole world\n\nI am a stranger in the city, do listen to my cry\nThat in your breast too, wonders reside\n\nMy sorrow-laden song is a precious possession\nIn the world, the wealth of a sad heart is not common",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00060",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "گلہ ہے مجھ کو زمانے کی کور ذوقی سے",
    "TITLE_EN": "I complain of the age's blind taste",
    "CONTENT": "گلہ ہے مجھ کو زمانے کی کور ذوقی سے\nسمجھتا ہے مری محنت کو محنت فرہاد\n\nصدائے تیشہ کہ بر سنگ می خورد دگر است\nخبر بگیر کہ آواز تیشہ و جگر است\n\nیہی ہے زندگی مردِ مسلماں کی شان\nکہ اس کی ہستی ہے اللہ کی امانت",
    "TRANSLATION_EN": "I complain of the age's blind taste\nIt thinks my labor is the labor of Farhad\n\nThe sound of the axe striking stone is different\nKnow that the sound of the axe and the heart is the same\n\nThis is the life, the glory of the Muslim man\nThat his existence is a trust from Allah",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00061",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وہی مردِ مسلماں ہے کہ جو اللہ کا بندہ",
    "TITLE_EN": "He is the Muslim man who is God's servant",
    "CONTENT": "وہی مردِ مسلماں ہے کہ جو اللہ کا بندہ\nنہیں جس کو کسی غیر کی حاجت، نہ کسی کی خوشی\n\nسمجھتا ہے زمانہ کہ اقبالؔ ہے شاعر\nنہیں جانتا کہ اقبالؔ ہے مردِ قلندر",
    "TRANSLATION_EN": "He is the Muslim man who is God's servant\nWho needs none other, desires none other's pleasure\n\nThe age thinks Iqbal is a poet\nIt does not know that Iqbal is a dervish",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00062",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "امید نہ رکھ دولت دنیا سے وفا کی",
    "TITLE_EN": "Do not hope for fidelity from the wealth of the world",
    "CONTENT": "امید نہ رکھ دولت دنیا سے وفا کی\nرم اس کی طبیعت میں ہے مانند غزالہ\n\nاقبالؔ کی فریاد ہے، سن لے اے زمانہ\nکہ مسلم کی پہچان ہے اللہ کا ماننا",
    "TRANSLATION_EN": "Do not hope for fidelity from the wealth of the world\nIts nature runs like the gazelle\n\nThis is Iqbal's cry, listen O age\nThat the Muslim's identity is acknowledging Allah",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00063",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "غلام قوموں کے علم و عرفاں کی ہے یہی رمز آشکارا",
    "TITLE_EN": "This is the manifest secret of the knowledge and wisdom of enslaved nations",
    "CONTENT": "غلام قوموں کے علم و عرفاں کی ہے یہی رمز آشکارا\nزمیں اگر چاہے آسماں کو تو توڑ ڈالے یہ بندشِ خانہ",
    "TRANSLATION_EN": "This is the manifest secret of the knowledge and wisdom of enslaved nations\nIf earth desires the sky, it can break this house's confinement",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00064",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "اقبالؔ کی صدا ہے، سن لے اے کارواں",
    "TITLE_EN": "This is Iqbal's call, listen O caravan",
    "CONTENT": "اقبالؔ کی صدا ہے، سن لے اے کارواں\nکہ منزل ہے ابھی دور، ابھی راستے باقی ہیں\n\nحضرت انسان کو پیدا کیا ہے اس نے\nسارے عالم کی خبر اس کو دی ہے اس نے\n\nوہی قادر ہے، وہی عالم ہے، وہی دانا ہے\nوہی مالک ہے، وہی رازق ہے، وہی توانا ہے\n\nجس کی شان سے آباد ہے یہ دنیائے رنگ و بو\nجس کے جلوے سے منور ہے یہ عالمِ رنگ و بو\n\nاقبالؔ کی خودی ہے وہ گوہر نایاب\nجس کے ملنے سے ملتا ہے سارا عالمِ آب و گِل",
    "TRANSLATION_EN": "This is Iqbal's call, listen O caravan\nThat the destination is still far, the paths remain\n\nHe has created the essence of humanity\nHe has given him knowledge of the whole world\n\nHe is the Powerful, He is the Knowing, He is the Wise\nHe is the Master, He is the Provider, He is the Mighty\n\nBy whose glory this world of color and fragrance is inhabited\nBy whose radiance this world of color and fragrance is illuminated\n\nIqbal's selfhood is that rare jewel\nBy attaining which, the whole world of earth and clay is attained",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00100",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ترے جلوے سے ہے دنیا کو فروغ و زیبائش",
    "TITLE_EN": "From Your radiance, the world gains prosperity and adornment",
    "CONTENT": "ترے جلوے سے ہے دنیا کو فروغ و زیبائش\nنہیں ہے کوئی ترے سوا، نہیں ہے کوئی ترے سوا\n\nزمیں پہ آسماں پہ تیرا ہی جلوہ ہے\nنہیں ہے کوئی ترے سوا، نہیں ہے کوئی ترے سوا\n\nخودی کی موت ہے دنیا کی زندگانی\nخودی کی زندگی ہے جاودانی\n\nوہ قوم کہ جس کی خودی ہو پامال\nاس کی زندگی ہے موت کا اک خیال\n\nاقبالؔ کی صدا ہے، سن لے اے کارواں\nکہ منزل ہے ابھی دور، ابھی راستے باقی ہیں",
    "TRANSLATION_EN": "From Your radiance, the world gains prosperity and adornment\nThere is none but You, there is none but You\n\nOn earth and sky, only Your manifestation exists\nThere is none but You, there is none but You\n\nThe death of selfhood is the life of the world\nThe life of selfhood is eternal\n\nThat nation whose selfhood is trampled\nIts life is but an idea of death\n\nThis is Iqbal's call, listen O caravan\nThat the destination is still far, the paths remain",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00101",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "حضورِ یار میں کھلی ہے گفتگو کی کتاب",
    "TITLE_EN": "In the presence of the Beloved, the book of conversation is opened",
    "CONTENT": "حضورِ یار میں کھلی ہے گفتگو کی کتاب\nنہاں ہے دل میں جو کچھ، ہے وہی ہے لب پہ حجاب\n\nسنا ہے عشق پہ آساں ہے مرنا\nمحبت میں نہیں ہے فرق جینے اور مرنے کا\n\nاسی کو دیکھ کر جیتے ہیں جس کافر پہ دم نکلے\nبہت نکلے مرے ارمان لیکن پھر بھی کم نکلے\n\nاقبالؔ کی خودی ہے وہ گوہر نایاب\nجس کے ملنے سے ملتا ہے سارا عالمِ آب و گِل",
    "TRANSLATION_EN": "In the presence of the Beloved, the book of conversation is opened\nWhatever is hidden in the heart, that same is upon the lips, veiled\n\nIt is heard that dying in love is easy\nIn love, there is no difference between living and dying\n\nWe live by seeing that infidel at whose death life departs\nMany desires of mine emerged, yet still fewer emerged\n\nIqbal's selfhood is that rare jewel\nBy attaining which, the whole world of earth and clay is attained",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00102",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عشق ہے اصل حیات، عقل ہے اس کا نقاب",
    "TITLE_EN": "Love is the essence of life, intellect is its veil",
    "CONTENT": "عشق ہے اصل حیات، عقل ہے اس کا نقاب\nدل سے جو بات نکلتی ہے اثر رکھتی ہے\n\nعشق ہے وہ بحر بیکراں جس کا کوئی کنار نہیں\nعقل ہے وہ ناخدا کہ جسے اس بحر کا خبر نہیں\n\nجہاں میں اہلِ یقین کو نصیب ہوتی ہے\nوہ کامیابی جو اصحابِ فکر کو نہیں ملتی\n\nاقبالؔ کا پیغام ہے، سن لو اے جہاں والو\nکہ زندگی ہے عمل سے، نہ آرزو سے، نہ خیال سے",
    "TRANSLATION_EN": "Love is the essence of life, intellect is its veil\nWhatever emerges from the heart has effect\n\nLove is that limitless ocean with no shore\nIntellect is that captain unaware of this ocean\n\nIn the world, the people of certainty attain\nThat success which the people of thought do not get\n\nThis is Iqbal's message, listen O people of the world\nThat life is through action, not through desire, not through thought",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00103",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہر اک مقام سے آگے گزر گیا مہ نو",
    "TITLE_EN": "The new moon passed beyond every station",
    "CONTENT": "ہر اک مقام سے آگے گزر گیا مہ نو\nکمال کس کو میسر ہوا ہے بے تگ و دو\n\nنفس کے زور سے وہ غنچہ وا ہوا بھی تو کیا\nجسے نصیب نہیں آفتاب کا پرتو\n\nنگاہ پاک ہے تیری تو پاک ہے دل بھی\nکہ دل کو حق نے کیا ہے نگاہ کا پیرو\n\nپنپ سکا نہ خیاباں میں لالۂ دل سوز\nکہ سازگار نہیں یہ جہان گندم و جو\n\nرہے نہ ایبک و غوری کے معرکے باقی\nہمیشہ تازہ و شیریں ہے نغمۂ خسرو",
    "TRANSLATION_EN": "The new moon passed beyond every station\nWho has attained perfection without struggle?\n\nEven if that bud opens by the power of breath, so what?\nWhich is not blessed by the sun's ray?\n\nYour gaze is pure, so your heart is pure too\nFor the Truth has made the heart the follower of the gaze\n\nThe heart-consuming tulip could not thrive in the garden\nFor this world of wheat and barley is not congenial\n\nThe battles of Aibak and Ghuri remain no more\nThe song of Khusrau is ever fresh and sweet",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00110",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہستی اس کی ہے کہ جس نے خودی کی حفاظت کی",
    "TITLE_EN": "He exists who has protected his selfhood",
    "CONTENT": "ہستی اس کی ہے کہ جس نے خودی کی حفاظت کی\nوہی زندہ ہے کہ جس نے خودی کو پہچانا\n\nعشق کی منزلیں ہیں کچھ اور ہی\nدل کو گر ہو جستجو، جاں کو گر ہو انتظار\n\nوہ زمانے میں معزز تھے مسلماں ہو کر\nاور تم خوار ہوئے تارک قرآں ہو کر\n\nاقبالؔ اپنے دل کی لگن کو نہ بھول جا\nتو شاہیں ہے، پرواز ہے کام تیرا",
    "TRANSLATION_EN": "He exists who has protected his selfhood\nHe is alive who has recognized his selfhood\n\nThe stages of love are something else entirely\nIf the heart seeks, if the soul waits\n\nThey were honored in the world as Muslims\nAnd you became despised as abandoners of the Quran\n\nIqbal, do not forget the passion of your heart\nYou are a falcon, flight is your destiny",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00112",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تھی تو موجود ازل سے ہی تری ذات قدیم",
    "TITLE_EN": "Your ancient being existed from eternity",
    "CONTENT": "تھی تو موجود ازل سے ہی تری ذات قدیم\nپھول تھا زیب چمن پر نہ پریشاں تھی شمیم\n\nشرط انصاف ہے اے صاحب الطاف عمیم\nبوئے گل پھیلتی کس طرح جو ہوتی نہ نسیم\n\nہم کو جمعیت خاطر یہ پریشانی تھی\nورنہ امت ترے محبوب کی دیوانی تھی\n\nہم سے پہلے تھا عجب تیرے جہاں کا منظر\nکہیں مسجود تھے پتھر کہیں معبود شجر\n\nتجھ کو معلوم ہے لیتا تھا کوئی نام ترا\nقوت بازوئے مسلم نے کیا کام ترا",
    "TRANSLATION_EN": "Your ancient being existed from eternity\nThe flower adorned the garden, but the fragrance was not scattered\n\nIt is a condition of justice, O possessor of abundant grace\nHow would the flower's scent spread if there were no breeze?\n\nWe had this restlessness of heart\nOtherwise the community of Your beloved was devoted\n\nBefore us was a strange scene in Your world\nHere stones were worshipped, there trees were adored\n\nYou know, someone used to take Your name\nWhat did the power of the Muslim's arm accomplish for You?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00113",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تجھ کو معلوم ہے لیتا تھا کوئی نام ترا",
    "TITLE_EN": "You know, someone used to take Your name",
    "CONTENT": "تجھ کو معلوم ہے لیتا تھا کوئی نام ترا\nقوت بازوئے مسلم نے کیا کام ترا\n\nبس رہے تھے یہیں سلجوق بھی تورانی بھی\nاہل چیں چین میں ایران میں ساسانی بھی\n\nاسی معمورے میں آباد تھے یونانی بھی\nاسی دنیا میں یہودی بھی تھے نصرانی بھی\n\nپر ترے نام پہ تلوار اٹھائی کس نے\nبات جو بگڑی ہوئی تھی وہ بنائی کس نے\n\nتھے ہمیں ایک ترے معرکہ آراؤں میں\nخشکیوں میں کبھی لڑتے کبھی دریاؤں میں\n\nدیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں",
    "TRANSLATION_EN": "You know, someone used to take Your name\nWhat did the power of the Muslim's arm accomplish for You?\n\nHere dwelt the Seljuqs and the Turanians too\nThe people of China in China, the Sasanians in Iran too\n\nIn this same habitation, the Greeks dwelt too\nIn this same world, there were Jews and Christians too\n\nBut who raised the sword for Your name?\nWho resolved the matter that was complicated?\n\nWe were among those in Your battlefields\nSometimes fighting on lands, sometimes on seas\n\nWe gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00114",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تھے ہمیں ایک ترے معرکہ آراؤں میں",
    "TITLE_EN": "We were among those in Your battlefields",
    "CONTENT": "تھے ہمیں ایک ترے معرکہ آراؤں میں\nخشکیوں میں کبھی لڑتے کبھی دریاؤں میں\n\nدیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں\n\nشان آنکھوں میں نہ جچتی تھی جہانداروں کی\nکلمہ پڑھتے تھے ہمیں چھاؤں میں تلواروں کی\n\nہم جو جیتے تھے تو جنگوں کی مصیبت کے لیے\nاور مرتے تھے ترے نام کی عظمت کے لیے\n\nتھی نہ کچھ تیغ زنی اپنی حکومت کے لیے\nسر بکف پھرتے تھے کیا دہر میں دولت کے لیے\n\nقوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی",
    "TRANSLATION_EN": "We were among those in Your battlefields\nSometimes fighting on lands, sometimes on seas\n\nWe gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts\n\nThe glory of world-rulers did not fit in our eyes\nWe recited the Kalima in the shade of swords\n\nIf we lived, it was for the affliction of wars\nAnd we died for the greatness of Your name\n\nOur sword-fighting was not for our own rule\nWe wandered with head in hand—was it for worldly wealth?\n\nOur nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00115",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "توڑے مخلوق خداوندوں کے پیکر کس نے",
    "TITLE_EN": "Who broke the idols of god-like beings?",
    "CONTENT": "توڑے مخلوق خداوندوں کے پیکر کس نے\nکاٹ کر رکھ دئیے کفار کے لشکر کس نے\n\nکس نے ٹھنڈا کیا آتشکدۂ ایراں کو\nکس نے پھر زندہ کیا تذکرۂ یزداں کو\n\nکون سی قوم فقط تیری طلب گار ہوئی\nاور تیرے لیے زحمت کش پیکار ہوئی\n\nکس کی شمشیر جہانگیر جہاں دار ہوئی\nکس کی تکبیر سے دنیا تری بیدار ہوئی\n\nکس کی ہیبت سے صنم سہمے ہوئے رہتے تھے\nمنہ کے بل گر کے ہو اللہ احد کہتے تھے\n\nآ گیا عین لڑائی میں اگر وقت نماز\nقبلہ رو ہو کے زمیں بوس ہوئی قوم حجاز\n\nایک ہی صف میں کھڑے ہو گئے محمود و ایاز\nنہ کوئی بندہ رہا اور نہ کوئی بندہ نواز",
    "TRANSLATION_EN": "Who broke the idols of god-like beings?\nWho cut down the armies of the infidels?\n\nWho cooled the fire-temple of Iran?\nWho revived the mention of Yazdan?\n\nWhich nation became solely Your seeker?\nAnd for You took the trouble of warfare?\n\nWhose world-conquering sword became world-ruling?\nBy whose cry of Allahu Akbar did Your world awaken?\n\nBy whose awe did idols remain terrified?\nFalling on their faces, they cried \"Allah is One\"\n\nIf the time for prayer came in the midst of battle\nFacing the Qibla, the people of Hejaz bowed to the earth\n\nIn one row stood Mahmud and Ayaz\nNo master remained, no servant remained",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00116",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ایک ہی صف میں کھڑے ہو گئے محمود و ایاز",
    "TITLE_EN": "In one row stood Mahmud and Ayaz",
    "CONTENT": "ایک ہی صف میں کھڑے ہو گئے محمود و ایاز\nنہ کوئی بندہ رہا اور نہ کوئی بندہ نواز\n\nبندہ و صاحب و محتاج و غنی ایک ہوئے\nتیری سرکار میں پہنچے تو سبھی ایک ہوئے\n\nمحفل کون و مکاں میں سحر و شام پھرے\nمئے توحید کو لے کر صفت جام پھرے\n\nکوہ میں دشت میں لے کر ترا پیغام پھرے\nاور معلوم ہے تجھ کو کبھی ناکام پھرے\n\nدشت تو دشت ہیں دریا بھی نہ چھوڑے ہم نے\nبحر ظلمات میں دوڑا دئیے گھوڑے ہم نے",
    "TRANSLATION_EN": "In one row stood Mahmud and Ayaz\nNo master remained, no servant remained\n\nServant and master, needy and rich, became one\nWhen they reached Your court, all became one\n\nIn the assembly of existence, morning and evening they wandered\nCarrying the wine of monotheism like a cup they wandered\n\nIn mountains and deserts, carrying Your message they wandered\nAnd You know, they never wandered in vain\n\nDeserts we crossed, and rivers too we did not leave\nInto the sea of darkness, we spurred our horses",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00117",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "صفحۂ دہر سے باطل کو مٹایا ہم نے",
    "TITLE_EN": "We erased falsehood from the page of time",
    "CONTENT": "صفحۂ دہر سے باطل کو مٹایا ہم نے\nنوع انساں کو غلامی سے چھڑایا ہم نے\n\nتیرے کعبے کو جبینوں سے بسایا ہم نے\nتیرے قرآن کو سینوں سے لگایا ہم نے\n\nپھر بھی ہم سے یہ گلہ ہے کہ وفادار نہیں\nہم وفادار نہیں تو بھی تو دل دار نہیں",
    "TRANSLATION_EN": "We erased falsehood from the page of time\nWe freed the human race from slavery\n\nWe populated Your Kaaba with our foreheads\nWe attached Your Quran to our breasts\n\nYet You complain that we are not loyal\nWe are not loyal, but You too are not loving",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00118",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ان میں کاہل بھی ہیں غافل بھی ہیں ہشیار بھی ہیں",
    "TITLE_EN": "Among them are the lazy, the heedless, the vigilant too",
    "CONTENT": "ان میں کاہل بھی ہیں غافل بھی ہیں ہشیار بھی ہیں\nسیکڑوں ہیں کہ ترے نام سے بے زار بھی ہیں\n\nرحمتیں ہیں تری اغیار کے کاشانوں پر\nبرق گرتی ہے تو بیچارے مسلمانوں پر\n\nبت صنم خانوں میں کہتے ہیں مسلمان گئے\nہے خوشی ان کو کہ کعبے کے نگہبان گئے\n\nمنزل دہر سے اونٹوں کے حدی خوان گئے\nاپنی بغلوں میں دبائے ہوئے قرآن گئے\n\nخندہ زن کفر ہے احساس تجھے ہے کہ نہیں\nاپنی توحید کا کچھ پاس تجھے ہے کہ نہیں",
    "TRANSLATION_EN": "Among them are the lazy, the heedless, the vigilant too\nThere are hundreds who are averse to Your name too\n\nYour mercies are on the houses of rivals\nLightning falls on poor Muslims\n\nIn the temples, the idols say the Muslims have gone\nThey are happy that the guardians of the Kaaba have gone\n\nThe reciters of elegies have gone from the worldly abode\nPressing the Quran to their armpits, they have gone\n\nDisbelief laughs, do you feel it or not?\nDo you have any regard for your monotheism or not?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00119",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "یہ شکایت نہیں ہیں ان کے خزانے معمور",
    "TITLE_EN": "This is no complaint that their treasures are full",
    "CONTENT": "یہ شکایت نہیں ہیں ان کے خزانے معمور\nنہیں محفل میں جنہیں بات بھی کرنے کا شعور\n\nقہر تو یہ ہے کہ کافر کو ملیں حور و قصور\nاور بیچارے مسلماں کو فقط وعدۂ حور\n\nاب وہ الطاف نہیں ہم پہ عنایات نہیں\nبات یہ کیا ہے کہ پہلی سی مدارات نہیں\n\nکیوں مسلمانوں میں ہے دولت دنیا نایاب\nتیری قدرت تو ہے وہ جس کی نہ حد ہے نہ حساب",
    "TRANSLATION_EN": "This is no complaint that their treasures are full\nOf those who have no sense even to speak in gatherings\n\nThe tyranny is that the infidel gets houris and palaces\nAnd the poor Muslim only gets the promise of houris\n\nNow those favors are no more, no blessings upon us\nWhat is this matter, that former regard is no more?\n\nWhy is the wealth of the world rare among Muslims?\nYour power is such that has no limit, no account",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00120",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "طعن اغیار ہے رسوائی ہے ناداری ہے",
    "TITLE_EN": "There is taunt of rivals, disgrace, poverty",
    "CONTENT": "طعن اغیار ہے رسوائی ہے ناداری ہے\nکیا ترے نام پہ مرنے کا عوض خواری ہے\n\nبنی اغیار کی اب چاہنے والی دنیا\nرہ گئی اپنے لیے ایک خیالی دنیا\n\nہم تو رخصت ہوئے اوروں نے سنبھالی دنیا\nپھر نہ کہنا ہوئی توحید سے خالی دنیا\n\nہم تو جیتے ہیں کہ دنیا میں ترا نام رہے\nکہیں ممکن ہے کہ ساقی نہ رہے جام رہے",
    "TRANSLATION_EN": "There is taunt of rivals, disgrace, poverty\nIs humiliation the reward for dying in Your name?\n\nThe world now desires to serve rivals\nFor ourselves, only an imaginary world remains\n\nWe departed, others took over the world\nThen do not say the world became empty of monotheism\n\nWe live only that Your name remains in the world\nPerhaps it's possible that if the cupbearer remains no more, the cup remains",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00121",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تیری محفل بھی گئی چاہنے والے بھی گئے",
    "TITLE_EN": "Your assembly is gone, the lovers are gone",
    "CONTENT": "تیری محفل بھی گئی چاہنے والے بھی گئے\nشب کی آہیں بھی گئیں صبح کے نالے بھی گئے\n\nدل تجھے دے بھی گئے اپنا صلہ لے بھی گئے\nآ کے بیٹھے بھی نہ تھے اور نکالے بھی گئے\n\nآئے عشاق گئے وعدۂ فردا لے کر\nاب انہیں ڈھونڈ چراغ رخ زیبا لے کر\n\nدرد لیلیٰ بھی وہی قیس کا پہلو بھی وہی\nنجد کے دشت و جبل میں رم آہو بھی وہی\n\nعشق کا دل بھی وہی حسن کا جادو بھی وہی\nامت احمد مرسل بھی وہی تو بھی وہی",
    "TRANSLATION_EN": "Your assembly is gone, the lovers are gone\nNight's sighs are gone, morning's laments are gone\n\nThey gave their hearts to You, took their reward and went\nThey hadn't even sat down when they were turned out\n\nLovers came and went, taking the promise of tomorrow\nNow search for them, taking the lamp of beautiful face\n\nThe pain of Laila is the same, the manner of Qais is the same\nIn the deserts and mountains of Najd, the deer's movement is the same\n\nLove's heart is the same, beauty's magic is the same\nThe community of Ahmad the Messenger is the same, You are the same",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00122",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عشق کا دل بھی وہی حسن کا جادو بھی وہی",
    "TITLE_EN": "Love's heart is the same, beauty's magic is the same",
    "CONTENT": "عشق کا دل بھی وہی حسن کا جادو بھی وہی\nامت احمد مرسل بھی وہی تو بھی وہی\n\nپھر یہ آزردگی غیر سبب کیا معنی\nاپنے شیداؤں پہ یہ چشم غضب کیا معنی\n\nتجھ کو چھوڑا کہ رسول عربی کو چھوڑا\nبت گری پیشہ کیا بت شکنی کو چھوڑا\n\nعشق کو عشق کی آشفتہ سری کو چھوڑا\nرسم سلمان و اویس قرنی کو چھوڑا",
    "TRANSLATION_EN": "Love's heart is the same, beauty's magic is the same\nThe community of Ahmad the Messenger is the same, You are the same\n\nThen what is this displeasure without reason?\nWhat is this angry glance at your devotees?\n\nWe left You? We left the Arab Messenger?\nMade idol-worship our profession, left iconoclasm?\n\nLeft love, left the madness of love?\nLeft the tradition of Salman and Uwais Qarni?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00123",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "آگ تکبیر کی سینوں میں دبی رکھتے ہیں",
    "TITLE_EN": "We keep the fire of Allahu Akbar hidden in our breasts",
    "CONTENT": "آگ تکبیر کی سینوں میں دبی رکھتے ہیں\nزندگی مثل بلال حبشی رکھتے ہیں\n\nعشق کی خیر وہ پہلی سی ادا بھی نہ سہی\nجادہ پیمائی تسلیم و رضا بھی نہ سہی\n\nمضطرب دل صفت قبلہ نما بھی نہ سہی\nاور پابندی آئین وفا بھی نہ سہی\n\nکبھی ہم سے کبھی غیروں سے شناسائی ہے\nبات کہنے کی نہیں تو بھی تو ہرجائی ہے",
    "TRANSLATION_EN": "We keep the fire of Allahu Akbar hidden in our breasts\nWe live our life like Bilal the Abyssinian\n\nLove's well-being—that former style is no more\nThe path-treading of submission and acceptance is no more\n\nThe restless heart, like a compass, is no more\nAnd adherence to the covenant of fidelity is no more\n\nSometimes with us, sometimes with strangers is acquaintance\nNo need to say—You too are fickle",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00124",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "سر فاراں پہ کیا دین کو کامل تو نے",
    "TITLE_EN": "On Mount Faran, You perfected the religion",
    "CONTENT": "سر فاراں پہ کیا دین کو کامل تو نے\nاک اشارے میں ہزاروں کے لیے دل تو نے\n\nآتش اندوز کیا عشق کا حاصل تو نے\nپھونک دی گرمی رخسار سے محفل تو نے\n\nآج کیوں سینے ہمارے شرر آباد نہیں\nہم وہی سوختہ ساماں ہیں تجھے یاد نہیں\n\nوادی نجد میں وہ شور سلاسل نہ رہا\nقیس دیوانۂ نظارۂ محمل نہ رہا\n\nحوصلے وہ نہ رہے ہم نہ رہے دل نہ رہا\nگھر یہ اجڑا ہے کہ تو رونق محفل نہ رہا",
    "TRANSLATION_EN": "On Mount Faran, You perfected the religion\nWith one gesture, won thousands of hearts\n\nYou made love's essence fire-absorbing\nWith the warmth of Your cheek, You burned the assembly\n\nWhy are our breasts not filled with sparks today?\nWe are the same burnt offerings—do You not remember?\n\nIn the valley of Najd, that clamor of chains is no more\nQais, maddened by the sight of the camel-litter, is no more\n\nThose aspirations are no more, we are no more, the heart is no more\nThis house is ruined because you, the splendor of the assembly, are no more",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00125",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "حوصلے وہ نہ رہے ہم نہ رہے دل نہ رہا",
    "TITLE_EN": "Those aspirations are no more, we are no more, the heart is no more",
    "CONTENT": "حوصلے وہ نہ رہے ہم نہ رہے دل نہ رہا\nگھر یہ اجڑا ہے کہ تو رونق محفل نہ رہا\n\nبادہ کش غیر ہیں گلشن میں لب جو بیٹھے\nسنتے ہیں جام بکف نغمۂ کو کو بیٹھے\n\nدور ہنگامۂ گلزار سے یکسو بیٹھے\nتیرے دیوانے بھی ہیں منتظر ہو بیٹھے\n\nاپنے پروانوں کو پھر ذوق خود افروزی دے\nبرق دیرینہ کو فرمان جگر سوزی دے",
    "TRANSLATION_EN": "Those aspirations are no more, we are no more, the heart is no more\nThis house is ruined because you, the splendor of the assembly, are no more\n\nWine-drinkers are strangers in the garden, sitting by the lip\nHearing the song of \"coo coo\" with cup in hand, they sit\n\nAway from the clamor of the garden, to one side they sit\nYour mad lovers too, waiting, sit\n\nGive your moths again the desire for self-immolation\nGive the ancient lightning the command of heart-searing",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00126",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "قوم آوارہ عناں تاب ہے پھر سوئے حجاز",
    "TITLE_EN": "The wandering nation, reins in hand, turns again towards Hejaz",
    "CONTENT": "قوم آوارہ عناں تاب ہے پھر سوئے حجاز\nلے اڑا بلبل بے پر کو مذاق پرواز\n\nمضطرب باغ کے ہر غنچے میں ہے بوئے نیاز\nتو ذرا چھیڑ تو دے تشنۂ مضراب ہے ساز\n\nنغمے بیتاب ہیں تاروں سے نکلنے کے لیے\nطور مضطر ہے اسی آگ میں جلنے کے لیے\n\nمشکلیں امت مرحوم کی آساں کر دے\nمور بے مایہ کو ہمدوش سلیماں کر دے\n\nجنس نایاب محبت کو پھر ارزاں کر دے\nہند کے دیر نشینوں کو مسلماں کر دے",
    "TRANSLATION_EN": "The wandering nation, reins in hand, turns again towards Hejaz\nThe joke of flight carries away the wingless nightingale\n\nIn every bud of the restless garden is the scent of supplication\nJust strike up—the thirsting instrument awaits the plectrum\n\nMelodies are restless to emerge from strings\nThe burning bush is restless to burn in that fire\n\nMake easy the difficulties of the departed community\nMake the resourceless ant equal companion to Solomon\n\nMake the rare commodity of love abundant again\nMake the temple-dwellers of India into Muslims",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00127",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "جنس نایاب محبت کو پھر ارزاں کر دے",
    "TITLE_EN": "Make the rare commodity of love abundant again",
    "CONTENT": "جنس نایاب محبت کو پھر ارزاں کر دے\nہند کے دیر نشینوں کو مسلماں کر دے\n\nجوئے خوں می چکد از حسرت دیرینۂ ما\nمی تپد نالہ بہ نشتر کدۂ سینۂ ما\n\nبوئے گل لے گئی بیرون چمن راز چمن\nکیا قیامت ہے کہ خود پھول ہیں غماز چمن\n\nعہد گل ختم ہوا ٹوٹ گیا ساز چمن\nاڑ گئے ڈالیوں سے زمزمہ پرداز چمن",
    "TRANSLATION_EN": "Make the rare commodity of love abundant again\nMake the temple-dwellers of India into Muslims\n\nA stream of blood flows from our ancient longing\nOur lament throbs in the lancet-house of our breast\n\nThe scent of the flower carried the garden's secret outside\nWhat a calamity—the flowers themselves are informers of the garden\n\nThe era of roses ended, the garden's instrument broke\nThe melodious ones flew from the branches",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00128",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ایک بلبل ہے کہ ہے محو ترنم اب تک",
    "TITLE_EN": "One nightingale remains, absorbed in song still",
    "CONTENT": "ایک بلبل ہے کہ ہے محو ترنم اب تک\nاس کے سینے میں ہے نغموں کا تلاطم اب تک\n\nقمریاں شاخ صنوبر سے گریزاں بھی ہوئیں\nپتیاں پھول کی جھڑ جھڑ کے پریشاں بھی ہوئیں\n\nوہ پرانی روشیں باغ کی ویراں بھی ہوئیں\nڈالیاں پیرہن برگ سے عریاں بھی ہوئیں\n\nقید موسم سے طبیعت رہی آزاد اس کی\nکاش گلشن میں سمجھتا کوئی فریاد اس کی",
    "TRANSLATION_EN": "One nightingale remains, absorbed in song still\nIn its breast, the turbulence of melodies still\n\nThe doves have become averse to the cypress branch\nThe flower petals, falling, have become scattered\n\nThose old ways of the garden have become desolate\nThe branches have become bare of the garment of leaves\n\nIts nature remained free from the imprisonment of seasons\nIf only someone in the garden understood its cry",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00129",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "لطف مرنے میں ہے باقی نہ مزہ جینے میں",
    "TITLE_EN": "The pleasure remains in dying, not the taste in living",
    "CONTENT": "لطف مرنے میں ہے باقی نہ مزہ جینے میں\nکچھ مزہ ہے تو یہی خون جگر پینے میں\n\nکتنے بیتاب ہیں جوہر مرے آئینے میں\nکس قدر جلوے تڑپتے ہیں مرے سینے میں\n\nاس گلستاں میں مگر دیکھنے والے ہی نہیں\nداغ جو سینے میں رکھتے ہوں وہ لالے ہی نہیں",
    "TRANSLATION_EN": "The pleasure remains in dying, not the taste in living\nIf there's any taste, it's in drinking the blood of the liver\n\nHow restless are the essences in my mirror\nHow many radiances tremble in my breast\n\nIn this garden, there are no observers though\nThere are no tulips bearing scars in their breasts",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00130",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عجمی خم ہے تو کیا مے تو حجازی ہے مری",
    "TITLE_EN": "If the vessel is Persian, so what—my wine is Hejazi",
    "CONTENT": "عجمی خم ہے تو کیا مے تو حجازی ہے مری\nنغمہ ہندی ہے تو کیا لے تو حجازی ہے مری\n\nکیوں زیاں کار بنوں سود فراموش رہوں\nفکر فردا نہ کروں محو غم دوش رہوں\n\nنالے بلبل کے سنوں اور ہمہ تن گوش رہوں\nہم نوا میں بھی کوئی گل ہوں کہ خاموش رہوں\n\nجرأت آموز مری تاب سخن ہے مجھ کو\nشکوہ اللہ سے خاکم بدہن ہے مجھ کو\n\nہے بجا شیوۂ تسلیم میں مشہور ہیں ہم\nقصۂ درد سناتے ہیں کہ مجبور ہیں ہم",
    "TRANSLATION_EN": "If the vessel is Persian, so what—my wine is Hejazi\nIf the song is Indian, so what—my melody is Hejazi\n\nWhy should I remain a loser, forgetful of profit?\nWhy should I not think of tomorrow, absorbed in yesterday's grief?\n\nShould I listen to the nightingale's laments and remain all ears?\nIn harmony, am I a flower that I should remain silent?\n\nMy power of speech has taught me audacity\nI complain to God—may dust be in my mouth\n\nIt is right that we are famous for the style of submission\nWe tell tales of pain because we are helpless",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00131",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ساز خاموش ہیں فریاد سے معمور ہیں ہم",
    "TITLE_EN": "The instruments are silent, we are filled with lament",
    "CONTENT": "ساز خاموش ہیں فریاد سے معمور ہیں ہم\nنالہ آتا ہے اگر لب پہ تو معذور ہیں ہم\n\nاے خدا شکوۂ ارباب وفا بھی سن لے\nخوگر حمد سے تھوڑا سا گلہ بھی سن لے\n\nتھی تو موجود ازل سے ہی تری ذات قدیم\nپھول تھا زیب چمن پر نہ پریشاں تھی شمیم\n\nشرط انصاف ہے اے صاحب الطاف عمیم\nبوئے گل پھیلتی کس طرح جو ہوتی نہ نسیم\n\nہم کو جمعیت خاطر یہ پریشانی تھی\nورنہ امت ترے محبوب کی دیوانی تھی",
    "TRANSLATION_EN": "The instruments are silent, we are filled with lament\nIf a cry comes to our lips, we are excused\n\nO God, listen also to the complaint of the faithful\nFrom one accustomed to praise, listen to a little complaint too\n\nYour ancient being existed from eternity\nThe flower adorned the garden, but the fragrance was not scattered\n\nIt is a condition of justice, O possessor of abundant grace\nHow would the flower's scent spread if there were no breeze?\n\nWe had this restlessness of heart\nOtherwise the community of Your beloved was devoted",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00132",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہم کو جمعیت خاطر یہ پریشانی تھی",
    "TITLE_EN": "We had this restlessness of heart",
    "CONTENT": "ہم کو جمعیت خاطر یہ پریشانی تھی\nورنہ امت ترے محبوب کی دیوانی تھی\n\nہم سے پہلے تھا عجب تیرے جہاں کا منظر\nکہیں مسجود تھے پتھر کہیں معبود شجر\n\nخوگر پیکر محسوس تھی انساں کی نظر\nمانتا پھر کوئی ان دیکھے خدا کو کیونکر\n\nتجھ کو معلوم ہے لیتا تھا کوئی نام ترا\nقوت بازوئے مسلم نے کیا کام ترا",
    "TRANSLATION_EN": "We had this restlessness of heart\nOtherwise the community of Your beloved was devoted\n\nBefore us was a strange scene in Your world\nHere stones were worshipped, there trees were adored\n\nHuman vision was accustomed to tangible forms\nHow then could anyone believe in an unseen God?\n\nYou know, someone used to take Your name\nWhat did the power of the Muslim's arm accomplish for You?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00133",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بس رہے تھے یہیں سلجوق بھی تورانی بھی",
    "TITLE_EN": "Here dwelt the Seljuqs and the Turanians too",
    "CONTENT": "بس رہے تھے یہیں سلجوق بھی تورانی بھی\nاہل چیں چین میں ایران میں ساسانی بھی\n\nاسی معمورے میں آباد تھے یونانی بھی\nاسی دنیا میں یہودی بھی تھے نصرانی بھی\n\nپر ترے نام پہ تلوار اٹھائی کس نے\nبات جو بگڑی ہوئی تھی وہ بنائی کس نے\n\nتھے ہمیں ایک ترے معرکہ آراؤں میں\nخشکیوں میں کبھی لڑتے کبھی دریاؤں میں\n\nدیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں",
    "TRANSLATION_EN": "Here dwelt the Seljuqs and the Turanians too\nThe people of China in China, the Sasanians in Iran too\n\nIn this same habitation, the Greeks dwelt too\nIn this same world, there were Jews and Christians too\n\nBut who raised the sword for Your name?\nWho resolved the matter that was complicated?\n\nWe were among those in Your battlefields\nSometimes fighting on lands, sometimes on seas\n\nWe gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00134",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "دیں اذانیں کبھی یورپ کے کلیساؤں میں",
    "TITLE_EN": "We gave calls to prayer in Europe's churches",
    "CONTENT": "دیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں\n\nشان آنکھوں میں نہ جچتی تھی جہانداروں کی\nکلمہ پڑھتے تھے ہمیں چھاؤں میں تلواروں کی\n\nہم جو جیتے تھے تو جنگوں کی مصیبت کے لیے\nاور مرتے تھے ترے نام کی عظمت کے لیے\n\nتھی نہ کچھ تیغ زنی اپنی حکومت کے لیے\nسر بکف پھرتے تھے کیا دہر میں دولت کے لیے\n\nقوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی",
    "TRANSLATION_EN": "We gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts\n\nThe glory of world-rulers did not fit in our eyes\nWe recited the Kalima in the shade of swords\n\nIf we lived, it was for the affliction of wars\nAnd we died for the greatness of Your name\n\nOur sword-fighting was not for our own rule\nWe wandered with head in hand—was it for worldly wealth?\n\nOur nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00135",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "قوم اپنی جو زرو و مال جہاں پر مرتی",
    "TITLE_EN": "Our nation which died for the world's gold and wealth",
    "CONTENT": "قوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی\n\nٹل نہ سکتے تھے اگر جنگ میں اڑ جاتے تھے\nپاؤں شیروں کے بھی میداں سے اکھڑ جاتے تھے\n\nتجھ سے سرکش ہوا کوئی تو بگڑ جاتے تھے\nتیغ کیا چیز ہے ہم توپ سے لڑ جاتے تھے\n\nنقش توحید کا ہر دل پہ بٹھایا ہم نے\nزیر خنجر بھی یہ پیغام سنایا ہم نے",
    "TRANSLATION_EN": "Our nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?\n\nWe would not retreat; in battle, we would fly\nThe feet of lions would be uprooted from the field\n\nIf anyone was rebellious toward You, we would be enraged\nWhat is a sword? We would fight with cannons\n\nWe impressed the image of monotheism on every heart\nEven under the dagger, we conveyed this message",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00136",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تو ہی کہہ دے کہ اکھاڑا در خبیر کس نے",
    "TITLE_EN": "You say, who uprooted the door of Khaybar?",
    "CONTENT": "تو ہی کہہ دے کہ اکھاڑا در خبیر کس نے\nشہر قیصر کا جو تھا اس کو کیا سر کس نے\n\nتوڑے مخلوق خداوندوں کے پیکر کس نے\nکاٹ کر رکھ دئیے کفار کے لشکر کس نے\n\nکس نے ٹھنڈا کیا آتشکدۂ ایراں کو\nکس نے پھر زندہ کیا تذکرۂ یزداں کو\n\nکون سی قوم فقط تیری طلب گار ہوئی\nاور تیرے لیے زحمت کش پیکار ہوئی",
    "TRANSLATION_EN": "You say, who uprooted the door of Khaybar?\nWho cut off the head of Caesar's city?\n\nWho broke the idols of god-like beings?\nWho cut down the armies of the infidels?\n\nWho cooled the fire-temple of Iran?\nWho revived the mention of Yazdan?\n\nWhich nation became solely Your seeker?\nAnd for You took the trouble of warfare?",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00137",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کس کی شمشیر جہانگیر جہاں دار ہوئی",
    "TITLE_EN": "Whose world-conquering sword became world-ruling?",
    "CONTENT": "کس کی شمشیر جہانگیر جہاں دار ہوئی\nکس کی تکبیر سے دنیا تری بیدار ہوئی\n\nکس کی ہیبت سے صنم سہمے ہوئے رہتے تھے\nمنہ کے بل گر کے ہو اللہ احد کہتے تھے\n\nآ گیا عین لڑائی میں اگر وقت نماز\nقبلہ رو ہو کے زمیں بوس ہوئی قوم حجاز\n\nایک ہی صف میں کھڑے ہو گئے محمود و ایاز\nنہ کوئی بندہ رہا اور نہ کوئی بندہ نواز",
    "TRANSLATION_EN": "Whose world-conquering sword became world-ruling?\nBy whose cry of Allahu Akbar did Your world awaken?\n\nBy whose awe did idols remain terrified?\nFalling on their faces, they cried \"Allah is One\"\n\nIf the time for prayer came in the midst of battle\nFacing the Qibla, the people of Hejaz bowed to the earth\n\nIn one row stood Mahmud and Ayaz\nNo master remained, no servant remained",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00138",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بندہ و صاحب و محتاج و غنی ایک ہوئے",
    "TITLE_EN": "Servant and master, needy and rich, became one",
    "CONTENT": "بندہ و صاحب و محتاج و غنی ایک ہوئے\nتیری سرکار میں پہنچے تو سبھی ایک ہوئے\n\nمحفل کون و مکاں میں سحر و شام پھرے\nمئے توحید کو لے کر صفت جام پھرے\n\nکوہ میں دشت میں لے کر ترا پیغام پھرے\nاور معلوم ہے تجھ کو کبھی ناکام پھرے\n\nدشت تو دشت ہیں دریا بھی نہ چھوڑے ہم نے\nبحر ظلمات میں دوڑا دئیے گھوڑے ہم نے",
    "TRANSLATION_EN": "Servant and master, needy and rich, became one\nWhen they reached Your court, all became one\n\nIn the assembly of existence, morning and evening they wandered\nCarrying the wine of monotheism like a cup they wandered\n\nIn mountains and deserts, carrying Your message they wandered\nAnd You know, they never wandered in vain\n\nDeserts we crossed, and rivers too we did not leave\nInto the sea of darkness, we spurred our horses",
    "notes": "This ghazal content is sourced from verified published or online sources (e.g., Rekhta.org, Archive.org). AI assistance was used only for tokenization and structured JSON generation. All text, RADIF, QAAFIYA, and translations have been manually verified for accuracy."
  },
  {
    "TEXT_ID": "iqbal_00141",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "خندہ زن کفر ہے احساس تجھے ہے کہ نہیں",
    "TITLE_EN": "Disbelief laughs, do you feel it or not?",
    "CONTENT": "خندہ زن کفر ہے احساس تجھے ہے کہ نہیں\nاپنی توحید کا کچھ پاس تجھے ہے کہ نہیں\n\nیہ شکایت نہیں ہیں ان کے خزانے معمور\nنہیں محفل میں جنہیں بات بھی کرنے کا شعور\n\nقہر تو یہ ہے کہ کافر کو ملیں حور و قصور\nاور بیچارے مسلماں کو فقط وعدۂ حور\n\nاب وہ الطاف نہیں ہم پہ عنایات نہیں\nبات یہ کیا ہے کہ پہلی سی مدارات نہیں\n\nکیوں مسلمانوں میں ہے دولت دنیا نایاب\nتیری قدرت تو ہے وہ جس کی نہ حد ہے نہ حساب",
    "TRANSLATION_EN": "Disbelief laughs, do you feel it or not?\nDo you have any regard for your monotheism or not?\n\nThis is no complaint that their treasures are full\nOf those who have no sense even to speak in gatherings\n\nThe tyranny is that the infidel gets houris and palaces\nAnd the poor Muslim only gets the promise of houris\n\nNow those favors are no more, no blessings upon us\nWhat is this matter, that former regard is no more?\n\nWhy is the wealth of the world rare among Muslims?\nYour power is such that has no limit, no account"
  },
  {
    "TEXT_ID": "iqbal_00142",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کیوں مسلمانوں میں ہے دولت دنیا نایاب",
    "TITLE_EN": "Why is the wealth of the world rare among Muslims?",
    "CONTENT": "کیوں مسلمانوں میں ہے دولت دنیا نایاب\nتیری قدرت تو ہے وہ جس کی نہ حد ہے نہ حساب\n\nتو جو چاہے تو اٹھے سینۂ صحرا سے حباب\nرہرو دشت ہو سیلی زدۂ موج سراب\n\nطعن اغیار ہے رسوائی ہے ناداری ہے\nکیا ترے نام پہ مرنے کا عوض خواری ہے\n\nبنی اغیار کی اب چاہنے والی دنیا\nرہ گئی اپنے لیے ایک خیالی دنیا\n\nہم تو رخصت ہوئے اوروں نے سنبھالی دنیا\nپھر نہ کہنا ہوئی توحید سے خالی دنیا\n\nہم تو جیتے ہیں کہ دنیا میں ترا نام رہے\nکہیں ممکن ہے کہ ساقی نہ رہے جام رہے",
    "TRANSLATION_EN": "Why is the wealth of the world rare among Muslims?\nYour power is such that has no limit, no account\n\nIf You wish, bubbles rise from the breast of the desert\nThe desert wanderer becomes drenched by the wave of mirage\n\nThere is taunt of rivals, disgrace, poverty\nIs humiliation the reward for dying in Your name?\n\nThe world now desires to serve rivals\nFor ourselves, only an imaginary world remains\n\nWe departed, others took over the world\nThen do not say the world became empty of monotheism\n\nWe live only that Your name remains in the world\nPerhaps it's possible that if the cupbearer remains no more, the cup remains"
  },
  {
    "TEXT_ID": "iqbal_00143",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہم تو رخصت ہوئے اوروں نے سنبھالی دنیا",
    "TITLE_EN": "We departed, others took over the world",
    "CONTENT": "ہم تو رخصت ہوئے اوروں نے سنبھالی دنیا\nپھر نہ کہنا ہوئی توحید سے خالی دنیا\n\nہم تو جیتے ہیں کہ دنیا میں ترا نام رہے\nکہیں ممکن ہے کہ ساقی نہ رہے جام رہے\n\nتیری محفل بھی گئی چاہنے والے بھی گئے\nشب کی آہیں بھی گئیں صبح کے نالے بھی گئے\n\nدل تجھے دے بھی گئے اپنا صلہ لے بھی گئے\nآ کے بیٹھے بھی نہ تھے اور نکالے بھی گئے\n\nآئے عشاق گئے وعدۂ فردا لے کر\nاب انہیں ڈھونڈ چراغ رخ زیبا لے کر",
    "TRANSLATION_EN": "We departed, others took over the world\nThen do not say the world became empty of monotheism\n\nWe live only that Your name remains in the world\nPerhaps it's possible that if the cupbearer remains no more, the cup remains\n\nYour assembly is gone, the lovers are gone\nNight's sighs are gone, morning's laments are gone\n\nThey gave their hearts to You, took their reward and went\nThey hadn't even sat down when they were turned out\n\nLovers came and went, taking the promise of tomorrow\nNow search for them, taking the lamp of beautiful face"
  },
  {
    "TEXT_ID": "iqbal_00144",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "آئے عشاق گئے وعدۂ فردا لے کر",
    "TITLE_EN": "Lovers came and went, taking the promise of tomorrow",
    "CONTENT": "آئے عشاق گئے وعدۂ فردا لے کر\nاب انہیں ڈھونڈ چراغ رخ زیبا لے کر\n\nدرد لیلیٰ بھی وہی قیس کا پہلو بھی وہی\nنجد کے دشت و جبل میں رم آہو بھی وہی\n\nعشق کا دل بھی وہی حسن کا جادو بھی وہی\nامت احمد مرسل بھی وہی تو بھی وہی\n\nپھر یہ آزردگی غیر سبب کیا معنی\nاپنے شیداؤں پہ یہ چشم غضب کیا معنی",
    "TRANSLATION_EN": "Lovers came and went, taking the promise of tomorrow\nNow search for them, taking the lamp of beautiful face\n\nThe pain of Laila is the same, the manner of Qais is the same\nIn the deserts and mountains of Najd, the deer's movement is the same\n\nLove's heart is the same, beauty's magic is the same\nThe community of Ahmad the Messenger is the same, You are the same\n\nThen what is this displeasure without reason?\nWhat is this angry glance at your devotees?"
  },
  {
    "TEXT_ID": "iqbal_00145",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تجھ کو چھوڑا کہ رسول عربی کو چھوڑا",
    "TITLE_EN": "We left You? We left the Arab Messenger?",
    "CONTENT": "تجھ کو چھوڑا کہ رسول عربی کو چھوڑا\nبت گری پیشہ کیا بت شکنی کو چھوڑا\n\nعشق کو عشق کی آشفتہ سری کو چھوڑا\nرسم سلمان و اویس قرنی کو چھوڑا\n\nآگ تکبیر کی سینوں میں دبی رکھتے ہیں\nزندگی مثل بلال حبشی رکھتے ہیں\n\nعشق کی خیر وہ پہلی سی ادا بھی نہ سہی\nجادہ پیمائی تسلیم و رضا بھی نہ سہی",
    "TRANSLATION_EN": "We left You? We left the Arab Messenger?\nMade idol-worship our profession, left iconoclasm?\n\nLeft love, left the madness of love?\nLeft the tradition of Salman and Uwais Qarni?\n\nWe keep the fire of Allahu Akbar hidden in our breasts\nWe live our life like Bilal the Abyssinian\n\nLove's well-being—that former style is no more\nThe path-treading of submission and acceptance is no more"
  },
  {
    "TEXT_ID": "iqbal_00146",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "مضطرب دل صفت قبلہ نما بھی نہ سہی",
    "TITLE_EN": "The restless heart, like a compass, is no more",
    "CONTENT": "مضطرب دل صفت قبلہ نما بھی نہ سہی\nاور پابندی آئین وفا بھی نہ سہی\n\nکبھی ہم سے کبھی غیروں سے شناسائی ہے\nبات کہنے کی نہیں تو بھی تو ہرجائی ہے\n\nسر فاراں پہ کیا دین کو کامل تو نے\nاک اشارے میں ہزاروں کے لیے دل تو نے\n\nآتش اندوز کیا عشق کا حاصل تو نے\nپھونک دی گرمی رخسار سے محفل تو نے",
    "TRANSLATION_EN": "The restless heart, like a compass, is no more\nAnd adherence to the covenant of fidelity is no more\n\nSometimes with us, sometimes with strangers is acquaintance\nNo need to say—You too are fickle\n\nOn Mount Faran, You perfected the religion\nWith one gesture, won thousands of hearts\n\nYou made love's essence fire-absorbing\nWith the warmth of Your cheek, You burned the assembly"
  },
  {
    "TEXT_ID": "iqbal_00147",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "آج کیوں سینے ہمارے شرر آباد نہیں",
    "TITLE_EN": "Why are our breasts not filled with sparks today?",
    "CONTENT": "آج کیوں سینے ہمارے شرر آباد نہیں\nہم وہی سوختہ ساماں ہیں تجھے یاد نہیں\n\nوادی نجد میں وہ شور سلاسل نہ رہا\nقیس دیوانۂ نظارۂ محمل نہ رہا\n\nحوصلے وہ نہ رہے ہم نہ رہے دل نہ رہا\nگھر یہ اجڑا ہے کہ تو رونق محفل نہ رہا",
    "TRANSLATION_EN": "Why are our breasts not filled with sparks today?\nWe are the same burnt offerings—do You not remember?\n\nIn the valley of Najd, that clamor of chains is no more\nQais, maddened by the sight of the camel-litter, is no more\n\nThose aspirations are no more, we are no more, the heart is no more\nThis house is ruined because you, the splendor of the assembly, are no more"
  },
  {
    "TEXT_ID": "iqbal_00148",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "دور ہنگامۂ گلزار سے یکسو بیٹھے",
    "TITLE_EN": "Away from the clamor of the garden, to one side they sit",
    "CONTENT": "دور ہنگامۂ گلزار سے یکسو بیٹھے\nتیرے دیوانے بھی ہیں منتظر ہو بیٹھے\n\nاپنے پروانوں کو پھر ذوق خود افروزی دے\nبرق دیرینہ کو فرمان جگر سوزی دے\n\nقوم آوارہ عناں تاب ہے پھر سوئے حجاز\nلے اڑا بلبل بے پر کو مذاق پرواز\n\nمضطرب باغ کے ہر غنچے میں ہے بوئے نیاز\nتو ذرا چھیڑ تو دے تشنۂ مضراب ہے ساز",
    "TRANSLATION_EN": "Away from the clamor of the garden, to one side they sit\nYour mad lovers too, waiting, sit\n\nGive your moths again the desire for self-immolation\nGive the ancient lightning the command of heart-searing\n\nThe wandering nation, reins in hand, turns again towards Hejaz\nThe joke of flight carries away the wingless nightingale\n\nIn every bud of the restless garden is the scent of supplication\nJust strike up—the thirsting instrument awaits the plectrum"
  },
  {
    "TEXT_ID": "iqbal_00149",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "نغمے بیتاب ہیں تاروں سے نکلنے کے لیے",
    "TITLE_EN": "Melodies are restless to emerge from strings",
    "CONTENT": "نغمے بیتاب ہیں تاروں سے نکلنے کے لیے\nطور مضطر ہے اسی آگ میں جلنے کے لیے\n\nمشکلیں امت مرحوم کی آساں کر دے\nمور بے مایہ کو ہمدوش سلیماں کر دے\n\nجنس نایاب محبت کو پھر ارزاں کر دے\nہند کے دیر نشینوں کو مسلماں کر دے\n\nجوئے خوں می چکد از حسرت دیرینۂ ما\nمی تپد نالہ بہ نشتر کدۂ سینۂ ما",
    "TRANSLATION_EN": "Melodies are restless to emerge from strings\nThe burning bush is restless to burn in that fire\n\nMake easy the difficulties of the departed community\nMake the resourceless ant equal companion to Solomon\n\nMake the rare commodity of love abundant again\nMake the temple-dwellers of India into Muslims\n\nA stream of blood flows from our ancient longing\nOur lament throbs in the lancet-house of our breast"
  },
  {
    "TEXT_ID": "iqbal_00150",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بوئے گل لے گئی بیرون چمن راز چمن",
    "TITLE_EN": "The scent of the flower carried the garden's secret outside",
    "CONTENT": "بوئے گل لے گئی بیرون چمن راز چمن\nکیا قیامت ہے کہ خود پھول ہیں غماز چمن\n\nعہد گل ختم ہوا ٹوٹ گیا ساز چمن\nاڑ گئے ڈالیوں سے زمزمہ پرداز چمن\n\nایک بلبل ہے کہ ہے محو ترنم اب تک\nاس کے سینے میں ہے نغموں کا تلاطم اب تک\n\nقمریاں شاخ صنوبر سے گریزاں بھی ہوئیں\nپتیاں پھول کی جھڑ جھڑ کے پریشاں بھی ہوئیں\n\nوہ پرانی روشیں باغ کی ویراں بھی ہوئیں\nڈالیاں پیرہن برگ سے عریاں بھی ہوئیں",
    "TRANSLATION_EN": "The scent of the flower carried the garden's secret outside\nWhat a calamity—the flowers themselves are informers of the garden\n\nThe era of roses ended, the garden's instrument broke\nThe melodious ones flew from the branches\n\nOne nightingale remains, absorbed in song still\nIn its breast, the turbulence of melodies still\n\nThe doves have become averse to the cypress branch\nThe flower petals, falling, have become scattered\n\nThose old ways of the garden have become desolate\nThe branches have become bare of the garment of leaves"
  },
  {
    "TEXT_ID": "iqbal_00151",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "قید موسم سے طبیعت رہی آزاد اس کی",
    "TITLE_EN": "Its nature remained free from the imprisonment of seasons",
    "CONTENT": "قید موسم سے طبیعت رہی آزاد اس کی\nکاش گلشن میں سمجھتا کوئی فریاد اس کی\n\nلطف مرنے میں ہے باقی نہ مزہ جینے میں\nکچھ مزہ ہے تو یہی خون جگر پینے میں\n\nکتنے بیتاب ہیں جوہر مرے آئینے میں\nکس قدر جلوے تڑپتے ہیں مرے سینے میں\n\nاس گلستاں میں مگر دیکھنے والے ہی نہیں\nداغ جو سینے میں رکھتے ہوں وہ لالے ہی نہیں",
    "TRANSLATION_EN": "Its nature remained free from the imprisonment of seasons\nIf only someone in the garden understood its cry\n\nThe pleasure remains in dying, not the taste in living\nIf there's any taste, it's in drinking the blood of the liver\n\nHow restless are the essences in my mirror\nHow many radiances tremble in my breast\n\nIn this garden, there are no observers though\nThere are no tulips bearing scars in their breasts"
  },
  {
    "TEXT_ID": "iqbal_00152",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "یعنی پھر زندہ نئے عہد وفا سے دل ہوں",
    "TITLE_EN": "That is, I am hearts revived by a new era of fidelity",
    "CONTENT": "یعنی پھر زندہ نئے عہد وفا سے دل ہوں\nپھر اسی بادۂ دیرینہ کے پیاسے دل ہوں\n\nعجمی خم ہے تو کیا مے تو حجازی ہے مری\nنغمہ ہندی ہے تو کیا لے تو حجازی ہے مری\n\nکیوں زیاں کار بنوں سود فراموش رہوں\nفکر فردا نہ کروں محو غم دوش رہوں\n\nنالے بلبل کے سنوں اور ہمہ تن گوش رہوں\nہم نوا میں بھی کوئی گل ہوں کہ خاموش رہوں",
    "TRANSLATION_EN": "That is, I am hearts revived by a new era of fidelity\nAgain, I am hearts thirsty for that ancient wine\n\nIf the vessel is Persian, so what—my wine is Hejazi\nIf the song is Indian, so what—my melody is Hejazi\n\nWhy should I remain a loser, forgetful of profit?\nWhy should I not think of tomorrow, absorbed in yesterday's grief?\n\nShould I listen to the nightingale's laments and remain all ears?\nIn harmony, am I a flower that I should remain silent?"
  },
  {
    "TEXT_ID": "iqbal_00153",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "جرأت آموز مری تاب سخن ہے مجھ کو",
    "TITLE_EN": "My power of speech has taught me audacity",
    "CONTENT": "جرأت آموز مری تاب سخن ہے مجھ کو\nشکوہ اللہ سے خاکم بدہن ہے مجھ کو\n\nہے بجا شیوۂ تسلیم میں مشہور ہیں ہم\nقصۂ درد سناتے ہیں کہ مجبور ہیں ہم\n\nساز خاموش ہیں فریاد سے معمور ہیں ہم\nنالہ آتا ہے اگر لب پہ تو معذور ہیں ہم\n\nاے خدا شکوۂ ارباب وفا بھی سن لے\nخوگر حمد سے تھوڑا سا گلہ بھی سن لے",
    "TRANSLATION_EN": "My power of speech has taught me audacity\nI complain to God—may dust be in my mouth\n\nIt is right that we are famous for the style of submission\nWe tell tales of pain because we are helpless\n\nThe instruments are silent, we are filled with lament\nIf a cry comes to our lips, we are excused\n\nO God, listen also to the complaint of the faithful\nFrom one accustomed to praise, listen to a little complaint too"
  },
  {
    "TEXT_ID": "iqbal_00154",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "شرط انصاف ہے اے صاحب الطاف عمیم",
    "TITLE_EN": "It is a condition of justice, O possessor of abundant grace",
    "CONTENT": "شرط انصاف ہے اے صاحب الطاف عمیم\nبوئے گل پھیلتی کس طرح جو ہوتی نہ نسیم\n\nہم کو جمعیت خاطر یہ پریشانی تھی\nورنہ امت ترے محبوب کی دیوانی تھی\n\nہم سے پہلے تھا عجب تیرے جہاں کا منظر\nکہیں مسجود تھے پتھر کہیں معبود شجر\n\nخوگر پیکر محسوس تھی انساں کی نظر\nمانتا پھر کوئی ان دیکھے خدا کو کیونکر\n\nتجھ کو معلوم ہے لیتا تھا کوئی نام ترا\nقوت بازوئے مسلم نے کیا کام ترا",
    "TRANSLATION_EN": "It is a condition of justice, O possessor of abundant grace\nHow would the flower's scent spread if there were no breeze?\n\nWe had this restlessness of heart\nOtherwise the community of Your beloved was devoted\n\nBefore us was a strange scene in Your world\nHere stones were worshipped, there trees were adored\n\nHuman vision was accustomed to tangible forms\nHow then could anyone believe in an unseen God?\n\nYou know, someone used to take Your name\nWhat did the power of the Muslim's arm accomplish for You?"
  },
  {
    "TEXT_ID": "iqbal_00156",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "شان آنکھوں میں نہ جچتی تھی جہانداروں کی",
    "TITLE_EN": "The glory of world-rulers did not fit in our eyes",
    "CONTENT": "شان آنکھوں میں نہ جچتی تھی جہانداروں کی\nکلمہ پڑھتے تھے ہمیں چھاؤں میں تلواروں کی\n\nہم جو جیتے تھے تو جنگوں کی مصیبت کے لیے\nاور مرتے تھے ترے نام کی عظمت کے لیے\n\nتھی نہ کچھ تیغ زنی اپنی حکومت کے لیے\nسر بکف پھرتے تھے کیا دہر میں دولت کے لیے\n\nقوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی\n\nٹل نہ سکتے تھے اگر جنگ میں اڑ جاتے تھے\nپاؤں شیروں کے بھی میداں سے اکھڑ جاتے تھے\n\nتجھ سے سرکش ہوا کوئی تو بگڑ جاتے تھے\nتیغ کیا چیز ہے ہم توپ سے لڑ جاتے تھے",
    "TRANSLATION_EN": "The glory of world-rulers did not fit in our eyes\nWe recited the Kalima in the shade of swords\n\nIf we lived, it was for the affliction of wars\nAnd we died for the greatness of Your name\n\nOur sword-fighting was not for our own rule\nWe wandered with head in hand—was it for worldly wealth?\n\nOur nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?\n\nWe would not retreat; in battle, we would fly\nThe feet of lions would be uprooted from the field\n\nIf anyone was rebellious toward You, we would be enraged\nWhat is a sword? We would fight with cannons"
  },
  {
    "TEXT_ID": "iqbal_00157",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تجھ سے سرکش ہوا کوئی تو بگڑ جاتے تھے",
    "TITLE_EN": "If anyone was rebellious toward You, we would be enraged",
    "CONTENT": "تجھ سے سرکش ہوا کوئی تو بگڑ جاتے تھے\nتیغ کیا چیز ہے ہم توپ سے لڑ جاتے تھے\n\nنقش توحید کا ہر دل پہ بٹھایا ہم نے\nزیر خنجر بھی یہ پیغام سنایا ہم نے\n\nتو ہی کہہ دے کہ اکھاڑا در خبیر کس نے\nشہر قیصر کا جو تھا اس کو کیا سر کس نے\n\nتوڑے مخلوق خداوندوں کے پیکر کس نے\nکاٹ کر رکھ دئیے کفار کے لشکر کس نے\n\nکس نے ٹھنڈا کیا آتشکدۂ ایراں کو\nکس نے پھر زندہ کیا تذکرۂ یزداں کو",
    "TRANSLATION_EN": "If anyone was rebellious toward You, we would be enraged\nWhat is a sword? We would fight with cannons\n\nWe impressed the image of monotheism on every heart\nEven under the dagger, we conveyed this message\n\nYou say, who uprooted the door of Khaybar?\nWho cut off the head of Caesar's city?\n\nWho broke the idols of god-like beings?\nWho cut down the armies of the infidels?\n\nWho cooled the fire-temple of Iran?\nWho revived the mention of Yazdan?"
  },
  {
    "TEXT_ID": "iqbal_00158",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کون سی قوم فقط تیری طلب گار ہوئی",
    "TITLE_EN": "Which nation became solely Your seeker?",
    "CONTENT": "کون سی قوم فقط تیری طلب گار ہوئی\nاور تیرے لیے زحمت کش پیکار ہوئی\n\nکس کی شمشیر جہانگیر جہاں دار ہوئی\nکس کی تکبیر سے دنیا تری بیدار ہوئی\n\nکس کی ہیبت سے صنم سہمے ہوئے رہتے تھے\nمنہ کے بل گر کے ہو اللہ احد کہتے تھے\n\nآ گیا عین لڑائی میں اگر وقت نماز\nقبلہ رو ہو کے زمیں بوس ہوئی قوم حجاز\n\nایک ہی صف میں کھڑے ہو گئے محمود و ایاز\nنہ کوئی بندہ رہا اور نہ کوئی بندہ نواز",
    "TRANSLATION_EN": "Which nation became solely Your seeker?\nAnd for You took the trouble of warfare?\n\nWhose world-conquering sword became world-ruling?\nBy whose cry of Allahu Akbar did Your world awaken?\n\nBy whose awe did idols remain terrified?\nFalling on their faces, they cried \"Allah is One\"\n\nIf the time for prayer came in the midst of battle\nFacing the Qibla, the people of Hejaz bowed to the earth\n\nIn one row stood Mahmud and Ayaz\nNo master remained, no servant remained"
  },
  {
    "TEXT_ID": "iqbal_00160",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تیرے کعبے کو جبینوں سے بسایا ہم نے",
    "TITLE_EN": "We populated Your Kaaba with our foreheads",
    "CONTENT": "تیرے کعبے کو جبینوں سے بسایا ہم نے\nتیرے قرآن کو سینوں سے لگایا ہم نے\n\nپھر بھی ہم سے یہ گلہ ہے کہ وفادار نہیں\nہم وفادار نہیں تو بھی تو دل دار نہیں\n\nامتیں اور بھی ہیں ان میں گنہ گار بھی ہیں\nعجز والے بھی ہیں مست مئے پندار بھی ہیں\n\nان میں کاہل بھی ہیں غافل بھی ہیں ہشیار بھی ہیں\nسیکڑوں ہیں کہ ترے نام سے بے زار بھی ہیں",
    "TRANSLATION_EN": "We populated Your Kaaba with our foreheads\nWe attached Your Quran to our breasts\n\nYet You complain that we are not loyal\nWe are not loyal, but You too are not loving\n\nThere are other communities, among them sinners too\nThere are humble ones, and those drunk with pride too\n\nAmong them are the lazy, the heedless, the vigilant too\nThere are hundreds who are averse to Your name too"
  },
  {
    "TEXT_ID": "iqbal_00161",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "رحمتیں ہیں تری اغیار کے کاشانوں پر",
    "TITLE_EN": "Your mercies are on the houses of rivals",
    "CONTENT": "رحمتیں ہیں تری اغیار کے کاشانوں پر\nبرق گرتی ہے تو بیچارے مسلمانوں پر\n\nبت صنم خانوں میں کہتے ہیں مسلمان گئے\nہے خوشی ان کو کہ کعبے کے نگہبان گئے\n\nمنزل دہر سے اونٹوں کے حدی خوان گئے\nاپنی بغلوں میں دبائے ہوئے قرآن گئے\n\nخندہ زن کفر ہے احساس تجھے ہے کہ نہیں\nاپنی توحید کا کچھ پاس تجھے ہے کہ نہیں",
    "TRANSLATION_EN": "Your mercies are on the houses of rivals\nLightning falls on poor Muslims\n\nIn the temples, the idols say the Muslims have gone\nThey are happy that the guardians of the Kaaba have gone\n\nThe reciters of elegies have gone from the worldly abode\nPressing the Quran to their armpits, they have gone\n\nDisbelief laughs, do you feel it or not?\nDo you have any regard for your monotheism or not?"
  },
  {
    "TEXT_ID": "iqbal_00163",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تو جو چاہے تو اٹھے سینۂ صحرا سے حباب",
    "TITLE_EN": "If You wish, bubbles rise from the breast of the desert",
    "CONTENT": "تو جو چاہے تو اٹھے سینۂ صحرا سے حباب\nرہرو دشت ہو سیلی زدۂ موج سراب\n\nطعن اغیار ہے رسوائی ہے ناداری ہے\nکیا ترے نام پہ مرنے کا عوض خواری ہے\n\nبنی اغیار کی اب چاہنے والی دنیا\nرہ گئی اپنے لیے ایک خیالی دنیا\n\nہم تو رخصت ہوئے اوروں نے سنبھالی دنیا\nپھر نہ کہنا ہوئی توحید سے خالی دنیا\n\nہم تو جیتے ہیں کہ دنیا میں ترا نام رہے\nکہیں ممکن ہے کہ ساقی نہ رہے جام رہے",
    "TRANSLATION_EN": "If You wish, bubbles rise from the breast of the desert\nThe desert wanderer becomes drenched by the wave of mirage\n\nThere is taunt of rivals, disgrace, poverty\nIs humiliation the reward for dying in Your name?\n\nThe world now desires to serve rivals\nFor ourselves, only an imaginary world remains\n\nWe departed, others took over the world\nThen do not say the world became empty of monotheism\n\nWe live only that Your name remains in the world\nPerhaps it's possible that if the cupbearer remains no more, the cup remains"
  },
  {
    "TEXT_ID": "iqbal_00164",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہم تو جیتے ہیں کہ دنیا میں ترا نام رہے",
    "TITLE_EN": "We live only that Your name remains in the world",
    "CONTENT": "ہم تو جیتے ہیں کہ دنیا میں ترا نام رہے\nکہیں ممکن ہے کہ ساقی نہ رہے جام رہے\n\nتیری محفل بھی گئی چاہنے والے بھی گئے\nشب کی آہیں بھی گئیں صبح کے نالے بھی گئے\n\nدل تجھے دے بھی گئے اپنا صلہ لے بھی گئے\nآ کے بیٹھے بھی نہ تھے اور نکالے بھی گئے\n\nآئے عشاق گئے وعدۂ فردا لے کر\nاب انہیں ڈھونڈ چراغ رخ زیبا لے کر\n\nدرد لیلیٰ بھی وہی قیس کا پہلو بھی وہی\nنجد کے دشت و جبل میں رم آہو بھی وہی\n\nعشق کا دل بھی وہی حسن کا جادو بھی وہی\nامت احمد مرسل بھی وہی تو بھی وہی",
    "TRANSLATION_EN": "We live only that Your name remains in the world\nPerhaps it's possible that if the cupbearer remains no more, the cup remains\n\nYour assembly is gone, the lovers are gone\nNight's sighs are gone, morning's laments are gone\n\nThey gave their hearts to You, took their reward and went\nThey hadn't even sat down when they were turned out\n\nLovers came and went, taking the promise of tomorrow\nNow search for them, taking the lamp of beautiful face\n\nThe pain of Laila is the same, the manner of Qais is the same\nIn the deserts and mountains of Najd, the deer's movement is the same\n\nLove's heart is the same, beauty's magic is the same\nThe community of Ahmad the Messenger is the same, You are the same"
  },
  {
    "TEXT_ID": "iqbal_00165",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "درد لیلیٰ بھی وہی قیس کا پہلو بھی وہی",
    "TITLE_EN": "The pain of Laila is the same, the manner of Qais is the same",
    "CONTENT": "درد لیلیٰ بھی وہی قیس کا پہلو بھی وہی\nنجد کے دشت و جبل میں رم آہو بھی وہی\n\nعشق کا دل بھی وہی حسن کا جادو بھی وہی\nامت احمد مرسل بھی وہی تو بھی وہی\n\nپھر یہ آزردگی غیر سبب کیا معنی\nاپنے شیداؤں پہ یہ چشم غضب کیا معنی\n\nتجھ کو چھوڑا کہ رسول عربی کو چھوڑا\nبت گری پیشہ کیا بت شکنی کو چھوڑا\n\nعشق کو عشق کی آشفتہ سری کو چھوڑا\nرسم سلمان و اویس قرنی کو چھوڑا",
    "TRANSLATION_EN": "The pain of Laila is the same, the manner of Qais is the same\nIn the deserts and mountains of Najd, the deer's movement is the same\n\nLove's heart is the same, beauty's magic is the same\nThe community of Ahmad the Messenger is the same, You are the same\n\nThen what is this displeasure without reason?\nWhat is this angry glance at your devotees?\n\nWe left You? We left the Arab Messenger?\nMade idol-worship our profession, left iconoclasm?\n\nLeft love, left the madness of love?\nLeft the tradition of Salman and Uwais Qarni?"
  },
  {
    "TEXT_ID": "iqbal_00166",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عشق کو عشق کی آشفتہ سری کو چھوڑا",
    "TITLE_EN": "Left love, left the madness of love?",
    "CONTENT": "عشق کو عشق کی آشفتہ سری کو چھوڑا\nرسم سلمان و اویس قرنی کو چھوڑا\n\nآگ تکبیر کی سینوں میں دبی رکھتے ہیں\nزندگی مثل بلال حبشی رکھتے ہیں\n\nعشق کی خیر وہ پہلی سی ادا بھی نہ سہی\nجادہ پیمائی تسلیم و رضا بھی نہ سہی\n\nمضطرب دل صفت قبلہ نما بھی نہ سہی\nاور پابندی آئین وفا بھی نہ سہی\n\nکبھی ہم سے کبھی غیروں سے شناسائی ہے\nبات کہنے کی نہیں تو بھی تو ہرجائی ہے",
    "TRANSLATION_EN": "Left love, left the madness of love?\nLeft the tradition of Salman and Uwais Qarni?\n\nWe keep the fire of Allahu Akbar hidden in our breasts\nWe live our life like Bilal the Abyssinian\n\nLove's well-being—that former style is no more\nThe path-treading of submission and acceptance is no more\n\nThe restless heart, like a compass, is no more\nAnd adherence to the covenant of fidelity is no more\n\nSometimes with us, sometimes with strangers is acquaintance\nNo need to say—You too are fickle"
  },
  {
    "TEXT_ID": "iqbal_00168",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بادہ کش غیر ہیں گلشن میں لب جو بیٹھے",
    "TITLE_EN": "Wine-drinkers are strangers in the garden, sitting by the lip",
    "CONTENT": "بادہ کش غیر ہیں گلشن میں لب جو بیٹھے\nسنتے ہیں جام بکف نغمۂ کو کو بیٹھے\n\nدور ہنگامۂ گلزار سے یکسو بیٹھے\nتیرے دیوانے بھی ہیں منتظر ہو بیٹھے\n\nاپنے پروانوں کو پھر ذوق خود افروزی دے\nبرق دیرینہ کو فرمان جگر سوزی دے\n\nقوم آوارہ عناں تاب ہے پھر سوئے حجاز\nلے اڑا بلبل بے پر کو مذاق پرواز\n\nمضطرب باغ کے ہر غنچے میں ہے بوئے نیاز\nتو ذرا چھیڑ تو دے تشنۂ مضراب ہے ساز",
    "TRANSLATION_EN": "Wine-drinkers are strangers in the garden, sitting by the lip\nHearing the song of \"coo coo\" with cup in hand, they sit\n\nAway from the clamor of the garden, to one side they sit\nYour mad lovers too, waiting, sit\n\nGive your moths again the desire for self-immolation\nGive the ancient lightning the command of heart-searing\n\nThe wandering nation, reins in hand, turns again towards Hejaz\nThe joke of flight carries away the wingless nightingale\n\nIn every bud of the restless garden is the scent of supplication\nJust strike up—the thirsting instrument awaits the plectrum"
  },
  {
    "TEXT_ID": "iqbal_00170",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "عہد گل ختم ہوا ٹوٹ گیا ساز چمن",
    "TITLE_EN": "The era of roses ended, the garden's instrument broke",
    "CONTENT": "عہد گل ختم ہوا ٹوٹ گیا ساز چمن\nاڑ گئے ڈالیوں سے زمزمہ پرداز چمن\n\nایک بلبل ہے کہ ہے محو ترنم اب تک\nاس کے سینے میں ہے نغموں کا تلاطم اب تک\n\nقمریاں شاخ صنوبر سے گریزاں بھی ہوئیں\nپتیاں پھول کی جھڑ جھڑ کے پریشاں بھی ہوئیں\n\nوہ پرانی روشیں باغ کی ویراں بھی ہوئیں\nڈالیاں پیرہن برگ سے عریاں بھی ہوئیں\n\nقید موسم سے طبیعت رہی آزاد اس کی\nکاش گلشن میں سمجھتا کوئی فریاد اس کی",
    "TRANSLATION_EN": "The era of roses ended, the garden's instrument broke\nThe melodious ones flew from the branches\n\nOne nightingale remains, absorbed in song still\nIn its breast, the turbulence of melodies still\n\nThe doves have become averse to the cypress branch\nThe flower petals, falling, have become scattered\n\nThose old ways of the garden have become desolate\nThe branches have become bare of the garment of leaves\n\nIts nature remained free from the imprisonment of seasons\nIf only someone in the garden understood its cry"
  },
  {
    "TEXT_ID": "iqbal_00174",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ہم سے پہلے تھا عجب تیرے جہاں کا منظر",
    "TITLE_EN": "Before us was a strange scene in Your world",
    "CONTENT": "ہم سے پہلے تھا عجب تیرے جہاں کا منظر\nکہیں مسجود تھے پتھر کہیں معبود شجر\n\nخوگر پیکر محسوس تھی انساں کی نظر\nمانتا پھر کوئی ان دیکھے خدا کو کیونکر\n\nتجھ کو معلوم ہے لیتا تھا کوئی نام ترا\nقوت بازوئے مسلم نے کیا کام ترا\n\nبس رہے تھے یہیں سلجوق بھی تورانی بھی\nاہل چیں چین میں ایران میں ساسانی بھی\n\nاسی معمورے میں آباد تھے یونانی بھی\nاسی دنیا میں یہودی بھی تھے نصرانی بھی\n\nپر ترے نام پہ تلوار اٹھائی کس نے\nبات جو بگڑی ہوئی تھی وہ بنائی کس نے\n\nتھے ہمیں ایک ترے معرکہ آراؤں میں\nخشکیوں میں کبھی لڑتے کبھی دریاؤں میں\n\nدیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں",
    "TRANSLATION_EN": "Before us was a strange scene in Your world\nHere stones were worshipped, there trees were adored\n\nHuman vision was accustomed to tangible forms\nHow then could anyone believe in an unseen God?\n\nYou know, someone used to take Your name\nWhat did the power of the Muslim's arm accomplish for You?\n\nHere dwelt the Seljuqs and the Turanians too\nThe people of China in China, the Sasanians in Iran too\n\nIn this same habitation, the Greeks dwelt too\nIn this same world, there were Jews and Christians too\n\nBut who raised the sword for Your name?\nWho resolved the matter that was complicated?\n\nWe were among those in Your battlefields\nSometimes fighting on lands, sometimes on seas\n\nWe gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts"
  },
  {
    "TEXT_ID": "iqbal_00175",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "پر ترے نام پہ تلوار اٹھائی کس نے",
    "TITLE_EN": "But who raised the sword for Your name?",
    "CONTENT": "پر ترے نام پہ تلوار اٹھائی کس نے\nبات جو بگڑی ہوئی تھی وہ بنائی کس نے\n\nتھے ہمیں ایک ترے معرکہ آراؤں میں\nخشکیوں میں کبھی لڑتے کبھی دریاؤں میں\n\nدیں اذانیں کبھی یورپ کے کلیساؤں میں\nکبھی افریقہ کے تپتے ہوئے صحراؤں میں\n\nشان آنکھوں میں نہ جچتی تھی جہانداروں کی\nکلمہ پڑھتے تھے ہمیں چھاؤں میں تلواروں کی\n\nہم جو جیتے تھے تو جنگوں کی مصیبت کے لیے\nاور مرتے تھے ترے نام کی عظمت کے لیے\n\nتھی نہ کچھ تیغ زنی اپنی حکومت کے لیے\nسر بکف پھرتے تھے کیا دہر میں دولت کے لیے\n\nقوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی",
    "TRANSLATION_EN": "But who raised the sword for Your name?\nWho resolved the matter that was complicated?\n\nWe were among those in Your battlefields\nSometimes fighting on lands, sometimes on seas\n\nWe gave calls to prayer in Europe's churches\nSometimes in Africa's burning deserts\n\nThe glory of world-rulers did not fit in our eyes\nWe recited the Kalima in the shade of swords\n\nIf we lived, it was for the affliction of wars\nAnd we died for the greatness of Your name\n\nOur sword-fighting was not for our own rule\nWe wandered with head in hand—was it for worldly wealth?\n\nOur nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?"
  },
  {
    "TEXT_ID": "iqbal_00176",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "تھی نہ کچھ تیغ زنی اپنی حکومت کے لیے",
    "TITLE_EN": "Our sword-fighting was not for our own rule",
    "CONTENT": "تھی نہ کچھ تیغ زنی اپنی حکومت کے لیے\nسر بکف پھرتے تھے کیا دہر میں دولت کے لیے\n\nقوم اپنی جو زرو و مال جہاں پر مرتی\nبت فروشی کے عوض بت شکنی کیوں کرتی\n\nٹل نہ سکتے تھے اگر جنگ میں اڑ جاتے تھے\nپاؤں شیروں کے بھی میداں سے اکھڑ جاتے تھے\n\nتجھ سے سرکش ہوا کوئی تو بگڑ جاتے تھے\nتیغ کیا چیز ہے ہم توپ سے لڑ جاتے تھے\n\nنقش توحید کا ہر دل پہ بٹھایا ہم نے\nزیر خنجر بھی یہ پیغام سنایا ہم نے",
    "TRANSLATION_EN": "Our sword-fighting was not for our own rule\nWe wandered with head in hand—was it for worldly wealth?\n\nOur nation which died for the world's gold and wealth\nWhy would it, in exchange for idol-selling, do idol-breaking?\n\nWe would not retreat; in battle, we would fly\nThe feet of lions would be uprooted from the field\n\nIf anyone was rebellious toward You, we would be enraged\nWhat is a sword? We would fight with cannons\n\nWe impressed the image of monotheism on every heart\nEven under the dagger, we conveyed this message"
  },
  {
    "TEXT_ID": "iqbal_00178",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "کس کی ہیبت سے صنم سہمے ہوئے رہتے تھے",
    "TITLE_EN": "By whose awe did idols remain terrified?",
    "CONTENT": "کس کی ہیبت سے صنم سہمے ہوئے رہتے تھے\nمنہ کے بل گر کے ہو اللہ احد کہتے تھے\n\nآ گیا عین لڑائی میں اگر وقت نماز\nقبلہ رو ہو کے زمیں بوس ہوئی قوم حجاز\n\nایک ہی صف میں کھڑے ہو گئے محمود و ایاز\nنہ کوئی بندہ رہا اور نہ کوئی بندہ نواز\n\nبندہ و صاحب و محتاج و غنی ایک ہوئے\nتیری سرکار میں پہنچے تو سبھی ایک ہوئے\n\nمحفل کون و مکاں میں سحر و شام پھرے\nمئے توحید کو لے کر صفت جام پھرے\n\nکوہ میں دشت میں لے کر ترا پیغام پھرے\nاور معلوم ہے تجھ کو کبھی ناکام پھرے\n\nدشت تو دشت ہیں دریا بھی نہ چھوڑے ہم نے\nبحر ظلمات میں دوڑا دئیے گھوڑے ہم نے",
    "TRANSLATION_EN": "By whose awe did idols remain terrified?\nFalling on their faces, they cried \"Allah is One\"\n\nIf the time for prayer came in the midst of battle\nFacing the Qibla, the people of Hejaz bowed to the earth\n\nIn one row stood Mahmud and Ayaz\nNo master remained, no servant remained\n\nServant and master, needy and rich, became one\nWhen they reached Your court, all became one\n\nIn the assembly of existence, morning and evening they wandered\nCarrying the wine of monotheism like a cup they wandered\n\nIn mountains and deserts, carrying Your message they wandered\nAnd You know, they never wandered in vain\n\nDeserts we crossed, and rivers too we did not leave\nInto the sea of darkness, we spurred our horses"
  },
  {
    "TEXT_ID": "iqbal_00180",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "امتیں اور بھی ہیں ان میں گنہ گار بھی ہیں",
    "TITLE_EN": "There are other communities, among them sinners too",
    "CONTENT": "امتیں اور بھی ہیں ان میں گنہ گار بھی ہیں\nعجز والے بھی ہیں مست مئے پندار بھی ہیں\n\nان میں کاہل بھی ہیں غافل بھی ہیں ہشیار بھی ہیں\nسیکڑوں ہیں کہ ترے نام سے بے زار بھی ہیں\n\nرحمتیں ہیں تری اغیار کے کاشانوں پر\nبرق گرتی ہے تو بیچارے مسلمانوں پر\n\nبت صنم خانوں میں کہتے ہیں مسلمان گئے\nہے خوشی ان کو کہ کعبے کے نگہبان گئے\n\nمنزل دہر سے اونٹوں کے حدی خوان گئے\nاپنی بغلوں میں دبائے ہوئے قرآن گئے",
    "TRANSLATION_EN": "There are other communities, among them sinners too\nThere are humble ones, and those drunk with pride too\n\nAmong them are the lazy, the heedless, the vigilant too\nThere are hundreds who are averse to Your name too\n\nYour mercies are on the houses of rivals\nLightning falls on poor Muslims\n\nIn the temples, the idols say the Muslims have gone\nThey are happy that the guardians of the Kaaba have gone\n\nThe reciters of elegies have gone from the worldly abode\nPressing the Quran to their armpits, they have gone"
  },
  {
    "TEXT_ID": "iqbal_00184",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "پھر یہ آزردگی غیر سبب کیا معنی",
    "TITLE_EN": "Then what is this displeasure without reason?",
    "CONTENT": "پھر یہ آزردگی غیر سبب کیا معنی\nاپنے شیداؤں پہ یہ چشم غضب کیا معنی\n\nتجھ کو چھوڑا کہ رسول عربی کو چھوڑا\nبت گری پیشہ کیا بت شکنی کو چھوڑا\n\nعشق کو عشق کی آشفتہ سری کو چھوڑا\nرسم سلمان و اویس قرنی کو چھوڑا\n\nآگ تکبیر کی سینوں میں دبی رکھتے ہیں\nزندگی مثل بلال حبشی رکھتے ہیں\n\nعشق کی خیر وہ پہلی سی ادا بھی نہ سہی\nجادہ پیمائی تسلیم و رضا بھی نہ سہی",
    "TRANSLATION_EN": "Then what is this displeasure without reason?\nWhat is this angry glance at your devotees?\n\nWe left You? We left the Arab Messenger?\nMade idol-worship our profession, left iconoclasm?\n\nLeft love, left the madness of love?\nLeft the tradition of Salman and Uwais Qarni?\n\nWe keep the fire of Allahu Akbar hidden in our breasts\nWe live our life like Bilal the Abyssinian\n\nLove's well-being—that former style is no more\nThe path-treading of submission and acceptance is no more"
  },
  {
    "TEXT_ID": "iqbal_00186",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وادی نجد میں وہ شور سلاسل نہ رہا",
    "TITLE_EN": "In the valley of Najd, that clamor of chains is no more",
    "CONTENT": "وادی نجد میں وہ شور سلاسل نہ رہا\nقیس دیوانۂ نظارۂ محمل نہ رہا\n\nحوصلے وہ نہ رہے ہم نہ رہے دل نہ رہا\nگھر یہ اجڑا ہے کہ تو رونق محفل نہ رہا\n\nبادہ کش غیر ہیں گلشن میں لب جو بیٹھے\nسنتے ہیں جام بکف نغمۂ کو کو بیٹھے\n\nدور ہنگامۂ گلزار سے یکسو بیٹھے\nتیرے دیوانے بھی ہیں منتظر ہو بیٹھے\n\nاپنے پروانوں کو پھر ذوق خود افروزی دے\nبرق دیرینہ کو فرمان جگر سوزی دے",
    "TRANSLATION_EN": "In the valley of Najd, that clamor of chains is no more\nQais, maddened by the sight of the camel-litter, is no more\n\nThose aspirations are no more, we are no more, the heart is no more\nThis house is ruined because you, the splendor of the assembly, are no more\n\nWine-drinkers are strangers in the garden, sitting by the lip\nHearing the song of \"coo coo\" with cup in hand, they sit\n\nAway from the clamor of the garden, to one side they sit\nYour mad lovers too, waiting, sit\n\nGive your moths again the desire for self-immolation\nGive the ancient lightning the command of heart-searing"
  },
  {
    "TEXT_ID": "iqbal_00188",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "جوئے خوں می چکد از حسرت دیرینۂ ما",
    "TITLE_EN": "A stream of blood flows from our ancient longing",
    "CONTENT": "جوئے خوں می چکد از حسرت دیرینۂ ما\nمی تپد نالہ بہ نشتر کدۂ سینۂ ما\n\nبوئے گل لے گئی بیرون چمن راز چمن\nکیا قیامت ہے کہ خود پھول ہیں غماز چمن\n\nعہد گل ختم ہوا ٹوٹ گیا ساز چمن\nاڑ گئے ڈالیوں سے زمزمہ پرداز چمن\n\nایک بلبل ہے کہ ہے محو ترنم اب تک\nاس کے سینے میں ہے نغموں کا تلاطم اب تک\n\nقمریاں شاخ صنوبر سے گریزاں بھی ہوئیں\nپتیاں پھول کی جھڑ جھڑ کے پریشاں بھی ہوئیں",
    "TRANSLATION_EN": "A stream of blood flows from our ancient longing\nOur lament throbs in the lancet-house of our breast\n\nThe scent of the flower carried the garden's secret outside\nWhat a calamity—the flowers themselves are informers of the garden\n\nThe era of roses ended, the garden's instrument broke\nThe melodious ones flew from the branches\n\nOne nightingale remains, absorbed in song still\nIn its breast, the turbulence of melodies still\n\nThe doves have become averse to the cypress branch\nThe flower petals, falling, have become scattered"
  },
  {
    "TEXT_ID": "iqbal_00189",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "وہ پرانی روشیں باغ کی ویراں بھی ہوئیں",
    "TITLE_EN": "Those old ways of the garden have become desolate",
    "CONTENT": "وہ پرانی روشیں باغ کی ویراں بھی ہوئیں\nڈالیاں پیرہن برگ سے عریاں بھی ہوئیں\n\nقید موسم سے طبیعت رہی آزاد اس کی\nکاش گلشن میں سمجھتا کوئی فریاد اس کی\n\nلطف مرنے میں ہے باقی نہ مزہ جینے میں\nکچھ مزہ ہے تو یہی خون جگر پینے میں\n\nکتنے بیتاب ہیں جوہر مرے آئینے میں\nکس قدر جلوے تڑپتے ہیں مرے سینے میں\n\nاس گلستاں میں مگر دیکھنے والے ہی نہیں\nداغ جو سینے میں رکھتے ہوں وہ لالے ہی نہیں",
    "TRANSLATION_EN": "Those old ways of the garden have become desolate\nThe branches have become bare of the garment of leaves\n\nIts nature remained free from the imprisonment of seasons\nIf only someone in the garden understood its cry\n\nThe pleasure remains in dying, not the taste in living\nIf there's any taste, it's in drinking the blood of the liver\n\nHow restless are the essences in my mirror\nHow many radiances tremble in my breast\n\nIn this garden, there are no observers though\nThere are no tulips bearing scars in their breasts"
  },
  {
    "TEXT_ID": "iqbal_00190",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "چاک اس بلبل تنہا کی نوا سے دل ہوں",
    "TITLE_EN": "I am hearts torn by the song of that lonely nightingale",
    "CONTENT": "چاک اس بلبل تنہا کی نوا سے دل ہوں\nجاگنے والے اسی بانگ درا سے دل ہوں\n\nیعنی پھر زندہ نئے عہد وفا سے دل ہوں\nپھر اسی بادۂ دیرینہ کے پیاسے دل ہوں\n\nعجمی خم ہے تو کیا مے تو حجازی ہے مری\nنغمہ ہندی ہے تو کیا لے تو حجازی ہے مری\n\nکیوں زیاں کار بنوں سود فراموش رہوں\nفکر فردا نہ کروں محو غم دوش رہوں\n\nنالے بلبل کے سنوں اور ہمہ تن گوش رہوں\nہم نوا میں بھی کوئی گل ہوں کہ خاموش رہوں",
    "TRANSLATION_EN": "I am hearts torn by the song of that lonely nightingale\nI am hearts awakened by that call of the door\n\nThat is, I am hearts revived by a new era of fidelity\nAgain, I am hearts thirsty for that ancient wine\n\nIf the vessel is Persian, so what—my wine is Hejazi\nIf the song is Indian, so what—my melody is Hejazi\n\nWhy should I remain a loser, forgetful of profit?\nWhy should I not think of tomorrow, absorbed in yesterday's grief?\n\nShould I listen to the nightingale's laments and remain all ears?\nIn harmony, am I a flower that I should remain silent?"
  },
  {
    "TEXT_ID": "iqbal_00199",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "بت صنم خانوں میں کہتے ہیں مسلمان گئے",
    "TITLE_EN": "In the temples, the idols say the Muslims have gone",
    "CONTENT": "بت صنم خانوں میں کہتے ہیں مسلمان گئے\nہے خوشی ان کو کہ کعبے کے نگہبان گئے\n\nمنزل دہر سے اونٹوں کے حدی خوان گئے\nاپنی بغلوں میں دبائے ہوئے قرآن گئے\n\nخندہ زن کفر ہے احساس تجھے ہے کہ نہیں\nاپنی توحید کا کچھ پاس تجھے ہے کہ نہیں\n\nیہ شکایت نہیں ہیں ان کے خزانے معمور\nنہیں محفل میں جنہیں بات بھی کرنے کا شعور\n\nقہر تو یہ ہے کہ کافر کو ملیں حور و قصور\nاور بیچارے مسلماں کو فقط وعدۂ حور\n\nاب وہ الطاف نہیں ہم پہ عنایات نہیں\nبات یہ کیا ہے کہ پہلی سی مدارات نہیں\n\nکیوں مسلمانوں میں ہے دولت دنیا نایاب\nتیری قدرت تو ہے وہ جس کی نہ حد ہے نہ حساب",
    "TRANSLATION_EN": "In the temples, the idols say the Muslims have gone\nThey are happy that the guardians of the Kaaba have gone\n\nThe reciters of elegies have gone from the worldly abode\nPressing the Quran to their armpits, they have gone\n\nDisbelief laughs, do you feel it or not?\nDo you have any regard for your monotheism or not?\n\nThis is no complaint that their treasures are full\nOf those who have no sense even to speak in gatherings\n\nThe tyranny is that the infidel gets houris and palaces\nAnd the poor Muslim only gets the promise of houris\n\nNow those favors are no more, no blessings upon us\nWhat is this matter, that former regard is no more?\n\nWhy is the wealth of the world rare among Muslims?\nYour power is such that has no limit, no account"
  },
  {
    "TEXT_ID": "iqbal_00203",
    "AUTHOR_ID": "iqbal",
    "TITLE_UR": "ستاروں سے آگے جہاں اور بھی ہیں",
    "TITLE_EN": "Beyond the stars, there are more worlds",
    "CONTENT": "ستاروں سے آگے جہاں اور بھی ہیں\nابھی عشق کے امتحاں اور بھی ہیں\n\nتہی زندگی سے نہیں یہ فضائیں\nیہاں سیکڑوں کارواں اور بھی ہیں\n\nقناعت نہ کر عالم رنگ و بو پر\nچمن اور بھی آشیاں اور بھی ہیں\n\nاگر کھو گیا اک نشیمن تو کیا غم\nمقامات آہ و فغاں اور بھی ہیں\n\nتو شاہیں ہے پرواز ہے کام تیرا\nترے سامنے آسماں اور بھی ہیں\n\nاسی روز و شب میں الجھ کر نہ رہ جا\nکہ تیرے زمان و مکاں اور بھی ہیں\n\nگئے دن کہ تنہا تھا میں انجمن میں\nیہاں اب مرے رازداں اور بھی ہیں",
    "TRANSLATION_EN": "Beyond the stars, there are more worlds\nStill more tests of love await\n\nThese spaces are not empty of life\nHere there are hundreds more caravans\n\nDo not be content with this world of color and fragrance\nThere are more gardens, more nests\n\nIf one nest is lost, what grief?\nThere are more places for sighs and laments\n\nYou are a falcon, flight is your destiny\nBefore you lie more skies\n\nDo not get entangled in this day and night\nFor you have more times and spaces\n\nGone are the days when I was alone in the assembly\nNow I have more confidants here"
  }
]