[
  {
    "TEXT_ID": "kazmi_0001",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "دل دھڑکنے کا سبب یاد آیا",
    "TITLE_EN": "Dil Dhadakne Ka Sabab Yaad Aaya",
    "CONTENT": "دل دھڑکنے کا سبب یاد آیا\nوہ ترا عکس لبِ لب یاد آیا\n\nاک ستارہ تھا کہ ٹوٹا تھا کبھی\nآج پھر وہی شبِ غم یاد آیا\n\nکون سی بات تھی جو یاد آئی\nکون سا حادثۂ غم یاد آیا\n\nزندگی ایک سوال بن کر رہ گئی\nپھر وہی تیرا تبسم یاد آیا\n\nناصرؔ الجھے ہوئے موسموں میں\nاک بھلا دینے والا لمحہ یاد آیا",
    "TRANSLATION_EN": "I remembered the reason my heart beats\nYour reflection, on the verge of my lips, I remembered\n\nA star that had fallen once\nToday, that same night of sorrow I remembered\n\nWhat was it that I remembered?\nWhich sorrowful incident I remembered\n\nLife remained, having become a question\nThat smile of yours, I remembered again\n\nNasir, in these tangled seasons\nI remembered a moment that makes one forget",
    "notes": "One of Kazmi's most iconic ghazals, frequently sung and recited. It perfectly encapsulates his theme of nostalgic longing."
  },
  {
    "TEXT_ID": "kazmi_0002",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "وہ تیری یاد تھی اب یاد آیا",
    "TITLE_EN": "Woh Teri Yaad Thi Ab Yaad Aaya",
    "CONTENT": "وہ تیری یاد تھی اب یاد آیا\nوہ دل کا داغ تھا اب یاد آیا\n\nبہت برس میں اُداس بیٹھا تھا\nوہ پھر کیا بات تھی اب یاد آیا\n\nوہ خوشبوؤں کی طرح مہکا تھا\nکوئی مرے ساتھ تھا اب یاد آیا\n\nدھواں دھواں سا کوئی تھا کہ میں تھا\nکہ وقت کا ہاتھ تھا اب یاد آیا\n\nناصرؔ اس بھری دنیا میں کیا رکھا ہے\nکوئی اپنا تھا اب یاد آیا",
    "TRANSLATION_EN": "That was your memory, now I remember\nThat was the scar on the heart, now I remember\n\nI sat for many years in sadness\nWhat was that matter now I remember\n\nIt was fragrant like perfumes\nSomeone was with me, now I remember\n\nIt was someone smoky, or it was me\nOr it was time's hand, now I remember\n\nNasir, what is there in this world?\nI had someone of my own, now I remember",
    "notes": "A masterclass in delayed grief and remembrance, where the poet only understands the depth of his loss in retrospect."
  },
  {
    "TEXT_ID": "kazmi_0003",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "گلی گلی میری یاد بچھی ہے",
    "TITLE_EN": "Gali Gali Meri Yaad Bichhi Hai",
    "CONTENT": "گلی گلی میری یاد بچھی ہے پیارے راستہ دیکھ کے چل\nمجھ سے اتنی وحشت ہے تو میری حدوں سے دور نکل\n\nاک زمانہ تیرا پھول سا نازک ہاتھ تھا میرے شانوں پر\nاک یہ وقت کہ میں تنہا اور دکھ کے کانٹوں کا جنگل\n\nیاد ہے اب تک تجھ سے بچھڑنے کی وہ اندھیری شام مجھے\nتو خاموش کھڑا تھا لیکن باتیں کرتا تھا کاجل\n\nمیں تو ایک نئی دنیا کی دھن میں بھٹکتا پھرتا ہوں\nمیری تجھ سے کیسے نبھے گی ایک ہیں تیرے فکر و عمل\n\nمیرا منہ کیا دیکھ رہا ہے دیکھ اس کالی رات کو دیکھ\nمیں وہی تیرا ہم راہی ہوں ساتھ مرے چلنا ہو تو چل\n\nناصرؔ اس دشت میں کھو جانا خیر نہیں اک صورت\nراہ نما چاہیے ورنہ منزل ہے تو کیا منزل ہے",
    "TRANSLATION_EN": "In every lane my memory is strewn, O beloved, watch your step\nIf you are so averse to me, then move beyond my borders\n\nOnce, your delicate, flower-like hand was on my shoulders\nNow, this time when I am alone, amidst a forest of thorns of sorrow\n\nI still remember that dark evening of separation from you\nYou stood silent, but your kohl-rimmed eyes spoke volumes\n\nI wander, obsessed with a new world\nHow will my relationship with you work, when your thoughts and actions are one?\n\nWhy are you looking at my face? Look at this dark night, look\nI am still your companion, if you wish to walk with me, then come\n\nNasir, getting lost in this wilderness is not good; it's just an illusion\nYou need a guide, otherwise, if the destination is just a mirage, then what kind of destination is it?",
    "notes": "A ghazal rich with the signature Kazmi imagery of night, urban landscapes, and existential wandering [citation:3]."
  },
  {
    "TEXT_ID": "kazmi_0004",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "ہوا آہستہ چلو",
    "TITLE_EN": "Hawa Aahista Chalo",
    "CONTENT": "ہوا آہستہ چلو، کوئی یہاں سو رہا ہے\nمرے خوابوں کی تعبیر کہیں کھو رہا ہے\n\nوہ جو ہے چاند، ذرا دھیان سے دیکھو اس کو\nکوئی اپنا ہے جو پردۂ شب میں کھو رہا ہے\n\nشور کیوں کرتے ہو خاموش گلی میں، جاناں\nمیرے دل کا کوئی ارمان ابھی جاگ رہا ہے\n\nاس قدر پیار سے رکھو مرے پھولوں کو نہیں\nان کی خوشبو مجھے دیوانہ کئے دیتی ہے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا ہے\nاور گھر کا پتہ بھی نہیں بھولے سے ملتا ہے",
    "TRANSLATION_EN": "Wind, walk slowly, someone is sleeping here\nThe interpretation of my dreams is getting lost somewhere\n\nThat moon, look at it carefully\nSomeone of our own is losing himself in the veil of night\n\nWhy do you make noise in the silent street, my love?\nSome desire of my heart is still awake\n\nDon't keep my flowers with so much love, no\nTheir scent drives me mad\n\nNasir, I don't even know how to get lost in this fog\nAnd the way home is also found only by chance",
    "notes": "The opening line is a classic example of Kazmi's lyrical softness and his personification of nature."
  },
  {
    "TEXT_ID": "kazmi_0005",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "شام ہوتی ہے نہ راتیں کٹتی ہیں",
    "TITLE_EN": "Shaam Hoti Hai Na Raatein Katti Hain",
    "CONTENT": "شام ہوتی ہے نہ راتیں کٹتی ہیں\nتیری یادوں نے گھیرا ڈالا ہے\n\nپھر وہی دل پہ گزرتی ہے کوئی\nپھر وہی درد کا موسم آیا ہے\n\nدور تک چاندنی پھیلی ہوئی ہے\nدل کہتا ہے تو کہیں کھویا ہے\n\nوہ جو ملا نہ تھا اس میں کیا رکھا ہے\nجو ملا ہے وہ تو آنسوؤں میں ناپا ہے\n\nناصرؔ اس بستی میں کس سے ملیے\nلوگ کچھ اور ہیں کچھ اور تم ہو",
    "TRANSLATION_EN": "Evening doesn't come, nor do nights pass\nYour memories have surrounded me\n\nAgain, something passes over my heart\nAgain, that season of pain has arrived\n\nMoonlight is spread far and wide\nMy heart says you are lost somewhere\n\nWhat is there in what I never got?\nWhat I got, I have only measured in tears\n\nNasir, in this settlement, whom should I meet?\nPeople are something else, and you are something else"
  },
  {
    "TEXT_ID": "kazmi_0006",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "آؤ کچھ دیر رو ہی لیں ناصرؔ",
    "TITLE_EN": "Aao Kuch Dair Ro Hi Lein Nasir",
    "CONTENT": "آؤ کچھ دیر رو ہی لیں ناصرؔ\nپھر یہ دریا اتر نہ جائے کہیں\n\nنیتِ شوق بھر نہ جائے کہیں\nتو بھی دل سے اتر نہ جائے کہیں\n\nآج دیکھا ہے تجھ کو دیر کے بعد\nآج کا دن گزر نہ جائے کہیں\n\nنہ ملا کر اداس لوگوں سے\nحسن تیرا بکھر نہ جائے کہیں\n\nآرزو ہے کہ تو یہاں آئے\nاور پھر عمر بھر نہ جائے کہیں\n\nجی جلاتا ہوں اور سوچتا ہوں\nرائیگاں یہ ہنر نہ جائے کہیں",
    "TRANSLATION_EN": "Come, Nasir, let us weep for a while\nLest this river of tears flow away [citation:6]\n\nLet not the desire of love fade away\nLet you not slip away from my heart someday [citation:6]\n\nI saw you today after so long\nLet this day not just pass away [citation:6]\n\nDo not mix with sad people\nLest your beauty be lost [citation:6]\n\nI wish that you would come here\nAnd then never leave, ever [citation:6]\n\nI burn my heart and think with pain\nMay this talent not go in vain [citation:6]",
    "notes": "A deeply intimate and melancholic ghazal where the poet invites his own name (Nasir) to share a moment of catharsis [citation:6]."
  },
  {
    "TEXT_ID": "kazmi_0007",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "تم ہی کہو کہ کتنا سہی",
    "TITLE_EN": "Tum Hi Kaho Ke Kitna Sahi",
    "CONTENT": "تم ہی کہو کہ کتنا سہی، کس لیے انتظار کیا\nاس کی جو بات تھی وہ ہوئی، اس کی جو بات تھی وہ گئی\n\nہم نے بھی کچھ غبار اٹھایا، غم کی کتاب چھیڑی تھی\nآپ نے بھی تو زندگی سے کچھ شکوے تو کئے ہوں گے\n\nوہ شخص جس کے ہونے سے تھی دل کی تسکین\nاس شخص نے بھی کچھ نہ کیا دل کی تسکین کے لیے\n\nاب کون بتائے گا تجھے کون سی راہ لے جائے گی\nوہ شخص تو چلا گیا، راستے بدل گئے\n\nناصرؔ اس شہر میں کون ہے اپنا\nدل ہے کہ دھڑکتا ہے کسی کے لیے",
    "TRANSLATION_EN": "You tell me, how much did I endure? For what did I wait?\nWhat was to happen, happened; what was to go, went.\n\nI too raised some dust, I opened the book of grief\nYou too must have made some complaints to life.\n\nThat person, whose existence gave solace to the heart\nThat person also did nothing for the heart's solace.\n\nNow who will tell you which path will lead you?\nThat person has left, the paths have changed.\n\nNasir, who in this city is our own?\nThis heart still beats for someone."
  },
  {
    "TEXT_ID": "kazmi_0008",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "پھر تم تو یاد آئے",
    "TITLE_EN": "Phir Tum To Yaad Aaye",
    "CONTENT": "پھر تم تو یاد آئے، اک بات یاد آئی\nدل کو نہ تھا قرار اب، دل کو قرار آیا\n\nاس شہر میں کہاں ہے وہ، جیسے کوئی ستارہ\nوہ شخص جو بچھڑ گیا، اس کا تو انتظار آیا\n\nچلتے ہی رہے ہم تو، منزلوں پہ منزلیں\nپوچھا نہیں کبھی یہ، کیوں سفر بے کار آیا\n\nوہ شخص جو ملا تھا، اس کو تو بھول ہی بیٹھے\nاب اس کے بعد آنے والا، کیوں بار بار آیا\n\nناصرؔ تمہیں پتہ ہے، کیوں رات ڈھلنے لگی ہے\nشاید وہ شخص آئے، جس کا انتظار آیا",
    "TRANSLATION_EN": "Again you were remembered, and with it a memory came\nMy heart had no peace, and now peace has come to the heart\n\nWhere in this city is he, like a star?\nThat person who got separated, for him I now feel a longing\n\nWe just kept walking, destination after destination\nNever asked, why this journey turned out to be in vain\n\nThat person who met me, I ended up forgetting him\nNow, why does the one who came after him, come again and again?\n\nNasir, do you know why the night has begun to fade?\nPerhaps that person will come, for whom I waited."
  },
  {
    "TEXT_ID": "kazmi_0009",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "چاند کی زرد سی چادر",
    "TITLE_EN": "Chand Ki Zard Si Chadar",
    "CONTENT": "چاند کی زرد سی چادر، تنہائی کی رات\nاس میں کھویا ہوا ایک چہرہ، اور کچھ یادوں کی بات\n\nکون سا موسم تھا وہ جب تم ملے تھے\nپھول کھلے تھے یا پتے جھڑے تھے\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا",
    "TRANSLATION_EN": "The moon's pale yellow sheet, the night of loneliness\nLost in it, a face, and some talk of memories\n\nWhat season was it when I met you?\nWere flowers blooming, or were leaves falling?\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home."
  },
  {
    "TEXT_ID": "kazmi_0010",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "یہ تیری یاد ہے یا کوئی خواب ہے",
    "TITLE_EN": "Yeh Teri Yaad Hai Ya Koi Khwab Hai",
    "CONTENT": "یہ تیری یاد ہے یا کوئی خواب ہے\nدل میں اب بھی تیرے آنے کا باب ہے\n\nرات بھر آنکھوں میں کوئی گھومتا ہے\nشاید وہی شخص ہے جو خواب میں کھویا ہے\n\nدرد بھی کچھ ایسے ہیں کہ کہیں نہیں ملتے\nغم بھی کچھ ایسے ہیں کہ سنائے نہیں جاتے\n\nتم تو کب کے اپنی دنیا میں گم ہو\nہم ابھی تک تیری ہی باتوں میں کھوئے ہیں\n\nناصرؔ اس بستی میں اب کون رہتا ہے\nسب تو چلے گئے، کچھ لوگ نہیں رہتے",
    "TRANSLATION_EN": "Is this your memory, or is it a dream?\nIn my heart, the chapter of your arrival still remains.\n\nSomeone wanders in my eyes all night\nPerhaps it's that person who is lost in a dream.\n\nSome pains are such that they are found nowhere\nSome sorrows are such that they can't be narrated.\n\nYou have long been lost in your own world\nWe are still lost in your words.\n\nNasir, who lives in this settlement now?\nEveryone has left, some people just don't stay."
  },
  {
    "TEXT_ID": "kazmi_0011",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "دیر سے ہے دل کو قرار آیا ہوا",
    "TITLE_EN": "Dair Se Hai Dil Ko Qarar Aaya Hua",
    "CONTENT": "دیر سے ہے دل کو قرار آیا ہوا\nشاید وہ شخص ہے انتظار آیا ہوا\n\nیاد آئے تو کچھ باتیں کریں\nورنہ یہ زندگی ہے بے کار آئی ہوئی\n\nکبھی کبھی یوں بھی ہوتا ہے\nیاد کا موسم ہو اور تم نہ ہو\n\nہم نے تو سمجھا تھا بھول گئے تم\nتم تو اور بھی یاد آنے لگے\n\nناصرؔ یہ دنیا بھی کیا چیز ہے\nدل کسی کو دے اور ملے کچھ اور",
    "TRANSLATION_EN": "For a long time, my heart has felt a sense of peace\nPerhaps that person has come, for whom I waited.\n\nIf you remember, then let's talk a little\nOtherwise, this life has come in vain.\n\nSometimes it happens like this too\nIt's the season of memories, and you are not here.\n\nI thought you had forgotten\nBut you, instead, started coming to mind even more.\n\nNasir, what kind of thing is this world?\nYou give your heart to someone, and get something else in return."
  },
  {
    "TEXT_ID": "kazmi_0012",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "اک خواب سا گزرا ہے",
    "TITLE_EN": "Ek Khwab Sa Guzra Hai",
    "CONTENT": "اک خواب سا گزرا ہے، رت بدلی بدلی سی\nپھر دل نے کسی کو ڈھونڈا، پھر آنکھ روئی ہے\n\nوہ شخص جو کبھی تھا میرے دل کے قریب\nاب دور کھڑا ہے، اور مسکرا رہا ہے\n\nتم تو نہیں ہو، پھر کیوں لگتا ہے\nجیسے تم ہو اور کچھ باتیں ہوں\n\nیہ شام کی دھوپ، یہ چڑیوں کا چہکنا\nتم یاد آئے تو سب یاد آیا\n\nناصرؔ اس شہر میں اب کون رہتا ہے\nجس کو بھی دیکھو، وہ اکیلا ہے",
    "TRANSLATION_EN": "A dream has passed, the season seems changed\nThe heart searched for someone again, the eyes wept again.\n\nThat person who was once close to my heart\nNow stands far away, and smiles.\n\nYou are not here, then why does it feel\nAs if you are here, and we are having conversations?\n\nThis evening sunlight, this chirping of sparrows\nWhen I remembered you, I remembered everything.\n\nNasir, who lives in this city now?\nWhoever you see, they are alone."
  },
  {
    "TEXT_ID": "kazmi_0013",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "وہ اک ستارہ جو ٹوٹ کر بجھ گیا",
    "TITLE_EN": "Woh Ek Sitara Jo Toot Kar Bujh Gaya",
    "CONTENT": "وہ اک ستارہ جو ٹوٹ کر بجھ گیا\nاسی لیے شاید آج چاند اداس ہے\n\nتم تو گئے تھے پر لوٹ کے آؤ گے\nیہ بھرم ہے جو ٹوٹ کر بکھر گیا\n\nدل کے اس پار کون رہتا ہے\nیہ سوال ہے جو آنسو بن کے بہہ گیا\n\nاس کی آنکھوں میں نمی تھی کچھ\nمیں نے سمجھا وہ پیار تھا اور میں رہ گیا\n\nناصرؔ اس شام کی تنہائی میں\nایک شخص تھا جو آ کے چلا گیا",
    "TRANSLATION_EN": "That one star which fell and extinguished\nPerhaps that's why the moon is sad today.\n\nYou had left, but you would return\nThis is the illusion that shattered and scattered.\n\nWho lives on the other side of the heart?\nThis is the question that flowed away as tears.\n\nThere was some moisture in her eyes\nI thought it was love, and I was left behind.\n\nNasir, in the loneliness of that evening\nThere was a person who came and then left."
  },
  {
    "TEXT_ID": "kazmi_0014",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "تم آئے تو آنکھوں میں چاندنی سی اتر آئی",
    "TITLE_EN": "Tum Aaye To Aankhon Mein Chandni Si Utar Aayi",
    "CONTENT": "تم آئے تو آنکھوں میں چاندنی سی اتر آئی\nدل کی ویرانیوں میں بہار سی بکھر آئی\n\nکبھی تم نے بھی تو مجھے اپنا سمجھا تھا\nکبھی تم نے بھی تو مجھے یاد کیا تھا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے",
    "TRANSLATION_EN": "When you came, a moonlight descended into my eyes\nA spring seemed to scatter in the desolation of my heart.\n\nDid you ever consider me your own?\nDid you ever remember me?\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?"
  },
  {
    "TEXT_ID": "kazmi_0015",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "یوں تو بہت سی باتیں ہوئیں",
    "TITLE_EN": "Yun To Bohut Si Baatein Hui",
    "CONTENT": "یوں تو بہت سی باتیں ہوئیں، مگر تجھے یاد کیا کریں\nوہ بات جو دل میں رہ گئی، وہ بات نہیں جو ہوئی\n\nکبھی کبھی یوں بھی ہوتا ہے\nیاد کا موسم ہو اور تم نہ ہو\n\nہم نے تو سمجھا تھا بھول گئے تم\nتم تو اور بھی یاد آنے لگے\n\nناصرؔ یہ دنیا بھی کیا چیز ہے\nدل کسی کو دے اور ملے کچھ اور\n\nتم آئے تھے کچھ دیر کو، پھر چل دیے\nہم سوچتے رہ گئے، یوں ہی چل دیے",
    "TRANSLATION_EN": "Many things were said, but how should I remember you?\nThat matter which remained in the heart, is not the one that was spoken.\n\nSometimes it happens like this too\nIt's the season of memories, and you are not here.\n\nI thought you had forgotten\nBut you, instead, started coming to mind even more.\n\nNasir, what kind of thing is this world?\nYou give your heart to someone, and get something else in return.\n\nYou came for a while, then left\nI kept wondering, just like that, you left."
  },
  {
    "TEXT_ID": "kazmi_0016",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "رات بھر میں نے ستارے گنے",
    "TITLE_EN": "Raat Bhar Maine Sitare Gine",
    "CONTENT": "رات بھر میں نے ستارے گنے\nکوئی تجھ سا نہیں ملتا\n\nدن ڈھلا تو آنکھوں میں کچھ نمی آئی\nیادوں کے چراغ جلنے لگے\n\nتم بھی کبھی تو یاد آؤ گے\nیہ سوچ کر میں نے زندگی گنوا دی\n\nہم نے تو سمجھا تھا بھول گئے تم\nتم تو اور بھی یاد آنے لگے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے",
    "TRANSLATION_EN": "All night I counted the stars\nNo one like you is found.\n\nWhen the day ended, some moisture came to my eyes\nThe lamps of memory began to light.\n\nYou will also be remembered someday\nThinking this, I wasted my life.\n\nI thought you had forgotten\nBut you, instead, started coming to mind even more.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?"
  },
  {
    "TEXT_ID": "kazmi_0017",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "دل کو ترے غموں سے کچھ نسبت ہے",
    "TITLE_EN": "Dil Ko Tere Ghamon Se Kuch Nisbat Hai",
    "CONTENT": "دل کو ترے غموں سے کچھ نسبت ہے\nورنہ اور کسی سے کیا لگاؤ ہے\n\nیاد تو ایسے آتی ہے جیسے کوئی چیز کھو گئی ہو\nاور اس کی کمی ہر پل کھلتی ہو\n\nتم آئے تو لگا جیسے سب مل گیا\nتم گئے تو لگا جیسے سب کھو گیا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nناصرؔ اس شہر میں کون ہے اپنا\nدل ہے کہ دھڑکتا ہے کسی کے لیے",
    "TRANSLATION_EN": "My heart has some connection with your sorrows\nOtherwise, what attachment do I have with anyone else?\n\nMemory comes as if something has been lost\nAnd its absence is revealed every moment.\n\nWhen you came, it felt like everything was found\nWhen you left, it felt like everything was lost.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nNasir, who in this city is our own?\nThis heart still beats for someone."
  },
  {
    "TEXT_ID": "kazmi_0018",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "یہ جو چاندنی راتیں ہیں",
    "TITLE_EN": "Yeh Jo Chandni Raatein Hain",
    "CONTENT": "یہ جو چاندنی راتیں ہیں، یہ جو خاموش فضا ہے\nان میں کھویا ہوا کوئی، یادوں کا دیا ہے\n\nکبھی تم نے بھی تو مجھے چاہا تھا\nکبھی تم نے بھی تو مجھے یاد کیا تھا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے",
    "TRANSLATION_EN": "These moonlit nights, this silent atmosphere\nIn them, someone lost, a lamp of memories.\n\nDid you ever love me?\nDid you ever remember me?\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?"
  },
  {
    "TEXT_ID": "kazmi_0019",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "برسوں بعد کسی کو یاد کیا",
    "TITLE_EN": "Barson Baad Kisi Ko Yaad Kiya",
    "CONTENT": "برسوں بعد کسی کو یاد کیا\nدل کو پھر سے غموں سے آباد کیا\n\nوہ شخص جو بھولے سے مل گیا تھا\nاس نے پھر سے زندگی برباد کیا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nہم نے تو سمجھا تھا بھول گئے تم\nتم تو اور بھی یاد آنے لگے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے",
    "TRANSLATION_EN": "After years, I remembered someone\nI populated the heart with sorrows again.\n\nThat person who was met by chance\nThey ruined life again.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nI thought you had forgotten\nBut you, instead, started coming to mind even more.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?"
  },
  {
    "TEXT_ID": "kazmi_0020",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "تم نہیں ہو تو کیا، ہو تو سا لگتا ہے",
    "TITLE_EN": "Tum Nahin Ho To Kya, Ho To Sa Lagta Hai",
    "CONTENT": "تم نہیں ہو تو کیا، ہو تو سا لگتا ہے\nہر طرف تم ہی تم ہو، سب تم ہی تم لگتا ہے\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا\n\nیہ شام کی دھوپ، یہ چڑیوں کا چہکنا\nتم یاد آئے تو سب یاد آیا",
    "TRANSLATION_EN": "You are not here, so what? It feels as if you are\nEverywhere it's only you, everything seems like you.\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home.\n\nThis evening sunlight, this chirping of sparrows\nWhen I remembered you, I remembered everything."
  },
  {
    "TEXT_ID": "kazmi_0021",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "اب کے موسم میں نہ جا",
    "TITLE_EN": "Ab Ke Mausam Mein Na Ja",
    "CONTENT": "اب کے موسم میں نہ جا، اب کے موسم میں نہ جا\nچاندنی راتیں ہیں اور یاد کے لمحے ہیں\n\nاب کے موسم میں نہ جا، پھول کھلے ہیں بہت\nدل کے ویرانے میں اک پھول کھلا ہے تنہا\n\nاب کے موسم میں نہ جا، برکھا رُت آئی ہے\nیادوں کی بوندیں ٹپکی ہیں، آنکھیں بھیگ گئیں\n\nاب کے موسم میں نہ جا، ناصرؔ اداس ہے\nتیرے بغیر یہ دل اور بھی تنہا ہے",
    "TRANSLATION_EN": "Don't go this season, don't go this season\nThere are moonlit nights and moments of memory.\n\nDon't go this season, many flowers have bloomed\nIn the desolation of the heart, one flower blooms alone.\n\nDon't go this season, the rains have come\nDrops of memories have fallen, eyes have become wet.\n\nDon't go this season, Nasir is sad\nWithout you, this heart is even more lonely."
  },
  {
    "TEXT_ID": "kazmi_0022",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "رات بہت تھی، چاند بھی تھا",
    "TITLE_EN": "Raat Bohut Thi, Chaand Bhi Tha",
    "CONTENT": "رات بہت تھی، چاند بھی تھا، اور تیرا خیال بھی تھا\nپھر بھی دل کو قرار نہ آیا، کیوں قرار نہ آیا\n\nوہ جو باتیں تم نے کی تھیں، وہ جو وعدے تم نے کیے تھے\nسب ہوا ہوا میں اڑ گئے، کچھ نہ بچا، کچھ نہ بچا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nہم نے تو سمجھا تھا بھول گئے تم\nتم تو اور بھی یاد آنے لگے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے",
    "TRANSLATION_EN": "The night was long, there was a moon, and also thoughts of you\nStill, the heart found no peace, why did it find no peace?\n\nThose talks you had, those promises you made\nAll blew away in the wind, nothing remained, nothing remained.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nI thought you had forgotten\nBut you, instead, started coming to mind even more.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?"
  },
  {
    "TEXT_ID": "kazmi_0023",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "کچھ تو ہے جس کی وجہ سے",
    "TITLE_EN": "Kuch To Hai Jis Ki Wajah Se",
    "CONTENT": "کچھ تو ہے جس کی وجہ سے، یہ دل اداس رہتا ہے\nشاید تیری یاد ہے، یا کوئی پیاس رہتا ہے\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "There is something because of which this heart remains sad\nPerhaps it's your memory, or some thirst remains.\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0024",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "تم نہ آئے تو ہم سوچتے رہ گئے",
    "TITLE_EN": "Tum Na Aaye To Hum Sochte Reh Gaye",
    "CONTENT": "تم نہ آئے تو ہم سوچتے رہ گئے\nکاش تم آتے تو کیا ہوتا\n\nہم نے تو سمجھا تھا تم آؤ گے\nتم نہ آئے تو دل ٹوٹ گیا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے\n\nیہ شام کی دھوپ، یہ چڑیوں کا چہکنا\nتم یاد آئے تو سب یاد آیا",
    "TRANSLATION_EN": "When you didn't come, I kept wondering\nIf only you had come, what would have happened?\n\nI thought you would come\nWhen you didn't come, my heart broke.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?\n\nThis evening sunlight, this chirping of sparrows\nWhen I remembered you, I remembered everything."
  },
  {
    "TEXT_ID": "kazmi_0025",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "دل کی بات کہی نہیں جاتی",
    "TITLE_EN": "Dil Ki Baat Kahi Nahin Jati",
    "CONTENT": "دل کی بات کہی نہیں جاتی\nتم سے کیا شکوہ کیا جائے\n\nدرد تو ایسے ہیں کہ سہے نہیں جاتے\nغم تو ایسے ہیں کہ سنائے نہیں جاتے\n\nتم تو کب کے اپنی دنیا میں گم ہو\nہم ابھی تک تیری ہی باتوں میں کھوئے ہیں\n\nناصرؔ اس بستی میں اب کون رہتا ہے\nسب تو چلے گئے، کچھ لوگ نہیں رہتے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "The heart's matter cannot be spoken\nWhat complaint can I make to you?\n\nSome pains are such that they cannot be endured\nSome sorrows are such that they can't be narrated.\n\nYou have long been lost in your own world\nWe are still lost in your words.\n\nNasir, who lives in this settlement now?\nEveryone has left, some people just don't stay.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0026",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "بچھڑنے والے کو کبھی نہیں بھولتے",
    "TITLE_EN": "Bicharnewale Ko Kabhi Nahin Bhoolte",
    "CONTENT": "بچھڑنے والے کو کبھی نہیں بھولتے\nاسے بھول کر بھی یاد کر لیتے ہیں\n\nدل تو جلتا ہے، آنکھیں نم ہوتی ہیں\nپھر بھی لوگ مسکرا لیتے ہیں\n\nتم تو گئے تھے پر لوٹ کے آؤ گے\nیہ بھرم ہے جو ٹوٹ کر بکھر گیا\n\nناصرؔ اس شام کی تنہائی میں\nایک شخص تھا جو آ کے چلا گیا\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "We never forget those who leave us\nEven when trying to forget, we remember them.\n\nThe heart burns, eyes become moist\nStill, people manage to smile.\n\nYou had left, but you would return\nThis is the illusion that shattered and scattered.\n\nNasir, in the loneliness of that evening\nThere was a person who came and then left.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0027",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "کوئی تو ہے جو طے کرے",
    "TITLE_EN": "Koi To Hai Jo Tay Kare",
    "CONTENT": "کوئی تو ہے جو طے کرے، کون سی بات کہی جائے\nکبھی تم یاد آؤ تو کبھی تمہیں بھلایا جائے\n\nدل تو جلتا ہے، آنکھیں نم ہوتی ہیں\nپھر بھی لوگ مسکرا لیتے ہیں\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا",
    "TRANSLATION_EN": "Is there anyone who can decide, what should be said?\nSometimes you are remembered, sometimes I try to forget you.\n\nThe heart burns, eyes become moist\nStill, people manage to smile.\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home."
  },
  {
    "TEXT_ID": "kazmi_0028",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "اک شخص تھا جو کبھی ملا تھا",
    "TITLE_EN": "Ek Shakhs Tha Jo Kabhi Mila Tha",
    "CONTENT": "اک شخص تھا جو کبھی ملا تھا\nاس نے پھر سے زندگی برباد کیا\n\nوہ جو باتیں تم نے کی تھیں، وہ جو وعدے تم نے کیے تھے\nسب ہوا ہوا میں اڑ گئے، کچھ نہ بچا، کچھ نہ بچا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "There was a person I once met\nThey ruined life again.\n\nThose talks you had, those promises you made\nAll blew away in the wind, nothing remained, nothing remained.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0029",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "وہ شخص جو بھولے سے مل گیا تھا",
    "TITLE_EN": "Woh Shakhs Jo Bhoolay Se Mil Gaya Tha",
    "CONTENT": "وہ شخص جو بھولے سے مل گیا تھا\nاس نے پھر سے زندگی برباد کیا\n\nکبھی تم نے بھی تو مجھے چاہا تھا\nکبھی تم نے بھی تو مجھے یاد کیا تھا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "That person who was met by chance\nThey ruined life again.\n\nDid you ever love me?\nDid you ever remember me?\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0030",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "کبھی کبھی یوں بھی ہوتا ہے",
    "TITLE_EN": "Kabhi Kabhi Yun Bhi Hota Hai",
    "CONTENT": "کبھی کبھی یوں بھی ہوتا ہے\nیاد کا موسم ہو اور تم نہ ہو\n\nدل تو جلتا ہے، آنکھیں نم ہوتی ہیں\nپھر بھی لوگ مسکرا لیتے ہیں\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "Sometimes it happens like this too\nIt's the season of memories, and you are not here.\n\nThe heart burns, eyes become moist\nStill, people manage to smile.\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0031",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "یاد تو بہت آتے ہو",
    "TITLE_EN": "Yaad To Bohut Aate Ho",
    "CONTENT": "یاد تو بہت آتے ہو، پر بات نہیں کرتے\nکیا بات ہے تمہیں، کچھ تو بتاؤ\n\nدل تو جلتا ہے، آنکھیں نم ہوتی ہیں\nپھر بھی لوگ مسکرا لیتے ہیں\n\nتم تو گئے تھے پر لوٹ کے آؤ گے\nیہ بھرم ہے جو ٹوٹ کر بکھر گیا\n\nناصرؔ اس شام کی تنہائی میں\nایک شخص تھا جو آ کے چلا گیا\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "You are remembered a lot, but you don't speak\nWhat is the matter with you? Tell me something.\n\nThe heart burns, eyes become moist\nStill, people manage to smile.\n\nYou had left, but you would return\nThis is the illusion that shattered and scattered.\n\nNasir, in the loneliness of that evening\nThere was a person who came and then left.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0032",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "کون سا موسم تھا وہ",
    "TITLE_EN": "Kaun Sa Mausam Tha Woh",
    "CONTENT": "کون سا موسم تھا وہ، جب تم ملے تھے\nپھول کھلے تھے یا پتے جھڑے تھے\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا\n\nیہ شام کی دھوپ، یہ چڑیوں کا چہکنا\nتم یاد آئے تو سب یاد آیا",
    "TRANSLATION_EN": "What season was it when I met you?\nWere flowers blooming, or were leaves falling?\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home.\n\nThis evening sunlight, this chirping of sparrows\nWhen I remembered you, I remembered everything."
  },
  {
    "TEXT_ID": "kazmi_0040",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "کون سی بات تھی جو یاد آئی",
    "TITLE_EN": "Kaun Si Baat Thi Jo Yaad Aayi",
    "CONTENT": "کون سی بات تھی جو یاد آئی\nکون سا حادثۂ غم یاد آیا\n\nوہ شخص جو بھولے سے مل گیا تھا\nاس نے پھر سے زندگی برباد کیا\n\nاب تو یوں ہے کہ جب بھی کوئی بات ہوتی ہے\nاس میں تیرا ذکر ضرور آتا ہے\n\nناصرؔ اس دل کو قرار آتا نہیں\nکوئی تو ہے جو اس کو قرار دے\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "What was it that I remembered?\nWhich sorrowful incident I remembered.\n\nThat person who was met by chance\nThey ruined life again.\n\nNow it's such that whenever any matter occurs,\nYour mention is sure to come up in it.\n\nNasir, this heart finds no peace\nIs there anyone who can give it peace?\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  },
  {
    "TEXT_ID": "kazmi_0047",
    "AUTHOR_ID": "kazmi",
    "TITLE_UR": "دکھ تو بہت ہیں مگر کہہ نہیں سکتے",
    "TITLE_EN": "Dukh To Bohut Hain Magar Keh Nahin Sakte",
    "CONTENT": "دکھ تو بہت ہیں مگر کہہ نہیں سکتے\nتم سے کیا شکوہ کیا جائے\n\nوہ جو ملا تھا، اس کی آنکھوں میں کیا تھا\nکوئی سمندر تھا یا کوئی صحرا تھا\n\nاب تو یوں ہے جیسے بھولے سے بھی\nیاد نہیں آتا کہ کیوں آتے تھے\n\nناصرؔ اس دھند میں کھونا بھی نہیں آتا\nاور گھر کا پتہ بھی نہیں ملتا\n\nیہ زندگی بھی کیا چیز ہے\nتم ملے تو سب ملا، تم نہ ملے تو کچھ نہ ملا",
    "TRANSLATION_EN": "There are many sorrows, but I cannot speak them\nWhat complaint can I make to you?\n\nWhat was in the eyes of the one I met?\nWas it an ocean, or a desert?\n\nNow it's as if, even by mistake,\nI don't remember why you used to come.\n\nNasir, I don't even know how to get lost in this fog\nAnd I can't even find the way home.\n\nWhat kind of thing is this life?\nIf I got you, I got everything; if I didn't get you, I got nothing."
  }
]